[
  {
    "link": "https://arxiv.org/pdf/2601.11009v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Xiaodong Jia",
      "Xiaoyong Xi"
    ],
    "title": "Notes on countable frames",
    "abstract": "Matthew de Brecht raised the question of whether countable frames are continuous lattices. We prove that the continuity of a countable frame implies the quasicontinuity of its corresponding spectrum in the dual specialization order. We further show that this question admits a positive answer if the frame's spectrum is a $T_1$ space or a Scott space. In general, we confirm the existence of non-continuous countable frames. This work also partially addresses an open problem proposed by Jimmie Lawson and Michael Mislove in 1990, which concerns the characterization of when the spectrums of spatial frames are Scott spaces.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10991v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Hirosuke Yamamoto",
      "Ken-ichi Iwata"
    ],
    "title": "Asymmetric Encoding-Decoding Schemes for Lossless Data Compression",
    "abstract": "This paper proposes a new lossless data compression coding scheme named an asymmetric encoding-decoding scheme (AEDS), which can be considered as a generalization of tANS (tabled variant of asymmetric numeral systems). In the AEDS, a data sequence $\\bm{s}=s_1s_2\\cdots s_n$ is encoded in backward order $s_t, t=n, \\cdots, 2,1$, while $\\bm{s}$ is decoded in forward order $s_t, t=1, 2, \\cdots, n$ in the same way as the tANS. But, the code class of the AEDS is much broader than that of the tANS. We show for i.i.d.~sources that an AEDS with 2 states (resp.~5 states) can attain a shorter average code length than the Huffman code if a child of the root in the Huffman code tree has a probability weight larger than 0.61803 (resp.~0.56984). Furthermore, we derive several upper bounds on the average code length of the AEDS, which also hold for the tANS, and we show that the average code length of the optimal AEDS and tANS with $N$ states converges to the source entropy with speed $O(1/N)$ as $N$ increases.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10977v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Haoran Xu",
      "Jie Ren",
      "Xingye Yue"
    ],
    "title": "A Non-compact Positivity-Preserving Scheme for Parabolic PDE via Conditional Expectation",
    "abstract": "We propose a novel non-compact, positivity-preserving scheme for linear non-divergence form parabolic equations. Based on the Feynman-Kac formula, the solution is expressed as a conditional expectation of an associated diffusion process. Instead of using compact Markov chain approximations, we employ a wide stencil scheme to approximate the conditional expectation, ensuring consistency and positivity preservation. This method is effective for anisotropic diffusion with mixed derivatives, where classical schemes often fail unless the covariance matrix is diagonally dominated.\n  A key feature of our framework is its robust treatment of boundary conditions, which avoids the accuracy loss commonly encountered in BZ and semi-Lagrangian schemes. For Dirichlet boundaries, we introduce (i) a quad-tree non-uniform stopping time scheme with O($Δt^{1/2}$) accuracy and (ii) a quad-tree uniform stopping time scheme with O($Δt$) accuracy. For Neumann boundaries, we use discrete specular reflection with O($Δt^{1/2}$) convergence, while periodic boundaries are treated using modular wrapping, achieving O($Δt$) accuracy. All analyses are conducted under the practical scaling $Δt \\sim h$.\n  Except for the uniform stopping time scheme, all schemes are explicit. The schemes are unconditionally stable and positive preserving, thanks to the probabilistic structure. To ensure consistency, a non-compact stencil is involved, which leads to the large time step constraint $Δt \\sim h$. Numerical experiments confirm the predicted $L^\\infty$ convergence rates for all types of boundary conditions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10969v1",
    "categories": [
      "math.GR",
      "math.CO",
      "math.GT"
    ],
    "authors": [
      "Xiaogang Li",
      "Yao Tian"
    ],
    "title": "A classification of regular maps with Euler characteristic $-p^4$ for a prime $p\\geq 5$",
    "abstract": "A map is a cellular decomposition of a closed surface. In the framework of classifying all regular maps by their supporting surface, it is an open problem to find all closed surfaces that support no regular maps. Classification of regular maps on surfaces with Euler characteristic $-p, -p^2, -p^3, -2p,$ and $-3p$ has already been done by several authors in a series of papers, which also show that surfaces with these Euler characteristic support no regular maps if the corresponding prime $p$ satisfies certain conditions. In this paper, assuming that $p\\geq 5$ is a prime and $i\\geq 4$, we show that the order of a Sylow $p$-subgroup of a regular map with Euler characteristic $-p^i$ is bounded by $p^{i-1}$ unless $p\\in \\{5, 7, 13\\}$, and we show the existence of a normal $p$-subgroup for these regular maps whenever a Sylow $p$-subgroup has order at least $\\sqrt{p^i}$, laying a solid foundation for using an inductive method to completely characterize regular maps of Euler characteristic $-p^i$. Based on this, we classify all regular maps with Euler characteristic $-p^4$ for a prime $p\\geq 5$ in terms of reduced presentations of their automorphism groups. Consequently, a closed surface with Euler characteristic $-p^4$ supports no regular maps if and only if $p\\notin \\{2,3,5,7,13\\}$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10952v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "George Dunn",
      "Elizabeth Stojanovski",
      "Bishnu Lamichhane",
      "Hadi Charkhgard",
      "Ali Eshragh"
    ],
    "title": "Modified Dynamic Programming Algorithms for Order Picking in Single-Block and Two-Block Rectangular Warehouses",
    "abstract": "Recent research has shown that optimal picker tours in rectangular warehouses exhibit deterministic travel patterns within each aisle, and that certain previously considered traversals are unnecessary. Using these insights, this paper proposes modifications to dynamic programming algorithms that improve computational efficiency without affecting optimality. For layouts with and without a central cross-aisle, the modifications preserve linear-time complexity in the number of aisles while reducing the number of state-action evaluations per stage. The proposed modifications reduce computational effort by factors up to 1.81, confirmed by numerical experiments. These findings are encouraging and highlight how structural refinements can yield significant improvements in practical performance of algorithms.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10941v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Damien Galant",
      "Tobias Weth"
    ],
    "title": "Normalized solutions of Nehari-Pankov type to indefinite variational problems",
    "abstract": "We consider abstract nonlinear equations of the form $A u = λu + I'(u)$, where $A$ is a self-adjoint operator with compact resolvent on a Hilbert space $H$, $λ\\in \\mathbf{R}$ is a parameter, and $u \\mapsto I'(u)$ is a superlinear term of variational nature. In this abstract setting, we develop a new approach to existence and multiplicity of solutions with prescribed norm in $H$. We then consider various applications of this approach. First, we obtain, under fairly general assumptions including the mass-supercritical case, the existence of infinitely many solutions to a class of nonlinear (time-independent) Schrödinger equations on a compact graph $\\mathcal{G}$ with prescribed (arbitrarily large) mass. Moreover, we derive a similar existence and multiplicity result for a biharmonic semilinear equation in the $2$-torus. For a larger class of second order and higher order equations in a bounded domain with Dirichlet boundary conditions, we also show the existence of multiple solutions with prescribed small mass.\n  The solutions we obtain are detected as ground states of Nehari-Pankov type for the associated $λ$-dependent action functional, where $λ$ varies in a spectral gap between sufficiently large eigenvalues of $A$. The key observation in this abstract framework is the fact that the $H$-norms of these $λ$-dependent solution families form connected sets. To estimate the size of these connected sets in specific settings, we use Weyl type estimates for the length of spectral gaps, variational characterizations of eigenvalues, bounds for associated eigenfunctions and a classical bound from analytic number theory.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10934v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Rudrendra Kashyap",
      "Ruoxi Li"
    ],
    "title": "Classification of Invariant Algebraic D-Modules on Semisimple and General Linear Groups",
    "abstract": "We study left-translation invariant algebraic $D$-modules on complex affine algebraic groups. Using the standard description of these objects as left-invariant flat algebraic connections on the trivial vector bundle, modulo algebraic gauge transformations, we recast the classification problem as an explicit moduli problem for constant connections.\n  Our main results treat the semisimple case and the general linear case. For a connected semisimple complex algebraic group $G$, we show that invariant $D$-modules of rank $n$ are determined by the finite central kernel of the simply connected cover of $G$: equivalently, their isomorphism classes are classified by $n$-dimensional complex representations of that finite group, up to conjugacy. For a general linear group, we prove that every invariant $D$-module of rank $n$ is obtained by pullback along the determinant map from the one-dimensional torus, so the classification reduces completely to the torus case.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10927v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Todd Cochrane",
      "Andrew Granville",
      "Junren Zheng"
    ],
    "title": "Mixed incomplete character sums of rational functions with smooth moduli",
    "abstract": "Let $χ=χ_q$ be a primitive character mod $q$ and fix $Δ>0$. In 1989 Graham and Ringrose gave strong bounds on character sums $\\sum_{M<n\\leq M+N} χ(n)$ in intervals of length $N=q^Δ$ whenever $q$ is squarefree and is sufficiently smooth. Here we show that the smoothness parameter can be taken to be $N^{1-ε}$. We also discuss various generalizations and applications, obtaining best possible results in several aspects.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10888v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Arjun Maniyar"
    ],
    "title": "Maximal cross-ratio degree for 8 points in $\\mathbb{P}^1$",
    "abstract": "The cross-ratio degree problem asks for the number of configurations of $n$ points in $\\mathbb{P}^1$ that satisfy $n-3$ specified cross-ratio conditions. It is known that the maximal cross-ratio degree for 8 points is at least 4. In this paper, we will see that the maximal cross-ratio degree for 8 points in $\\mathbb{P}^1$ is equal to 4.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10886v1",
    "categories": [
      "math.QA",
      "hep-th",
      "math.RT"
    ],
    "authors": [
      "Lisa Carbone",
      "Elizabeth Jurisich"
    ],
    "title": "A Magnus group construction for a class of Borcherds algebras",
    "abstract": "We construct a group associated to a class of Borcherds algebras that admit a direct sum decomposition into a Kac--Moody (or semi-simple) subalgebra and a pair of free Lie subalgebras. Such Borcherds algebras have no mutually orthogonal imaginary simple roots.Our group is a semi-direct product of a Kac--Moody (or semi-simple) group and a Magnus group of invertible formal power series corresponding to a basis of a certain highest weight module determined by the simple imaginary roots. We show that our group is independent of this choice of basis, up to isomorphism. We apply our construction to a number of concrete examples, such as certain Borcherds algebras formed using root lattices of hyperbolic Kac--Moody algebras, the Monster Lie algebra, Monstrous Lie algebras of Fricke type and the gnome Lie algebra.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10845v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Myriam AbiHabib",
      "Ayman Badawi"
    ],
    "title": "The $n$-total graph of an integral domain",
    "abstract": "Let $R$ be a finite product of integral domains and $D$ be a union of prime ideals (it is possible that $R$ is just an integral domain). Let $n \\geq 1$ be a positive integer. This paper introduces the $n$-total graph of a $(R, D)$. The $n$-total graph of $(R, D)$, denoted by $n-T(R)$, is an undirected simple graph with vertex set $R$, such that two vertices $x, y$ in $R$ are connected by an edge if $x^n + y^n \\in D$. In this paper, we study some graph properties and theoretical ring structure.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10777v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Erik Talvila"
    ],
    "title": "Summing series using recurrence relations",
    "abstract": "Power series in which the summand satisfies a linear recurrence relation with polynomial coefficients are shown to be the solution of a linear differential or algebraic equation. Solving the associated differential or algebraic equation yields a closed form for the series. This method is used to sum several series and to solve two {\\it American Mathematical Monthly} problems.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10766v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Boris Khesin"
    ],
    "title": "On Arnold's and Pushkin's puzzles",
    "abstract": "We discuss and draw the reader's attention to several passages in Vladimir Arnold's note on the epigraph to the novel in verse \"Evgenii Onegin\" by A.S.Pushkin, as well as to puzzles hidden in the novel by the poet himself.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10757v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Kenichi Takemura"
    ],
    "title": "Rank Duality of Circulant Matrices from Primitive Roots",
    "abstract": "We investigate the construction of circulant matrices derived from primitive roots over finite fields. Our approach reduces exponential sums to Jacobi sums, thereby establishing explicit connections between character theory and matrix structures. The results provide new insights into the interaction between additive and multiplicative characters, and demonstrate how circulant configurations encode arithmetic information in a highly symmetric form. These findings contribute to a deeper understanding of structured matrices in finite fields and open further directions for applications in number theory and combinatorics.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10750v1",
    "categories": [
      "math.DS",
      "math.FA"
    ],
    "authors": [
      "Shiping Cao",
      "Hua Qiu",
      "Yizhou Wang"
    ],
    "title": "Self-similar Dirichlet form on pillow-type carpets--a short analytic construction",
    "abstract": "We give a short, self-contained analytic proof of the existence of self-similar Dirichlet forms on pillow-type carpets, a family of infinitely ramified fractals that includes the Sierpiński carpet.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10739v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yujie Gao",
      "Ton Viet Ta"
    ],
    "title": "Bifurcation Analysis of a Predator-Prey Model with Allee Effect and Cooperative Hunting",
    "abstract": "We propose a novel predator-prey model that integrate two ecologically significant mechanisms: the Allee effect in the prey population and cooperative hunting behavior among predators. Building upon the Rosenzweig-MacArthur framework, our model modifies the prey growth term to incorporate the Allee effect and introduces a nonlinear functional response reflecting predator cooperation.\n  We establish the existence and boundedness of global solutions for the system and analyze the local and global stability of its equilibria. In addition, we perform a comprehensive bifurcation analysis, including transcritical, saddle-node, Hopf, and heteroclinic bifurcations, to explore how system dynamics change with key parameters. These results reveal rich and biologically relevant behaviors, such as multiple equilibria, transitions in stability, and the emergence of complex dynamical patterns.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11165v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "T. Miura",
      "T. Takahashi"
    ],
    "title": "Ring isomorphisms in norm between Banach algebras of continuous complex-valued functions",
    "abstract": "Let $X$ and $Y$ be compact Hausdorff spaces, and let $C(X)$ and $C(Y)$ denote the commutative Banach algebras of all continuous complex-valued functions on $X$ and $Y$, respectively. We study bijective maps $T$ from $C(X)$ onto $C(Y)$ which preserve the ring structure in the norm in the following sense: \\[ \\|T(f+g)\\|=\\|T(f)+T(g)\\|,\\quad \\|T(fg)\\|=\\|T(f)T(g)\\| \\qquad(f,g\\in C(X)). \\] Our main objective is to clarify whether such maps must necessarily be induced by homeomorphisms between the underlying spaces. Under the additional assumption that $T(\\overline{f})=\\overline{T(f)}$ for $f\\in C(X)$, we prove that $T$ is a real-linear isometry. As a consequence, we obtain a concrete representation of such maps as weighted composition operators.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11155v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Harald Garcke",
      "Kei Fong Lam",
      "Robert Nürnberg",
      "Andrea Signori"
    ],
    "title": "On a Mullins-Sekerka model for the growth of active droplets modelling protocells: Stability analysis and numerical computations",
    "abstract": "Mullins-Sekerka models with chemical reactions can lead to scenarios where droplets grow, become unstable, split, grow and undergo further division. These grow and division cycles have been proposed as a model for protocells and are believed to play a fundamental role in living systems by providing chemical compartments which are important in the organization of living systems. This paper analyses chemically active Mullins-Sekerka models. Existence of radially symmetric solutions is shown and a detailed stability analysis in radial as well as planar situations is given. In particular, we also analyze multilayered solutions leading to shell-type situations. Finally, we introduce a numerical method based on a parametric finite element approach that explicitly accounts for topological changes, thereby allowing for droplet splitting and merging. Several numerical simulations verify the findings of the theoretical stability analysis and show complex dynamical behavior, including multiple instabilities, splittings of droplets and appearance of shell-type solutions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11112v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Xiangrui Li",
      "Qingguo Li"
    ],
    "title": "Co-Noetherian spaces",
    "abstract": "In non-Hausdorff topology, many spaces exhibit significant separation properties, such as sober spaces, well-filtered spaces and d-spaces. These properties serve to fundamentally classify T0 topological spaces. In this paper, we introduce and study a new class of topological spaces called co-Noetherian spaces, which can refine the classification of T0 spaces. We discuss some basic properties of co-Noetherian spaces and obtain an equivalent characterization of compactness under the strong topology. Additionally, we investigate the connections among KC-spaces, strong R-spaces and co-Noetherian spaces. Moreover, we establish an equivalence between the category of T0 co-Noetherian spaces with continuous mappings and a subcategory of the poset category. Finally, we provide counterexamples to show that the Hoare powerspace of a T0 space may fail to be co-Noetherian, and that the Smyth powerspace of a co-Noetherian space need not be co-Noetherian.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11107v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Xiaoyue Liu",
      "Walid Klibi",
      "Benoit Montreuil"
    ],
    "title": "Modular and Mobile Capacity Planning for Hyperconnected Supply Chain Networks",
    "abstract": "The increased volatility of markets and the pressing need for resource sustainability are driving supply chains towards more agile, distributed, and dynamic designs. Motivated by the Physical Internet initiative, we introduce the Dynamic Stochastic Modular and Mobile Capacity Planning (DSMMCP) problem, which fosters hyperconnectivity through a network-of-networks architecture with modular and mobile capacities. The problem addresses both demand and supply uncertainties by incorporating short-term leasing of modular facilities and dynamic relocation of resources. We formulate DSMMCP as a partially adaptive multi-stage stochastic program that minimizes the expected multi-period costs under uncertainty. To tackle the inherent NP-hardness, we develop an enhanced stochastic dual dynamic integer programming (SDDiP) algorithm, which integrates strengthened cut generation, a tailored alternating cut strategy, and an efficient parallelization framework, and we establish structural dominance and monotonicity properties that formalize the value of the strengthened cuts and partial adaptivity. Numerical experiments inspired by a real case study of a large U.S. construction company demonstrate that the DSMMCP framework achieves approximately 15% cost savings over static planning while improving resilience, reducing outsourcing costs, and supporting sustainability. Complementary experiments on synthetic instances confirm the effectiveness of the proposed SDDiP algorithm in terms of solution quality and runtime, as well as the scalability and robustness of the partially adaptive stochastic modeling framework across different network sizes and uncertainty levels.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11105v1",
    "categories": [
      "math-ph",
      "math.PR"
    ],
    "authors": [
      "Masanari Shimura"
    ],
    "title": "Eigenvalue degeneracy in sparse random matrices",
    "abstract": "In random matrices with independent and continuous matrix entries, the degeneracy probability of the eigenvalues is known to be zero. In this paper, random matrices including discontinuous matrix entries are analyzed in order to observe how degeneracy is generated. Using Erdös-Rényi matching probability theory of random bipartite graphs, we asymptotically evaluate the degeneracy probability of such random matrices. As a result, due to accumulation of the eigenvalues to the origin, a positive degeneracy probability is found for eigenvalues of a sparse random matrix model.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11059v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Projesh Nath Choudhury",
      "Shaun Fallat",
      "Chi-Kwong Li"
    ],
    "title": "Semigroup automorphisms of total positivity",
    "abstract": "Totally positive (TP) and totally nonnegative (TN) matrices connect to analysis, mechanics, and to dual canonical bases in reductive groups, by well-known works of Schoenberg, Gantmacher-Krein, Lusztig, and others. TP matrices form a multiplicatively closed semigroup, contained in the larger monoid of invertible totally nonnegative (ITN) matrices. Whitney and Berenstein-Fomin-Zelevinsky found bidiagonal factorizations of all $n\\times n$ ITN and TP matrices into multiplicative generators; a natural question now is to classify the multiplicative automorphisms of these semigroups. In this article, we classify all automorphisms of these semigroups of ITN and TP matrices. In particular, we show that the automorphisms are the same, and they respect the multiplicative generators.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11208v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Rodrigo Nicolau Almeida"
    ],
    "title": "Uniform Local Tabularity in Intuitionistic Logic",
    "abstract": "By contrast wih $\\mathsf{S4}$, the analysis of local tabularity above $\\mathsf{IPC}$ has provided a difficult challenge. This paper studies a strengthening of local tabularity -- \\textit{uniform local tabularity} -- where one demands that all formulas be equivalent to formulas of a given implication depth. Algebraically, this amounts to considering Heyting algebras generated by finitely many iterations of the implication operation. It is shown that in contrast with locally finite Heyting algebras, $n$-uniformly locally finite Heyting algebras always form a variety, and an explicit axiomatization of the variety of $n$-uniform locally finite Heyting algebras for $n\\leq 2$ is given. In connection with this analysis, it is shown that there exist locally tabular logics which are not uniformly locally tabular, answering a question of Shehtman -- an example of a pre-uniformly locally tabular logic is presented.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11172v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Niklas Kolbe",
      "Siegfried Müller",
      "Aleksey Sikstel"
    ],
    "title": "Discontinuous Galerkin schemes for multi-dimensional coupled hyperbolic systems",
    "abstract": "A novel class of Runge-Kutta discontinuous Galerkin schemes for coupled systems of conservation laws in multiple space dimensions that are separated by a fixed sharp interface is introduced. The schemes are derived from a relaxation approach and a local projection and do not require expensive solutions of nonlinear half-Riemann problems. The underlying Jin-Xin relaxation involves a problem specific modification of the coupling condition at the interface, for which a simple construction algorithm is presented. The schemes are endowed with higher order time discretization by means of strong stability preserving Runge-Kutta methods. These are derived from an asymptotic preserving implicit-explicit treatment of the coupled relaxation system taken to the discrete relaxation limit. In a case study the application to a multi-dimensional fluid-structure coupling problem employing the compressible Euler equations and a linear elastic model is discussed.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11157v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Zeyu Dong",
      "Aqin Xiao",
      "Guojian Yin",
      "Junfeng Yin"
    ],
    "title": "Adaptive Randomized Extended Bregman-Kaczmarz Method for Combined Optimization Problems",
    "abstract": "Combined optimization problems that couple data-fidelity and regularization terms arise naturally in a wide range of inverse problems. In this paper, we study an adaptive randomized averaging block extended Bregman-Kaczmarz (aRABEBK) method for solving such problems. The proposed method incorporates iteration-wise relaxation parameters that are automatically adjusted using residual information, allowing for more aggressive step sizes without additional manual tuning. We establish a convergence theory for the proposed framework and derive expected linear convergence rate guarantees. Numerical experiments on both synthetic and real data sets for sparse and minimum-norm least-squares problems demonstrate that our aRABEBK method achieves faster convergence and improved robustness compared with state-of-the-art extended Kaczmarz and Bregman-Kaczmarz-type algorithms, including its nonadaptive counterpart.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11142v1",
    "categories": [
      "math.AG",
      "hep-th",
      "math-ph"
    ],
    "authors": [
      "Joris Koefler",
      "Dmitrii Pavlov",
      "Rainer Sinn"
    ],
    "title": "Positive Genus Pairs from Amplituhedra",
    "abstract": "A main conjecture in the field of Positive Geometry states that amplituhedra are positive geometries. It is motivated by examples showing that the canonical forms of certain amplituhedra compute scattering amplitudes in particle physics. In recent work, Brown and Dupont introduced a new framework, based on mixed Hodge theory, connecting canonical forms and de Rham cohomology. In this paper, we show that this framework is consistent with the known results for amplituhedra but does not apply beyond those families. We provide an explicit example showing that the central assumption of the Brown-Dupont framework (namely to have a pair of genus zero) is not a necessary condition to be a positive geometry in the original sense of Arkani-Hamed, Bai, and Lam. This underscores the fact that our results do not immediately disqualify the amplituhedron from being a positive geometry.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11119v1",
    "categories": [
      "math.CO",
      "cs.DM",
      "math.OC"
    ],
    "authors": [
      "Petr Kolman",
      "Hans Raj Tiwary"
    ],
    "title": "Bond Polytope under Vertex- and Edge-sums",
    "abstract": "A cut in a graph $G$ is called a {\\em bond} if both parts of the cut induce connected subgraphs in $G$, and the {\\em bond polytope} is the convex hull of all bonds. Computing the maximum weight bond is an NP-hard problem even for planar graphs. However, the problem is solvable in linear time on $(K_5 \\setminus e)$-minor-free graphs, and in more general, on graphs of bounded treewidth, essentially due to clique-sum decomposition into simpler graphs.\n  We show how to obtain the bond polytope of graphs that are $1$- or $2$-sum of graphs $G_1$ and $ G_2$ from the bond polytopes of $G_1,G_2$. Using this we show that the extension complexity of the bond polytope of $(K_5 \\setminus e)$-minor-free graphs is linear. Prior to this work, a linear size description of the bond polytope was known only for $3$-connected planar $(K_5 \\setminus e)$-minor-free graphs, essentially only for wheel graphs.\n  We also describe an elementary linear time algorithm for the \\MaxBond problem on $(K_5\\setminus e)$-minor-free graphs. Prior to this work, a linear time algorithm in this setting was known. However, the hidden constant in the big-Oh notation was large because the algorithm relies on the heavy machinery of linear time algorithms for graphs of bounded treewidth, used as a black box.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11114v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Elena Guardo",
      "Graham Keiper",
      "Grzegorz Malara"
    ],
    "title": "Interpolation matrices and jumping lines of logarithmic bundles",
    "abstract": "We study jumping lines loci of logarithmic bundles associated with finite sets of points in the projective plane. Using the interpolation matrix introduced in [DMTG25], we describe these loci as the zero sets of explicit determinants depending on parameters $(d,m)$ determined by the number of points. We show that for points in general position the determinant defines an irreducible curve of the expected degree, while for special configurations it acquires fixed components related to the combinatorics of the arrangement. The approach provides a new geometric interpretation of the classical jumping lines of Dolgachev--Kapranov and Barth, and connects them to the framework of unexpected curves and hypersurfaces.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11084v1",
    "categories": [
      "math.RT",
      "math.CT"
    ],
    "authors": [
      "Joseph Newton"
    ],
    "title": "Higher Verlinde categories of reductive groups",
    "abstract": "We define tensor categories ${\\sf Ver}_{p^n}(G)$ in characteristic $p$ for connected reductive groups $G$ and positive integers $n$, generalising the semisimple Verlinde categories ${\\sf Ver}_p(G)$ originating from Gelfand-Kazhdan and the higher Verlinde categories ${\\sf Ver}_{p^n}$ for ${\\rm SL}_2$ defined by Benson-Etingof-Ostrik. The construction is based on the definition of ${\\sf Ver}_{p^n}$ as an abelian envelope of a quotient of a category of tilting modules, but we also introduce an expanded construction which refines the ${\\rm SL}_2$ case and gives new results. In particular, the union ${\\sf Ver}_{p^\\infty}(G)$ can be derived from the perfection of $G$; certain exact sequences in ${\\sf Rep}G$ map to exact sequences in ${\\sf Ver}_{p^n}(G)$; and the underlying abelian category of ${\\sf Ver}_{p^n}$ can be expressed as a subcategory of ${\\sf Rep}{\\rm SL}_2$, or as a Serre quotient of a subcategory of ${\\sf Rep}{\\rm SL}_2$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11052v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Hideto Iwata"
    ],
    "title": "On a relation to the Riemann Hypothesis and an analytic part for the divisor function",
    "abstract": "Let phi(n) denote the Euler totient function. We study the analytic part associated with the summatory function of sigma_1(n) and obtain explicit bounds under the Riemann Hypothesis. In particular, we establish an upper bound of order x^{delta'} exp((log x)/(log log x)), where delta' = max(1/2, delta).",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11023v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yong-Shen Cao",
      "Qi-Rong Deng",
      "Ming-Tian Li"
    ],
    "title": "Moran-Type Iterated Function Systems and Dimensions of Moran Self-Similar Sets",
    "abstract": "Moran-type iterated function systems (Moran-type IFS or MIFS) are defined by a sequence of iterated function systems, and their basic theoretical framework is established. We define Moran-type attractors and invariant probability measures associated with a sequence of probability weight vectors. Furthermore, separation conditions for MIFS are introduced, and the dimension theory of Moran-type self-similar sets is investigated. Appropriate examples are provided to illustrate and support the definitions and results.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11008v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Frank Gilson"
    ],
    "title": "Symmetric Iterations with Countable Support",
    "abstract": "We develop a framework for iterated symmetric extensions with countable support. At limit stages of uncountable cofinality we use the direct-limit presentation; at limits of cofinality $ω$ we use a countable-support (inverse-limit) presentation via trees of conditions along a fixed cofinal sequence. We define the associated limit symmetry filter by head pushforwards and then (only at cf$(λ)=ω)$ closing under countable intersections in the minimal normal way, and we prove that the resulting limit filter is normal and $ω_1$--complete. This yields closure of hereditarily symmetric names under countable tuples and, consequently, preservation of ZF; in a ZFC ground model we also obtain DC in the resulting symmetric model. When the iteration template is first-order definable over a GBC ground with Global Choice and sufficient class-recursion, the same scheme extends to class-length iterations, with the final symmetric model obtained from class hereditarily symmetric names (rather than as a union of stage models).",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10996v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jungang Li",
      "Guozhen Lu"
    ],
    "title": "Optimal Trudinger-Moser inequalities on complete noncompact Riemannian manifolds: Revisit of the argument from the local inequalities to global ones",
    "abstract": "The main purpose of this short note, on the one hand, to is clarify some part of the proof of Theorem 1.3 in [8] in a simple way, and on the other hand, to give an alternative argument from local inequalities to global ones.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10950v1",
    "categories": [
      "math.OC",
      "math.NA"
    ],
    "authors": [
      "Kiyuob Jung"
    ],
    "title": "Specular differentiation in normed vector spaces and its application to nonsmooth convex optimization",
    "abstract": "This paper introduces specular differentiation, which generalizes Gâteaux and Fréchet differentiation in normed vector spaces. Fundamental theoretical properties of specular differentiation are investigated, including the Quasi-Mean Value Theorem and Quasi-Fermat's Theorem. As an application, three numerical methods using specular differentiation are devised to optimize nonsmooth convex functions in higher-dimensional Euclidean spaces. Numerical experiments demonstrate that the proposed methods are capable of minimizing non-differentiable functions that classical methods fail to minimize.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10924v1",
    "categories": [
      "math.SP",
      "math.FA"
    ],
    "authors": [
      "Diana Barseghyan",
      "Ricardo Abreu Blaya",
      "Juan Bory-Reyes",
      "Baruch Schneider"
    ],
    "title": "Magnetic Dirichlet Laplacian on a perturbed twisted tube",
    "abstract": "It is well known that the spectrum of the Dirichlet Laplacian for a compact perturbation of a three-dimensional, periodically twisted tube is unstable with respect to domain deformations. This means that if the periodically twisted tube is unperturbed, then the spectrum of the Dirichlet Laplacian is purely essential. On the other hand, the perturbation of this domain produces eigenvalues below the essential spectrum. This paper considers the Dirichlet-Laplace operator with a magnetic field. We explicitly prove that the spectrum of the magnetic Laplacian is stable under small and local deformations of the domain.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10843v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Juan Pablo Vielma"
    ],
    "title": "Convex analysis for composite functions without K-convexity",
    "abstract": "Composite functions have been studied for over 40 years and appear in a wide range of optimization problems. Convex analysis of these functions focuses on (i) conditions for convexity of the function based on properties of its components, (ii) formulas for the convex conjugate of the function based on those of its components and (iii) chain-rule-like formulas for the sub-differential of the function. To the best of our knowledge all existing results on this matter are based on the notion of K-convexity of functions where K is a closed convex cone. These notions can be considered elementary when K is the non-negative orthant, but otherwise may limit the accessibility of the associated results. In this work we show how standard results on perturbation function based duality can be used to recover and extend existing results without the need for K-convexity. We also provide a detailed comparison with K-convexity based results and show that, while K-convexity is not needed for the convex analysis of composite functions, it certainly aids in verifying the conditions associated with our proposed results. Finally, we provide necessary conditions for the conjugate and sub-differential formulas that are less restrictive than those required by the existing results.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10839v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Rafael Ceja Ayala",
      "Malena I. Español",
      "Govanni Granados"
    ],
    "title": "Qualitative reconstruction methods for imaging interior Robin interfaces in EIT from Robin-to-Dirichlet data",
    "abstract": "We consider an inverse shape problem arising in electrical impedance tomography (EIT) for nondestructive testing, in which interior defects are modeled through Robin transmission conditions. Unlike classical formulations, we impose Robin boundary conditions on both the exterior measurement surface and the interior interface, and use the Robin-to-Dirichlet (RtD) map as the available data. Within this setting, we develop qualitative (non-iterative) reconstruction methods based on the Linear Sampling Method (LSM) and the Regularized Factorization Method (RFM), and derive new analytical characterizations that enable these methods to identify interior regions. We further propose a numerical implementation that incorporates regularization strategies and demonstrate, through experiments, that the methods reliably reconstruct interior regions of interest.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10793v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Javier Lafuente-López"
    ],
    "title": "About Signature-Change Metrics on Manifolds",
    "abstract": "We provide a one-parameter family of Lorentz-Riemann signature-change models of metric manifolds. This family generalizes the Kossowski's signature type-changihg stablished in [9]. Simple local expressions are sought around the hypersurface of change.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10778v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Praneeth Kumar Vippathalla",
      "Justin P. Coon",
      "Mihai-Alin Badiu"
    ],
    "title": "On the Entropy of a Random Geometric Graph",
    "abstract": "In this paper, we study the entropy of a hard random geometric graph (RGG), a commonly used model for spatial networks, where the connectivity is governed by the distances between the nodes. Formally, given a connection range $r$, a hard RGG $G_m$ on $m$ vertices is formed by drawing $m$ random points from a spatial domain, and then connecting any two points with an edge when they are within a distance $r$ from each other. The two domains we consider are the $d$-dimensional unit cube $[0,1]^d$ and the $d$-dimensional unit torus $\\mathbb{T}^d$. We derive upper bounds on the entropy $H(G_m)$ for both these domains and for all possible values of $r$. In a few cases, we obtain an exact asymptotic characterization of the entropy by proving a tight lower bound. Our main results are that $H(G_m) \\sim dm \\log_2m$ for $0 < r \\leq 1/4$ in the case of $\\mathbb{T}^d$ and that the entropy of a one-dimensional RGG on $[0,1]$ behaves like $m\\log m$ for all $0<r<1$. As a consequence, we can infer that the asymptotic structural entropy of an RGG on $\\mathbb{T}^d$, which is the entropy of an unlabelled RGG, is $Ω((d-1)m \\log_2m)$ for $0 < r \\leq 1/4$. For the rest of the cases, we conjecture that the entropy behaves asymptotically as the leading order terms of our derived upper bounds.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10734v1",
    "categories": [
      "math.DS",
      "math.DG"
    ],
    "authors": [
      "Amanze C. Egere"
    ],
    "title": "Cohomological Equation for Robotic Screw Motion on the Lie Group SE(3)",
    "abstract": "We study the cohomological equation associated with screw motions on the Euclidean motion group SE(3). Working on the smooth manifold M = T^3 x SO(3), we combine Fourier analysis in the translational variables with Peter-Weyl theory on SO(3) to reduce the equation to a family of finite-dimensional linear transport systems along frequency orbits induced by the rotational component. In the case of finite-order rotations, solvability is governed by explicit finite-dimensional linear obstructions encoded by monodromy operators. An explicit screw motion along the z-axis illustrates the resulting resonance conditions. Since rigid motions on SE(3) arise naturally as configuration spaces in robotic kinematics, the results provide a precise description of obstruction phenomena relevant to robotic rigid-body motion.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11187v1",
    "categories": [
      "math.GR",
      "math.CO",
      "math.RA"
    ],
    "authors": [
      "Roksana Słowik",
      "Tejbir Lohan"
    ],
    "title": "Selected facts on products of two involutions in the Riordan group",
    "abstract": "An element of a group is called \\emph{reversible} if it is conjugate to its inverse, and \\emph{strongly reversible} if it can be expressed as a product of two involutions. We study strongly reversible elements in the Riordan group and in several of its important subgroups. We show that not every reversible element in the Riordan group is strongly reversible, and we investigate products of reversible elements in the Riordan group.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11179v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Noor Ul Ain",
      "Lorenzo Miretti",
      "Renato L. G. Cavalcante",
      "Sławomir Stańczak"
    ],
    "title": "Performance Analysis of Cell-Free Massive MIMO under Imperfect LoS Phase Tracking",
    "abstract": "We study the impact of imperfect line-of-sight (LoS) phase tracking on the performance of cell-free massive MIMO networks. Unlike prior works that assume perfectly known or completely unknown phases, we consider a realistic regime where LoS phases are estimated with residual uncertainty due to hardware impairments, mobility, and synchronization errors. To this end, we propose a Rician fading model where LoS components are rotated by imperfect phase estimates and attenuated by a deterministic phase-error penalty factor. We derive a linear MMSE channel estimator that captures statistical phase errors and unifies prior results, reducing to the Bayesian MMSE estimator with perfect phase knowledge and to a zero-mean model in the absence of phase knowledge. To address the non-Gaussian setting, we introduce a virtual uplink model that preserves second-order statistics of channel estimation, enabling the derivation of tractable centralized and distributed MMSE beamformers. To ensure fair assessment of the network performance, we apply these beamformers to the true uplink model and compute the spectral efficiency bounds available in the literature. Numerical results show that our framework bridges idealized assumptions and practical tracking limitations, providing rigorous performance benchmarks and design insights for 6G cell-free networks.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11168v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Askar Dzhumadil'daev",
      "Nurlan Ismailov"
    ],
    "title": "Null Lagrangians in free Novikov algebras",
    "abstract": "We study the symmetrization of the Novikov product. Using the embedding of a free Novikov algebra into a differential algebra over a field of characteristic zero and the Euler operators (variational derivatives), we show that the space of null Lagrangians coincides with the subspace of elements closed under the symmetrized product $a\\circ b=ab+ba$. We also completely describe its module structure over symmetric group.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11162v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Laurent Decreusefond",
      "Antonin Jacquet"
    ],
    "title": "Rate of convergence of the conditioned random walk towards the Brownian bridge",
    "abstract": "We study the rate of convergence of two discrete processes towards the Brownian bridge: the random walk conditioned to be zero at time 2n and the empirical process which appears in the Glivencko-Cantelli theorem. Combining a functional Stein method with a Radon-Nikodym representation of the bridge, we bound the Fortet-Mourier distance between these conditioned processes and the Brownian bridge.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11149v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Lei Xie",
      "Hengtao He",
      "Jun Tong",
      "Fan Liu",
      "Shenghui Song"
    ],
    "title": "Sensing Mutual Information for Communication Signal with Deterministic Pilots and Random Data Payloads",
    "abstract": "The recent emergence of the integrated sensing and communication (ISAC) framework has sparked significant interest in quantifying the sensing capabilities inherent in communication signals. However, existing literature has mainly focused on scenarios involving either purely random or purely deterministic waveforms. This overlooks a critical reality: operational communication standards invariably utilize a hybrid structure comprising both deterministic pilots for channel estimation and random payloads for data transmission. To bridge this gap, this paper investigates the sensing mutual information (SMI) and precoding design specifically for ISAC systems employing communication signals with both pilots and data payloads. First, by utilizing random matrix theory (RMT), we derive a tractable closed-form expression for the SMI that accurately accounts for the statistical properties of the hybrid signal. Building upon this theoretical foundation, we formulate a precoding optimization problem to maximize SMI with constraints on the transmit power and communication rate, which is solved via an efficient alternating direction method of multipliers framework. Simulation results validate the accuracy of the theoretical results and demonstrate the superiority of the proposed precoding design over conventional benchmarks.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11067v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Primož Šparl"
    ],
    "title": "Cubic factor-invariant graphs of bialternating cycle quotient type",
    "abstract": "In 2019, investigation of the so-called factor-invariant cubic graphs was initiated by Alspach, Khodadadpour and Kreher. For a cubic graph $Γ$ and a vertex-transitive subgroup $G$ of $\\mathrm{Aut}(Γ)$, a $2$-factor $\\mathcal{C}$ of $Γ$ is said to be {\\em $G$-invariant} if the set $\\mathcal{C}$ is preserved by each element of $G$. Investigations of factor-invariant cubic graphs therefore contribute to the rapidly growing theory on cubic vertex-transitive graphs, providing a better insight into the structure of such graphs.\n  Initially, the examples where $\\mathcal{C}$ consists of a single or just two cycles were analyzed. In a recent paper by Brian Alspach and the author of this paper, the investigation of the examples for which the corresponding quotient graph $Γ_\\mathcal{C}$ of $Γ$ with respect to $\\mathcal{C}$ is a cycle was initiated. Moreover, the graphs of the so-called {\\em alternating cycle quotient type} were classified.\n  In this paper, the remaining examples, that is the graphs of the {\\em bialternating cycle quotient type}, are classified. It is shown that they belong to a previously unknown infinite $5$-parametric family of graphs of girth at most $10$ and that they are Cayley graphs of groups with respect to three involutions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11051v1",
    "categories": [
      "math.NA",
      "math.DG"
    ],
    "authors": [
      "Muhammad Ammad",
      "Leevan Ling"
    ],
    "title": "An Adaptive Lagrangian B-Spline Framework for Point Cloud Manifold Evolution",
    "abstract": "We extend our recent curve-evolution framework based on localized B-spline interpolation to present an adaptive Lagrangian framework for the geometric evolution of point-cloud data representing smooth, codimension-one surfaces in $\\mathbb{R}^3$. The method constructs overlapping, localized tensor-product B-spline patches, enabling direct, meshless surface evolution from discrete samples. Within each patch, the differentiable B-spline representation yields analytic, high-order estimates of intrinsic geometric invariants, supporting curvature-driven and geometry-coupled flows. The organization of control points facilitates coherent updates of both surface samples and spline coefficients under intrinsic velocity fields. A conditioning-aware formulation of the local interpolation system, combined with a Gauss-Seidel refinement of control points, maintains interpolation quality throughout the evolution. Adaptive knot insertion and point redistribution, guided by geometric error indicators and local sampling density, preserve surface resolution and regularity during deformation. Numerical experiments demonstrate efficient and accurate reproduction of surface evolution phenomena, including mean-curvature flow, anisotropic deformations, and coupled surface-field dynamics, establishing localized B-spline methods as precise and versatile tools for dynamic manifold approximation.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11033v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Marc Vidal",
      "Yves Rosseel"
    ],
    "title": "Noise-resilient penalty operators based on statistical differentiation schemes",
    "abstract": "Penalized smoothing is a standard tool in regression analysis. Classical approaches often rely on basis or kernel expansions, which constrain the estimator to a fixed span and impose smoothness assumptions that may be restrictive for discretely observed data. We introduce a class of penalized estimators that operate directly on the data grid, denoising sampled trajectories under minimal smoothness assumptions by penalizing local roughness through statistically calibrated difference operators. Some distributional and asymptotic properties of sample-based contrast statistics associated with the resulting linear smoothers are established under Hellinger differentiability of the model, without requiring Fréchet differentiability in function space. Simulation results confirm that the proposed estimators perform competitively across both smooth and locally irregular settings.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10764v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Agustín Domínguez-Cruz"
    ],
    "title": "An Integral Identity Relating Diamond and Square Domains",
    "abstract": "We establish an integral identity for functions on R^2 that are invariant under discrete diagonal translations. The identity shows that integration over the diamond-shaped region |x| + |y| <= L is exactly one half of the integral over the square domain [-L, L]^2, allowing diamond-domain integrals to be reduced to easier rectangular integrations.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10756v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Meng Chen",
      "Xue-ping Wang"
    ],
    "title": "Monotone functions that generate conditionally cancellative triangular subnorms",
    "abstract": "Let a function $F: [0,1]^2\\rightarrow [0,1]$ be given by $F(x,y)= f^{(-1)}(T(f(x), f(y)))$ where $f :[0,1]\\rightarrow [0,1]$ is a monotone function, $f^{(-1)}$ is the pseudo-inverse of $f$ and $T$ is a triangular norm. This article characterizes the monotone function $f$ satisfying that the function $F$ is a conditionally cancellative triangular subnorm completely. It finally answers an open problem posed by Mesiarová.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10751v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Diego Linares",
      "Carlos Cadenas"
    ],
    "title": "Dynamics of the Modified Chebyshev's method to multiple roots",
    "abstract": "This study explores the complex dynamics of the rational function associated with the Modified Chebyshev's root-finding method. After introducing the basic preliminaries of discrete dynamical systems, we analyze the dynamical behavior of the method, classifying the stability of its fixed points and critical orbits. These theoretical findings are then illustrated through dynamical planes, which map the basins of attraction and reveal the convergence characteristics and potential chaotic regions of the method.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10730v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Hamid Reza Salimi Moghaddam"
    ],
    "title": "Riemannian Geometry of Lie Groups with One and Two-Dimensional Commutator Subgroups",
    "abstract": "In this paper, we investigate left invariant Riemannian metrics on Lie groups with one and two-dimensional commutator subgroups. We explicitly provide the Levi-Civita connection, sectional curvature, and Ricci curvature, and we give computable necessary and sufficient conditions for these Riemannian manifolds to be Ricci solitons. Furthermore, we characterize all Ricci solitons on Lie groups with one-dimensional commutator subgroups. In the final section, we examine the results concerning all indecomposable Lie groups with two-dimensional commutator subgroups of dimension greater than or equal to five.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11017v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Dilei Lu"
    ],
    "title": "Properties, deformation quantizations and bialgebras for dual pre-Poisson algebras",
    "abstract": "A dual pre-Poisson algebra is an algebraic structure that integrates a permutative algebra and a Leibniz algebra under certain compatibility conditions. As the Koszul dual notion of the pre-Poisson algebra, this structure serves as a natural generalization of the Poisson algebra. In this paper, we commence a study on dual pre-Poisson algebras from the algebraic point of view and establish a bialgebra theory for dual pre-Poisson algebras. We begin by investigating the fundamental properties of dual pre-Poisson algebras and provide several explicit constructions. In particular, we prove that the operad of dual pre-Poisson algebras is Koszul, and we compute its Hilbert-Poincaré series and codimension. Furthermore, we introduce the notion of diassociative formal deformations of permutative algebras and show that dual pre-Poisson algebras are the corresponding semi-classical limits. Moreover, we introduce dual pre-Poisson bialgebras, which are characterized both by Manin triples and by matched pairs of dual pre-Poisson algebras, thus developing a bialgebra theory for dual pre-Poisson algebras. Then our study leads to the permutative-Leibniz Yang-Baxter equation (PLYBE) that is composed of the permutative and the classical Leibniz Yang-Baxter equation. We conclude by introducing $\\mathcal{O}$-operators and pre-dual pre-Poisson algebras, which provide a systematic method for constructing symmetric solutions to the PLYBE and, consequently, dual pre-Poisson bialgebras.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11010v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Zhibin Wu",
      "Songhao Shen",
      "Yufeng Zhou",
      "Qin Lei"
    ],
    "title": "The Dynamic Team Orienteering Problem in Spatial Crowdsourcing: A Scenario Sampling Approach",
    "abstract": "In services such as retail audits and urban infrastructure monitoring, a platform dispatches rewarded, location-based micro-tasks to mobile workers traveling along personal origin-destination (OD) trips under hard time budgets. As requests with time constraints arrive online over a finite horizon, the platform must decide which requests to accept and how to route workers to maximize collected profit. We model this setting as the Dynamic Team Orienteering Problem in Spatial Crowdsourcing (DTOP-SC). To solve this problem, we propose a scenario-sampling rolling-horizon framework that mitigates myopic bias by augmenting each planning epoch with sampled virtual tasks. At each epoch, the augmented task set defines a deterministic static subproblem solved via an adaptive large neighborhood search (ALNS). We also formulate a mixed-integer programming model to provide offline reference solutions. Computational experiments are conducted on synthetic DTOP-SC instances generated from real-world road-map coordinates and on a dynamic team orienteering (DTOP) benchmark. On the map-based instances, the proposed policy exhibits stable gaps with respect to time-limited MIP solutions across the tested scales, while maintaining smooth computational scalability as the problem size increases. On the DTOP benchmark, the policy achieves an average decision time of 0.14s per instance, with 192-198s reported for multiple plan approach as an indicative reference, while maintaining competitive profit.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10967v1",
    "categories": [
      "math.OC",
      "math.DS"
    ],
    "authors": [
      "Kyrho Corum",
      "Renier Mendoza",
      "Victoria May P. Mendoza",
      "Arrianne Crystal Velasco"
    ],
    "title": "Balancing Economic Cost and Disease Impact: Optimization Models for Wolbachia-Based Dengue Control",
    "abstract": "Dengue, which affects millions of people each year, is one of the most common diseases transmitted by infected \\textit{Aedes aegypti} mosquitoes. In the Philippines, the annual economic cost of dengue infections is estimated at around PHP 17 billion. Previous studies have shown that controlling the population of mosquitoes capable of transmitting the dengue virus can effectively reduce dengue infection rates. This study explores the use of Wolbachia as a strategy for dengue control by targeting mosquitoes. Since the release of Wolbachia-infected mosquitoes involves substantial costs, careful planning is necessary to balance disease control with the associated economic burden. To address this, we propose a mathematical model that captures the dynamics of releasing Wolbachia-carrying mosquitoes and the transmission of dengue in a population. We formulate single- and multi-objective optimization frameworks to minimize the economic costs associated with releasing Wolbachia-infected mosquitoes and the hospitalization costs resulting from dengue infections. This study aims to provide insights into the practical application of Wolbachia-based interventions for controlling dengue transmission. While the analysis is grounded in the Philippine context, the approach is general enough to be applicable to other dengue-endemic countries.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10887v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Boyi Wang",
      "Saurav Shenoy",
      "Daniel Fortino",
      "Long-Qing Chen",
      "Wenrui Hao"
    ],
    "title": "A Structure-Preserving Scheme for the Time-Dependent Ginzburg-Landau Model with BCS Gap Coupling",
    "abstract": "We propose a structure-preserving scheme for a hybrid model that couples the time-dependent Ginzburg-Landau (TDGL) equation of superconducting vortex dynamics and the nonlinear Bardeen-Cooper-Schrieffer (BCS) gap equation. This formulation is consistent with the classical TDGL equation in the near-critical temperature, while extending the applicability of the existing TDGL model to regimes beyond the critical temperature. The resulting system poses significant computational challenges due to its nonlinear and coupled structure. To achieve stable and reliable simulations of the vortex dynamics and accompanying morphological transitions, we develop a maximum bound preserving, energy-stable implicit-explicit (IMEX) scheme. The structure-preserving properties of the scheme are rigorously established, ensuring long-time stability and physical consistency. Through two- and three-dimensional simulations, the hybrid model successfully captures the temporal and spatial formation and alignment of vortices and the suppression of superconductivity under increasing magnetic fields, demonstrating both the accuracy and robustness of the proposed computational approach.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10875v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jean-François Babadjian",
      "Martin Rakovsky",
      "Rémy Rodiac"
    ],
    "title": "Critical points of the two-dimensional Ambrosio-Tortorelli functional with convergence of the phase-field energy",
    "abstract": "We consider a family $\\{(u_\\varepsilon, v_\\varepsilon)\\}_{\\varepsilon>0}$ of critical points of the Ambrosio-Tortorelli functional. Assuming a uniform energy bound, the sequence $\\{(u_\\varepsilon, v_\\varepsilon)\\}_{\\varepsilon>0}$ converges in $L^2(Ω)$ to a limit $(u, 1)$ as $\\varepsilon \\to 0$, where $u$ is in $SBV^2(Ω)$. It was previously shown that if the full Ambrosio-Tortorelli energy associated to $(u_\\varepsilon,v_\\varepsilon)$ converges to the Mumford-Shah energy of $u$, then the first inner variation converges as well. In particular, $u$ is a critical point of the Mumford-Shah functional in the sense of inner variations. In this work, focusing on the two-dimensional setting, we extend this result under the sole convergence of the phase-field energy to the length energy term in the Mumford-Shah functional.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10870v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Guo-Niu Han",
      "Lihong Yang"
    ],
    "title": "Yet another doubly refined enumeration of Alternating Sign Matrices",
    "abstract": "Since the alternating sign matrix conjecture, proposed by Mills, Robbins, and Rumsey in 1982, was proved by Zeilberger and Kuperberg, several refined enumerations have been considered. In particular, Behrend et al. obtained a quadruply refined enumeration by adding certain parameters. In this paper, we revisit the doubly refined enumeration of alternating sign matrices by adding three parameters: the number of $-1$'s, the position of the $1$ in the first row, and the position of the $1$ in the last row. Using Lascoux's formula on symmetry functions, we derive a new determinantal formula for this doubly refined enumeration.\n  Besides the enumeration conjecture, Mills et al. also proposed a decomposition conjecture, which was subsequently proven by Kuperberg. We present a refinement of that decomposition conjecture.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10842v1",
    "categories": [
      "math.AC",
      "math.CO"
    ],
    "authors": [
      "Abbas Dohadwala",
      "Bryan Flores-Silva",
      "Alicia Orozco-Moya",
      "Zoe Siegelnickel"
    ],
    "title": "Linear strands of powers of certain binomial edge ideals",
    "abstract": "We provide a closed formula for the graded Betti numbers in the linear strands of all powers of binomial edge ideals $J_G$ arising from closed graphs $G$ that do not have the complete graph $K_4$ as an induced subgraph. We show that these agree with the corresponding Betti numbers for the powers of the lexicographic initial ideal of $J_G$, thereby confirming a conjecture of Ene--Rinaldo--Terai in a special case.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10840v1",
    "categories": [
      "math.RA",
      "math.LO"
    ],
    "authors": [
      "Andrew Craig",
      "Miroslav Haviar"
    ],
    "title": "Dual Ploščica spaces of ortholattices",
    "abstract": "We describe digraphs with topology which give dual representations of ortholattices. This is done via so-called dual Ploščica spaces of lattices. First, we improve the definition of Ploščica spaces from an earlier paper to give a straight and natural generalisation of the total order disconnectedness of Priestley spaces. Then we define the dual space of a general ortholattice as the dual Ploščica space of the lattice-reduct of the ortholattice equipped with a map representing the orthocomplement operation. We introduce an abstract ortho-Ploščica space capturing the properties of the dual space of an ortholattice, and we present dual representation theorems between general ortholattices and the ortho-Ploščica spaces. We illustrate our dual representations by examples.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10990v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Xinpo Li",
      "Jingtao Shi"
    ],
    "title": "The Optimal Control Problem of Stochastic Differential System with Extended Mixed Delays and Applications",
    "abstract": "This paper investigates an optimal control problem where the system is described by a stochastic differential equation with extended mixed delays that contain point delay, extended distributed delay, and extended noisy memory. The model is general in that the extended mixed delays of the state variable and control variable are components of all the coefficients, in particular, the diffusion term and the terminal cost. To address the difficulties induced by the extended noisy memory, by stochastic Fubini theorem, we transform the delay variational equation into a Volterra integral equation without delay, and then a kind of backward stochastic Volterra integral equation with Malliavin derivatives is introduced by the developed coefficient decomposition method and the generalized duality principle. Therefore, the stochastic maximum principle and the verification theorem are established. Subsequently, with Clark-Ocone formula, the adjoint equation is expressed as a set of anticipated backward stochastic differential equations. Finally, a nonzero-sum stochastic differential game with extended mixed delays and a linear-quadratic solvable example are discussed, as applications.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10981v1",
    "categories": [
      "math.NA",
      "math-ph"
    ],
    "authors": [
      "Xiaoying Dai",
      "Miao Hu",
      "Shuwei Shen"
    ],
    "title": "A model order reduction based adaptive parareal method for time-dependent partial differential equations",
    "abstract": "In this paper, we propose a model order reduction based adaptive parareal method for time-dependent partial differential equations. By using the data obtained by the fine propagator in each iteration of the plain parareal method together with some model order reduction technique, we construct the coarse propagator adaptively in each parareal iteration, and then obtain our adaptive parareal method. We apply this new method to solve some 3D time-dependent advection-diffusion equations with the Kolmogorov flow and the ABC flow. Numerical results show the good performance of our method in simulating long-term evolution problems.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10954v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Nikko John Leo S. Lobos"
    ],
    "title": "Exact Analytical Solutions of the Dunkl-Schrödinger Equation for the Deng-Fan Potential",
    "abstract": "We present exact analytical solutions for the radial Dunkl-Schrödinger equation (DSE) confined by the Deng-Fan molecular potential. By employing the Pekeris approximation to resolve the centrifugal singularity and applying the parametric Nikiforov-Uvarov method, we derive closed-form expressions for the energy eigenspectrum and the corresponding radial wavefunctions expressed in terms of Jacobi polynomials. Our investigation reveals that the Dunkl reflection parameter $μ$ fundamentally alters the system's topology by breaking spatial symmetry and introducing a parity-dependent repulsive force. Numerical analysis demonstrates a monotonic increase in energy eigenvalues with increasing $μ$, confirming an effective \"hard core\" behavior at the origin. The results are shown to be consistent with standard quantum mechanics in the limit $μ\\to 0$. This study establishes the Dunkl formalism as a robust tool for modeling quantum systems characterized by parity-dependent exclusion effects and strong short-range correlations.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10915v1",
    "categories": [
      "cs.IT",
      "cs.LG"
    ],
    "authors": [
      "Yangshuo He",
      "Guanding Yu",
      "Jingge Zhu"
    ],
    "title": "A PAC-Bayesian Analysis of Channel-Induced Degradation in Edge Inference",
    "abstract": "In the emerging paradigm of edge inference, neural networks (NNs) are partitioned across distributed edge devices that collaboratively perform inference via wireless transmission. However, standard NNs are generally trained in a noiseless environment, creating a mismatch with the noisy channels during edge deployment. In this paper, we address this issue by characterizing the channel-induced performance deterioration as a generalization error against unseen channels. We introduce an augmented NN model that incorporates channel statistics directly into the weight space, allowing us to derive PAC-Bayesian generalization bounds that explicitly quantifies the impact of wireless distortion. We further provide closed-form expressions for practical channels to demonstrate the tractability of these bounds. Inspired by the theoretical results, we propose a channel-aware training algorithm that minimizes a surrogate objective based on the derived bound. Simulations show that the proposed algorithm can effectively improve inference accuracy by leveraging channel statistics, without end-to-end re-training.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10910v1",
    "categories": [
      "math.CA",
      "math.NA"
    ],
    "authors": [
      "Shrikant Chand",
      "James Nolen",
      "Hau-Tieng Wu"
    ],
    "title": "On spectral interference of the short-time Fourier transform and its nonlinear variations",
    "abstract": "Spectral interference, the frequency counterpart of the beating phenomenon in the time domain, can severely distort time-frequency representations (TFRs) in physical applications. We study this phenomenon for the short-time Fourier transform (STFT) with a Gaussian window and for nonlinear refinements based on the reassignment method, with an emphasis on the synchrosqueezing transform (SST). Working with a two-component harmonic model, we quantify when STFT can (and cannot) resolve two nearby frequencies: a sharp transition occurs at a critical gap that scales inversely to kernel bandwidth and depends explicitly on the amplitude ratio. Below this threshold, the spectrogram ridges undergo bifurcation and form repeating time-frequency bubbles, which we describe asymptotically and, in the balanced-amplitude case, approximate closely by ellipses. We then analyze the STFT phase, showing a canonical winding behavior, and relate the complex-valued SST reassignment map to a holomorphic structure via the Bargmann transform. In the two-component setting the reassignment rule admits an explicit Mobius-geometry description, sending frequency lines to circular arcs in the complex plane. Finally, viewing SST and reassignment through a measure mapping perspective, we derive small-kernel asymptotics that explain when reassignment sharpens energy and when it produces distorted or misleading TFRs; we also introduce a generalized synchrosqueezing framework that isolates the role of STFT weighting and clarifies how alternative choices can mitigate interference in certain regimes.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10894v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Helmut Prodinger"
    ],
    "title": "The height of skew Dyck paths with two variants of downsteps",
    "abstract": "Recently, in the context of walks of hexagonal circle packings, interest has emerged in the family of skew Dyck paths with two variants\n  of down-steps. These paths have steps $U, D_g, D_b, L=D_r$. Using generating functions, the kernel method and (in)finite linear systems, contributions to the (average) height and other enumerations are made. As in many similar instances, the average height is of order $\\sqrt n$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10883v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Andrea Rondelli"
    ],
    "title": "A Differential Geometry and Algebraic Topology Based Public-Key Cryptographic Algorithm in Presence of Quantum Adversaries",
    "abstract": "In antiquity, the seal embodied trust, secrecy, and integrity in safeguarding the exchange of letters and messages. The purpose of this work is to continue this tradition in the contemporary era, characterized by the presence of quantum computers, classical supercomputers, and increasingly sophisticated artificial intelligence. We introduce Z-Sigil, an asymmetric public-key cryptographic algorithm grounded in functional analysis, differential geometry, and algebraic topology, with the explicit goal of achieving resistance against both classical and quantum attacks. The construction operates over the tangent fiber bundle of a compact Calabi-Yau manifold [13], where cryptographic keys are elements of vector tangent fibers, with a binary operation defined on tangent spaces of the base manifold giving rise to a groupoid structure. Encryption and decryption are performed iteratively on message blocks, enforcing a serial architecture designed to limit quantum parallelism [9,10]. Each block depends on secret geometric and analytic data, including a randomly chosen base point on the manifold, a selected section of the tangent fiber bundle, and auxiliary analytic data derived from operator determinants and Zeta function regularization [11]. The correctness and invertibility of the proposed algorithm are proven analytically. Furthermore, any adversarial attempt to recover the plaintext without the private key leads to an exponential growth of the adversarial search space,even under quantum speedups. The use of continuous geometric structures,non-linear operator compositions,and enforced blockwise serialization distinguishes this approach from existing quantum-safe cryptographic proposals based on primary discrete algebraic assumptions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10864v1",
    "categories": [
      "math.ST",
      "math.CO"
    ],
    "authors": [
      "Daniel Irving Bernstein"
    ],
    "title": "Rigidity theory in statistical inference",
    "abstract": "In this expository article, we summarize what is known about maximum likelihood thresholds of Gaussian models, paying special attention to connections with rigidity theory.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10830v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ayman Badawi"
    ],
    "title": "On the $m$-graph of a finite Abelian Group",
    "abstract": "Let $H$ be a finite abelian (commutative) group of order $n \\geq 2$, and $m >1$ be an integer. We define the $m$-graph of $H$, denoted by $m-G(H)$, as a simple undirected graph with vertex set $H$, and two distinct vertices, $a, b \\in H$, are connected by an edge if and only if $a^m = b$ or $b^m = a$. Several results regarding the properties of the $m$-$G(H)$ have been established.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10821v1",
    "categories": [
      "math.PR",
      "math.AC",
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Nikita Lvov"
    ],
    "title": "Universality results for random matrices over finite local rings",
    "abstract": "Let $R$ be a finite local ring. We prove a quantitative universality statement for the cokernel of random matrices with i.i.d. entries valued in $R$. Rather than use the moment method, we use the Lindeberg replacement technique. This approach also yields a universality result for several invariants that are finer than the cokernel, such as the span and the determinant.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10808v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Mikhail Chernikov",
      "Peter Trifonov"
    ],
    "title": "Efficient LLR-Domain Decoding of ABS+ Polar Codes",
    "abstract": "ABS+ polar codes are a generalization of Arikan polar codes that provides much faster polarization. We present an LLR-domain implementation of the SCL decoder of ABS+ polar codes. Furthermore, we optimize the SCL algorithm in order to reduce the complexity requirements for the LLRs computation. In comparison with classical polar codes, the proposed approach requires less number of arithmetic operations in the SCL decoder to obtain the fixed frame error rate (FER) at high-SNR region.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10760v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Mitsuru Shibayama"
    ],
    "title": "Existence of Really Perverse Central Configurations in the Spatial $N$-Body Problem",
    "abstract": "We construct explicit examples of really perverse central configurations in the spatial Newtonian $N$-body problem. A central configuration is called really perverse if it satisfies the central configuration equations for two distinct mass distributions having the same total mass. While such configurations were previously known only in the planar case for large $N$, we prove the existence of spatial really perverse central configurations for $N=27,\\dots,55$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10755v1",
    "categories": [
      "math.HO",
      "math.GT"
    ],
    "authors": [
      "Richard Evan Schwartz"
    ],
    "title": "Build Boy's Surface",
    "abstract": "This article describes Boy's surface in a nice way that does not make many demands on three-dimensional visualization. The article includes a kit that you can print out onto card stock and assemble with scissors and tape.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10753v1",
    "categories": [
      "math.FA",
      "math-ph",
      "math.SP"
    ],
    "authors": [
      "Anik Chakraborty",
      "Varinder Kumar"
    ],
    "title": "Fredholm Theory on Twisted Hilbert Scales: A Frame-Theoretic Approach to Half-Integer Fourier Modes",
    "abstract": "We construct a Hilbert scale on $L^2([0,1])$ via a unitary twist operator that maps the standard Fourier basis to half-integer frequency exponentials. The resulting weighted spaces, equipped with norms indexed by $(1+|k+\\tfrac{1}{2}|^2)^s$, admit a canonical diagonal operator with the compact resolvent and spectrum $\\{k+\\tfrac{1}{2}\\}_{k\\in\\mathbb{Z}}$. We prove that this operator defines a Fredholm mapping between adjacent scale levels with index zero, provide an explicit solution to an antiperiodic boundary value problem illustrating the framework, and compute the zeta-regularized determinant $\\det_ζ(|\\widetilde{A}|) = 2$ using the Hurwitz zeta function. We establish stability under bounded perturbations and verify the well-definedness of spectral flow. The framework is developed entirely through functional-analytic methods without differential operators or boundary value problems. The construction is motivated by twisted spinor boundary conditions on non-orientable manifolds, though the present work is formulated abstractly in operator-theoretic language.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10752v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Shruthi C. Bhat",
      "B. R. Srivatsa Kumar"
    ],
    "title": "On Ramanujan's Continued Fractions of Orders Five, Ten, and Twenty and Associated Eisenstein Series Identities",
    "abstract": "Eisenstein series play an important role in the theory of modular forms and have profound connections with $q$-series identities, partition theory, and special functions. Likewise, Ramanujan's mock theta functions, originally introduced in his last letter to Hardy, have inspired generations of mathematicians to work on $q$-series and modular forms. In this work, we establish several new identities connecting Ramanujan's continued fractions of order twenty. By employing product representation for Jacobi's theta function $θ_1$, we derive a family of new relations connecting the continued fractions of order twenty with continued fractions of order ten and Rogers-Ramanujan continued fraction. Further, by expressing Eisenstein series in terms of Lambert series and utilizing certain mock theta functions and their logarithmic derivatives, we obtain beautiful relations between Eisenstein series and theta functions of level twenty. Using Ramanujan's $_1 ψ_1$ summation formula, we establish Eisenstein series identities associated with the continued fractions of order twenty. These results extend earlier work on continued fractions of order 6, 12, and 16 and contribute to theory of $q$-series.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10736v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Johannes Hagel"
    ],
    "title": "Algebraic Detection of Tube Rupture via a Cubic Discriminant Criterion",
    "abstract": "We investigate the rupture of invariant tubes in a class of nonautonomous dynamical systems arising from time-dependent Ermakov-type equations. Starting from an exactly tube-integrable reference system, we analyze a time-dependent invariant obtained from a positivity-preserving second-order perturbative construction, which provides a near-integrable geometric description of the dynamics. While this approximation does not preserve exact invariance, its algebraic structure remains sufficiently robust to allow a precise characterization of tube opening and loss of confinement.\n  For fixed time, the discriminant of the approximate invariant with respect to the momentum variable defines a cubic polynomial in the configuration variable. We show that the invariant tube admits an unbounded bridge if and only if the associated cubic possesses exactly one real root. This yields a purely algebraic rupture criterion based on the cubic discriminant and reduces the full geometric problem to the evaluation of a single scalar function of time.\n  Applying this criterion reveals a sequence of isolated bridge windows whose temporal organization undergoes a transition from one opening per 2*pi cycle to two openings per cycle, corresponding to a period-halving in time. These windows can be represented compactly by a one-dimensional box-plot visualization, which faithfully captures the underlying geometry and highlights the progressive densification and widening of escape-enabling intervals.\n  The results demonstrate that algebraic diagnostics derived from time-dependent invariants can retain sharp predictive power for rupture phenomena even when exact tube integrability is weakly perturbed.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11145v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Jean-Paul Chehab",
      "Gaspard Kemlin",
      "Marcos Raydan",
      "Yousef Saad"
    ],
    "title": "Eigenvector-based acceleration strategies for gradient-type methods",
    "abstract": "Several strategies are described and analyzed to speed-up gradient-type methods when applied to the minimization of strictly convex quadratics and strictly convex functions. The proposed techniques focus on relaxing the traditional optimal step length associated with gradient methods, including the steepest descent (SD) and the minimal residual (MR) methods. Such a relaxation avoids the well-known negative zigzag effect and allows the iterates to move in the entire space which in turn implies that every so often the search direction approaches some eigenvector of the underlying Hessian matrix. The proposed speedups then rely on taking advantage of the properties of the Lanczos method once a search direction that approaches an eigenvector has been identified in order to accelerate the convergence towards the global minimizer. After analyzing the proposed strategies, we illustrate them on the global minimization of strictly convex functions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11133v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Jérôme Dedecker",
      "Aurélie Fischer",
      "Bertrand Michel"
    ],
    "title": "Concentration of the empirical measure in Wasserstein distance: bounds involving the covering dimension",
    "abstract": "We give concentration inequalities in Wasserstein distance for the empirical measure of a sequence of independent and identically distributed random variables with values in a Polish space E. These inequalities involve the covering dimension of the support of the distribution of the variables. More precisely, we obtain a complete extension of the concentration inequalities of Fournier and Guillin [2015] in the case where E = R^d , in which the covering dimension replaces the dimension of the ambient space E.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11132v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Sebastian Franz",
      "Sascha Trostorff"
    ],
    "title": "Numerical Treatment of Non-local Integral Operators in the Framework of Evolutionary Equations",
    "abstract": "Using the theory of evolutionary equations, we consider abstract differential equations including non-local integral operators. After providing a condition for the well-posedness of the addressed equation we consider a numerical method of approximating its solution. We provide convergence proofs under conditions on the kernel of the integral operator and the solution and finish the paper with some simulation results.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11111v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Hajime Nagoya",
      "Haruki Nakagawa"
    ],
    "title": "Degeneration limits of Virasoro vertex operators and Painlevé tau functions",
    "abstract": "We construct degeneration limits of vertex operators for the Virasoro algebra. Our method relies on the rearranged expansion of compositions of vertex operators together with their integral representations. Using this framework, we obtain a vertex operator between Verma modules of rank $r+1$ as a degeneration of a composition of two vertex operators between Verma modules of rank $r$ ($r\\in\\mathbb{Z}_{\\geq 0}$). Furthermore, we apply these degeneration limits to prove the conjectural expansions of the $τ$ functions of the fifth and fourth Painlevé equations in terms of irregular conformal blocks [H. Nagoya, J. Math. Phys. 56, 123505 (2015)].",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11081v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Shuangshuang Duan",
      "Chunlei He",
      "Shoujun Huang",
      "Dexing Kong"
    ],
    "title": "Hyperbolic mean curvature flow computed by physics-informed neural networks",
    "abstract": "In this paper, we explore the evolution of plane curves and surfaces governed by the hyperbolic mean curvature flow. We propose a mesh-free approach based on the physics-informed neural networks (PINNs), which eliminates the need for discretization and meshing of computational domains, and is efficient in solving partial differential equations involving high dimensions. To the best of our knowledge, this is the first result on the numerical analysis by employing the PINNs for the hyperbolic geometric evolution equations in the literature. The effectiveness of this method is demonstrated through several numerical simulations by selecting diverse initial curves and surfaces, as well as both constant and non-constant initial velocities.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11056v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Enrique García-Sánchez",
      "Denny H. Leung",
      "Mitchell A. Taylor",
      "Pedro Tradacete"
    ],
    "title": "Banach lattices with upper $p$-estimates: Renorming and factorization",
    "abstract": "The notions of $p$-convexity and concavity are fundamental tools for studying Banach lattices, as they partition the class of Banach lattices into a scale of spaces with $L_p$-like properties. Upper and lower $p$-estimates provide a refinement of this scale, modeled by the Lorentz spaces $L_{p,\\infty}$ and $L_{p,1}$, respectively. In this article, we provide a comprehensive treatment of Banach lattices with upper $p$-estimates. In particular, we show that many well-known theorems about $p$-convex Banach lattices have analogues in the upper $p$-estimate setting, including the ability to represent all such spaces inside of infinity sums of model spaces, to canonically factor the convex operators and identify their associated operator ideals, as well as to give a precise description of the free objects and push-outs. Proving these results is far from straightforward and will require the development of a variety of new tools that avoid convexification and concavification procedures. In fact, we will identify many fundamental differences between the theories of $p$-convexity and upper $p$-estimates, particularly with regards to isometric problems and renormings.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11025v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Lei Li",
      "Yanqing Xu",
      "Ye Xue",
      "Feng Yin",
      "Chao Shen",
      "Rui Zhang",
      "Tsung-Hui Chang"
    ],
    "title": "PEMNet: Towards Autonomous and Enhanced Environment-Aware Mobile Networks",
    "abstract": "With 5G deployment and the evolution toward 6G, mobile networks must make decisions in highly dynamic environments under strict latency, energy, and spectrum constraints. Achieving this goal, however, depends on prior knowledge of spatial-temporal variations in wireless channels and traffic demands. This motivates a joint, site-specific representation of radio propagation and user demand that is queryable at low online overhead. In this work, we propose the perception embedding map (PEM), a localized framework that embeds fine-grained channel statistics together with grid-level spatial-temporal traffic patterns over a base station's coverage. PEM is built from standard-compliant measurements -- such as measurement report and scheduling/quality-of-service logs -- so it can be deployed and maintained at scale with low cost. Integrated into PEM, this joint knowledge supports enhanced environment-aware optimization across PHY, MAC, and network layers while substantially reducing training overhead and signaling. Compared with existing site-specific channel maps and digital-twin replicas, PEM distinctively emphasizes (i) joint channel-traffic embedding, which is essential for network optimization, and (ii) practical construction using standard measurements, enabling network autonomy while striking a favorable fidelity-cost balance.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11193v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Peter von Schultzendorff",
      "Tor Harald Sandve",
      "Birane Kane",
      "David Landa-Marbán",
      "Jakub Wiktor Both",
      "Jan Martin Nordbotten"
    ],
    "title": "A Machine-Learned Near-Well Model in OPM Flow",
    "abstract": "Recent advances in reservoir simulation increasingly utilize hybrid approaches that couple physics-based simulators with machine-learning (ML) components. ML components offer high fidelity to training data and fast inference, enabling efficient and accurate modeling of complex multi-scale or multi-physics phenomena. Modern reservoir simulators rely on automatic differentiation (AD) to support efficient and flexible strategies for nonlinear solvers, inverse problems, and optimization problems. Efficient hybrid modeling therefore requires tight integration of the ML components with the simulator's AD framework.\n  We present the first integration of neural networks into the high-performance reservoir simulator OPM Flow. Networks are trained in TensorFlow and imported into OPM, where they are accessed as native AD functions. This presents an efficient framework for hybrid modeling and enables seamless integration in existing simulator workflows.\n  As an application, we introduce a novel, data-driven near-well model. Near-well models are essential in reservoir simulation for accurately representing singular pressure gradients around wells. Commonly used are the Peaceman near-well model and its extensions, or local grid refinement around the wells. Peaceman-type models are limited to simplified flow regimes, whereas local grid refinement is computationally expensive. We address these limitations by training a neural network to infer a Peaceman-like well index from fine-scale ensemble simulations of the near-well region. It is then integrated into OPM Flow with the new framework. Tested on relevant examples for CO$_2$ storage, the method offers high fidelity to fine-scale results at low computational cost, demonstrating the potential of the OPM Flow-Neural Network framework for hybrid modeling.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11152v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Yujun Zhu",
      "Min Li",
      "Yulan Ning",
      "Ju Ming"
    ],
    "title": "An efficient solver based on low-rank approximation and Neumann matrix series for unsteady diffusion-type partial differential equations with random coefficients",
    "abstract": "In this paper, we develop an efficient numerical solver for unsteady diffusion-type partial differential equations with random coefficients. A major computational challenge in such problems lies in repeatedly handling large-scale linear systems arising from spatial and temporal discretizations under uncertainty. To address this issue, we propose a novel generalized low-rank matrix approximation to represent the stochastic stiffness matrices, and approximate their inverses using the Neumann matrix series expansion. This approach transforms high-dimensional matrix inversion into a sequence of low-dimensional matrix multiplications. Therefore, the solver significantly reduces the computational cost and storage requirements while maintaining high numerical accuracy. The error analysis of the proposed solver is also provided. Finally, we apply the method to two classic uncertainty quantification problems: unsteady stochastic diffusion equations and the associated distributed optimal control problems. Numerical results demonstrate the feasibility and effectiveness of the proposed solver.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10900v1",
    "categories": [
      "math.AT",
      "math.DS"
    ],
    "authors": [
      "Bala Krishnamoorthy",
      "Elizabeth Thompson"
    ],
    "title": "A Stable Measure of Chaos in Dynamical Systems Using Persistent Homology",
    "abstract": "Many real-world dynamics exhibit chaos, a phenomenon in which neighboring trajectories in the state space of a dynamical system diverge exponentially over time. A common measure used for measuring the degree of this divergence is the Lyapunov exponent, which relies on pairwise Euclidean distances between the trajectories at each time. The main limitation of the Lyapunov exponent is its sensitivity to small perturbations in input data. Since many real-world dynamics are likely to contain some degree of inherent noise, we are motivated to construct a chaos measure that is robust to small trajectory perturbations. Persistent homology has been used for proving theoretical stability guarantees under such added noise in the data. As such, we introduce a novel, persistent homology based measure of chaos termed the persistence exponent and prove its theoretical stability. We also prove the existence of an upper bound on our measure, and show its greater experimental stability on the Lorenz and Rossler systems describing fluid convection and taffy pulling. We present an algorithm for computing the persistence exponent given a single time series with N points from a dynamical system that runs in O(N^2 log N) time. We finally show the greater experimental stability of the persistence exponent on time series data depicting a Belousov Zhabotinsky chemical reaction, which transitions from periodicity to chaos and back as the system evolves in time.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11146v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Kewen Bu",
      "Youjun Deng",
      "Yan Jiang",
      "Kai Zhang"
    ],
    "title": "Inverse Spectral Problem With Low Regularity Refractive Index",
    "abstract": "This article investigates the unique determination of a radial refractive index n from spectral data. First, we demonstrate that for piecewise twice continuously differentiable functions, n is not uniquely determined by the special transmission eigenvalues associated with radially symmetric eigenfunctions. Subsequently we prove that if n \\in M is twice continuously differentiable functions(or continuously differentiable functions with Lipschitz continuous derivative), then n is uniquely determined on [0,1] by all special transmission eigenvalues when supplemented by partial a priori information on the refractive index.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11131v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "David Harvey",
      "Markus Hittmeir"
    ],
    "title": "Deterministic methods for finding elements of large multiplicative order",
    "abstract": "We revisit the problem of rigorously and deterministically finding elements of large order in the multiplicative group of integers modulo a natural number $N$. Solving this problem is an essential step in several recent deterministic algorithms for factoring $N$, including the currently fastest ones. In 2018, the second author gave an algorithm that for a given target order $D \\geq N^{2/5}$, finds either an element of order exceeding $D$, or a nontrivial divisor of $N$, or proves that $N$ is prime. The running time was \\[ O\\left(\\frac{D^{1/2}}{(\\log \\log D)^{1/2}} \\log^2 N \\right) \\] bit operations, asymptotically the same as the cost of computing the order of a single element using Sutherland's optimisation of the classical babystep-giantstep method. Subsequent work by several authors weakened the hypothesis $D \\geq N^{2/5}$ to $D \\geq N^{1/6}$. In this paper, we show that the hypothesis may be dropped altogether. Moreover, if $N$ is prime, we can guarantee returning an element of order exceeding $D$, rather than a proof that $N$ is prime.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11083v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Antony T. H. Fung",
      "JungHwan Park"
    ],
    "title": "Forbidden configurations and definite fillings of lens spaces",
    "abstract": "We study definite fillings of lens spaces. We classify the lens spaces $L(p,q)$ for which every smooth negative-definite filling $X$ satisfies \\[ b_2(X)\\ge b_2(X(p,q))-1, \\] where $X(p,q)$ denotes the canonical negative-definite plumbing. The classification is given by 17 \"forbidden configurations\" that cannot appear as induced subgraphs of the canonical plumbing graph. More generally, we introduce a combinatorial framework that encodes the lattice embedding information coming from the dual plumbing of $X(p,q)$, and we prove that it is governed by a finite set of minimal forbidden configurations. We also discuss consequences for symplectic fillings of lens spaces and for smoothings of cyclic quotient singularities.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11074v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Yicao Wang"
    ],
    "title": "Self-adjoint extensions with compact resolvent",
    "abstract": "Let $T$ be a densely defined closed symmetric operator with equal deficiency indices in a separable complex Hilbert space $H$. In this paper, we prove that $T$ has a self-adjoint extension with compact resolvent if and only if the domain $D(T)$ of $T$ is compactly embedded in $H$ w.r.t. the graph norm on $D(T)$. If it is the case, we also prove that all self-adjoint extensions with compact resolvent can be parameterized by unitary operators $U$ on a certain Hilbert space such that $U-Id$ is compact.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11041v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Muhammad Ammad",
      "Leevan Ling",
      "Shu Ma"
    ],
    "title": "B-spline-Based ALE-MFS Framework for Evolving Domains",
    "abstract": "We develop and analyze a B-spline based arbitrary Lagrangian-Eulerian method of fundamental solutions (ALE-MFS) for curvature-driven motion of two-dimensional evolving domains. Boundary points move with the material to track the geometric flow, while interior points move within an ALE framework via a harmonic extension of the boundary velocity, computed by a meshless MFS with sources on a fixed auxiliary circle, thus avoiding volumetric meshing. Boundary normals and curvature are reconstructed by an adaptive local B-spline scheme that remains robust for strongly nonconvex shapes and large deformations. A posteriori error estimates are obtained from a hatmatrix formulation of leave-one-out cross-validation (LOOCV) for both square collocation and zero-padded least-squares systems, and are complemented by maximum principle indicators for harmonic problems. Numerical experiments on circular, star-shaped, and amoeba-like domains show that square collocation suffices for moderately complex geometries, while zero-padded least-squares significantly improves interior velocity regularity and pointwise transport accuracy for strongly nonconvex shapes, without altering the source or collocation sets. The ALE-MFS algorithm also generates high-quality moving meshes for ALE-finite element methods, with larger minimum angles and slower mesh ratio growth than classical FEM mesh-motion strategies, suggesting a practical and easily integrable alternative for challenging moving-interface simulations.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10999v1",
    "categories": [
      "math.NA",
      "cs.LG"
    ],
    "authors": [
      "Rishi Mishra",
      "Smriti",
      "Balaji Srinivasan",
      "Sundararajan Natarajan",
      "Ganapathy Krishnamurthi"
    ],
    "title": "Exact Constraint Enforcement in Physics-Informed Extreme Learning Machines using Null-Space Projection Framework",
    "abstract": "Physics-informed extreme learning machines (PIELMs) typically impose boundary and initial conditions through penalty terms, yielding only approximate satisfaction that is sensitive to user-specified weights and can propagate errors into the interior solution. This work introduces Null-Space Projected PIELM (NP-PIELM), achieving exact constraint enforcement through algebraic projection in coefficient space. The method exploits the geometric structure of the admissible coefficient manifold, recognizing that it admits a decomposition through the null space of the boundary operator. By characterizing this manifold via a translation-invariant representation and projecting onto the kernel component, optimization is restricted to constraint-preserving directions, transforming the constrained problem into unconstrained least-squares where boundary conditions are satisfied exactly at discrete collocation points. This eliminates penalty coefficients, dual variables, and problem-specific constructions while preserving single-shot training efficiency. Numerical experiments on elliptic and parabolic problems including complex geometries and mixed boundary conditions validate the framework.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10958v1",
    "categories": [
      "cs.IT",
      "cs.NI"
    ],
    "authors": [
      "Christo Kurisummoottil Thomas",
      "Mingzhe Chen"
    ],
    "title": "Fundamental Limits of Quantum Semantic Communication via Sheaf Cohomology",
    "abstract": "Semantic communication (SC) enables bandwidth-efficient coordination in multi-agent systems by transmitting meaning rather than raw bits. However, when agents employ heterogeneous sensing modalities and AI architectures, perfect bit-level transmission no longer guarantees mutual understanding. Although deep learning methods for semantic compression have advanced, the information-theoretic limits of semantic alignment under heterogeneity remain poorly understood. Notably, semantic ambiguity shares the same mathematical structure as quantum contextuality, as both arise from cohomological obstructions, motivating a quantum formulation of SC. In this paper, an information-theoretic framework for quantum semantic communication is proposed using sheaf cohomology. Multi-agent semantic networks are modeled as quantum sheaves, where agents meaning spaces are Hilbert spaces connected by quantum channels. The first sheaf cohomology group is shown to characterize irreducible semantic ambiguity, representing a fundamental obstruction to alignment that no local processing can resolve. The minimum communication rate required for semantic alignment is proven to scale with the logarithm of the dimension of the cohomological space, establishing a semantic analog of Shannon limits. For entanglement-assisted channels, the achievable capacity is shown to strictly exceed classical bounds, with each shared ebit reducing the required classical communication by one bit, providing a rigorous interpretation of shared context. Additionally, quantum contextuality is shown to reduce cohomological obstructions, and a duality between quantum discord and integrated semantic information is established, linking quantum correlations to irreducible semantic content. This framework provides rigorous foundations for quantum-enhanced semantic communication in autonomous multi-agent systems.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10920v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Vladislav Bukshtynov"
    ],
    "title": "Variational State-Dependent Inverse Problems in PDE-Constrained Optimization: A Survey of Contemporary Computational Methods and Applications",
    "abstract": "State-dependent parameter identification, where unknown model parameters depend on one or more state variables in partial differential equations (PDEs) or coupled PDE systems, is fundamental to a wide range of problems in physics, engineering, and materials science. This review surveys PDE-constrained optimization approaches for such inverse problems, emphasizing the underlying mathematical theory and key computational advances developed since 2011. We discuss variational formulations, adjoint-based gradient methods, regularization strategies, and modern computational frameworks, and highlight representative applications, with particular emphasis on identifiability, ill-posedness, and structural limits of state-dependent inverse problems. The review concludes with major open challenges and emerging research directions related to nonconvexity, identifiability, regularization, adjoint computation, data limitations, and model-class dependence.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10895v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Chunhui Liu"
    ],
    "title": "On the rational points in conics of a cubic surfac",
    "abstract": "In this paper, we give a uniform upper bound on the rational points of bounded height provided by conics in a cubic surface. For this target, we give a generalized version of the global determinant method of Salberger by Arakelov geometry.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10890v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.CA"
    ],
    "authors": [
      "Amílcar Branquinho",
      "Ana Foulquié-Moreno",
      "Manuel Mañas"
    ],
    "title": "Spectral theory for Markov chains with transition matrix admitting a stochastic bidiagonal factorization",
    "abstract": "The recently established spectral Favard theorem for bounded banded matrices admitting a positive bidiagonal factorization is applied to a broader class of Markov chains with bounded banded transition matrices, extending beyond the classical birth-and-death setting, to those that allow a positive stochastic bidiagonal factorization. In the finite case, the Karlin-McGregor spectral representation is derived. The recurrence of the Markov chain is established, and explicit formulas for the stationary distributions are provided in terms of orthogonal polynomials. Analogous results are obtained for the countably infinite case. In this setting, the chain is not necessarily recurrent, and its behavior is characterized in terms of the associated spectral measure. Finally, ergodicity is examined through the presence of a mass at $1$ in the spectral measure, corresponding to the eigenvalue $1$ with both right and left eigenvectors.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10856v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "G. Lusztig"
    ],
    "title": "Antispecial representations of Weyl groups",
    "abstract": "Let W be a Weyl group. We define a class of irreducible representations of W that we call antispecial. They are in bijection with the constructible representations of W. We define an oriented graph structure on the set of antispecial representations or equivalently on the set of constructible representations of W. We describe explicitly the antispecial representations in each case.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10833v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Pratima Hebbar",
      "Leonid Koralov"
    ],
    "title": "Distribution of particles near the front in supercritical branching Brownian motion with compactly supported branching",
    "abstract": "We investigate the long-time behavior of a $d-$dimensional supercritical branching Brownian motion with a compactly supported branching potential. It is known that, for $\\mathbf{v}\\in \\mathbb{R}^d$, all the moments of the normalized number of particles in a bounded domain centered at $\\mathbf{v} t$ converge, as $t \\rightarrow \\infty$, provided that $\\|\\mathbf{v}\\|$ is strictly less than the asymptotic speed of the front. The limiting distribution does not depend on $\\mathbf{v}$. Using sharp asymptotics for the solutions of parabolic PDEs with compact potential, we prove that the normalized number of particles in a bounded time-dependent domain located near the front converges in distribution and with all the moments. The limit, however, now depends on the asymptotic location of the domain.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10828v1",
    "categories": [
      "math.NA",
      "cs.MS"
    ],
    "authors": [
      "Nedialko S. Nedialkov",
      "John D. Pryce"
    ],
    "title": "High-Order Lie Derivatives from Taylor Series in the ADTAYL Package",
    "abstract": "High-order Lie derivatives are essential in nonlinear systems analysis. If done symbolically, their evaluation becomes increasingly expensive as the order increases. We present a compact and efficient numerical approach for computing Lie derivatives of scalar, vector, and covector fields using the MATLAB ADTAYL package. The method exploits a fact noted by Röbenack: that these derivatives coincide, up to factorial scaling, with the Taylor coefficients of expressions built from a Taylor expansion about a trajectory point and, when required, the associated variational matrix. Computational results for a gantry crane model demonstrate orders of magnitude speedups over symbolic evaluation using the MATLAB Symbolic Math Toolbox.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.10815v1",
    "categories": [
      "math-ph",
      "cs.DM"
    ],
    "authors": [
      "Oliver Knill"
    ],
    "title": "Block Jacobi matrices, Barycentric limits and Manifolds",
    "abstract": "We deform block triangular Jacobi matrices appearing in geometry, look at multi-scale Barycentric limits of geometries and droplet boundary manifolds in Potts networks.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11489v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Trygve Poppe Oldervoll"
    ],
    "title": "Quasi-unitial Inner Kan Spaces",
    "abstract": "We show that semi-simplicial spaces that i) admit inner horn fillers up to homotopy and ii) possess units in a weak sense provide a viable model for $\\infty$-categories. The existence of units can be expressed through various quasi-unitality conditions, and we compare the natural generalization of three such conditions found in the literature. This work is motivated by applications in Floer homotopy theory.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11467v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Eduardo Queiroga",
      "Rafael Martinelli",
      "Anand Subramanian",
      "Eduardo Uchoa",
      "Thibaut Vidal"
    ],
    "title": "The XL Instances for the Capacitated Vehicle Routing Problem",
    "abstract": "This paper introduces a new set of large-scale benchmark instances for the Capacitated Vehicle Routing Problem (CVRP). The proposed XL set extends existing benchmarks by covering instances with 1,000 to 10,000 customers and a wide range of structural characteristics, following established generation principles from prior CVRP studies. A computational study involving several state-of-the-art algorithms is conducted to provide initial best known solutions (BKSs) for the XL instances, which serve as a baseline for a community-driven BKS challenge launched on the CVRPLib website. The instances are made publicly available to support experimental evaluation and comparison of solution methods. Furthermore, additional computational analyses are reported to compare algorithmic performance on other existing CVRP benchmark instances.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11456v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Barbara Nelli",
      "Claudia Pontuale"
    ],
    "title": "Finite Index and Do Carmo Question for Constant Mean Curvature Hypersurfaces",
    "abstract": "We prove that any finite $δ$-index hypersurface $M$ in ${\\mathbb R}^{n+1}$ with constant mean curvature must be minimal, provided\n  - the volume growth of $M$ is sub-exponential;\n  - the Ricci curvature of $M$ satisfies $\\operatorname{Ric}_M\\geq -\\frac{4(1-δ)}{n-1}|A|^2g,$ where $A$ is the second fundamental form and $g$ is the metric on $M.$\n  In the second case, our result further implies that, in addition to being minimal, such an $M$ must be a hyperplane.\n  Notice that, we do not have any restriction on the dimension and that the second result is new also in the case of finite index hypersurfaces ($δ=0$).",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11455v1",
    "categories": [
      "math.FA",
      "math-ph",
      "math.CO",
      "math.OA"
    ],
    "authors": [
      "Alexandru Chirvasitu"
    ],
    "title": "Frame eversion and contextual geometric rigidity",
    "abstract": "We prove rigidity results describing contextually-constrained maps defined on Grassmannians and manifolds of ordered independent line tuples in finite-dimensional vector or Hilbert spaces. One statement in the spirit of the Fundamental Theorem of Projective Geometry classifies maps between full Grassmannians of two $n$-dimensional Hilbert spaces, $n\\ge 3$, preserving dimension and lattice operations for pairs with commuting orthogonal projections, as precisely those induced by semilinear injections unique up to scaling.\n  In a different but related direction, denote the manifolds of ordered orthogonal (linearly-independent) $n$-tuples of lines in an $n$-dimensional Hilbert space $V$ by $\\mathbb{F}^{\\perp}(V)$ (respectively $\\mathbb{F}(V)$) and, for partitions $π$ of the set $\\{1..n\\}$, call two tuples $π$-linked if the spans along $π$-blocks agree. A Wigner-style rigidity theorem proves that the symmetric maps $\\mathbb{F}^{\\perp}(\\mathbb{C}^n)\\to \\mathbb{F}(\\mathbb{C}^n)$, $n\\ge 3$ respecting $π$-linkage are precisely those induced by semilinear injections, hence by linear or conjugate-linear maps if also assumed measurable. On the other hand, in the $\\mathbb{F}(\\mathbb{C}^n)$-defined analogue the only other possibility is a qualitatively new type of purely-contextual-global symmetry transforming a tuple $(\\ell_i)_i$ of lines into $\\left(\\left(\\bigoplus_{j\\ne i}\\ell_j\\right)^{\\perp}\\right)_i$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11407v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Cel Thys",
      "Rodney Martinez Alonso",
      "Sofie Pollin"
    ],
    "title": "Efficient Channel Autoencoders for Wideband Communications leveraging Walsh-Hadamard interleaving",
    "abstract": "This paper investigates how end-to-end (E2E) channel autoencoders (AEs) can achieve energy-efficient wideband communications by leveraging Walsh-Hadamard (WH) interleaved converters. WH interleaving enables high sampling rate analog-digital conversion with reduced power consumption using an analog WH transformation. We demonstrate that E2E-trained neural coded modulation can transparently adapt to the WH-transceiver hardware without requiring algorithmic redesign. Focusing on the short block length regime, we train WH-domain AEs and benchmark them against standard neural and conventional baselines, including 5G Polar codes. We quantify the system-level energy tradeoffs among baseband compute, channel signal-to-noise ratio (SNR), and analog converter power. Our analysis shows that the proposed WH-AE system can approach conventional Polar code SNR performance within 0.14dB while consuming comparable or lower system power. Compared to the best neural baseline, WH-AE achieves, on average, 29% higher energy efficiency (in bit/J) for the same reliability. These findings establish WH-domain learning as a viable path to energy-efficient, high-throughput wideband communications by explicitly balancing compute complexity, SNR, and analog power consumption.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11386v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Jake Cordes",
      "Barbara Giunti",
      "Zheng Wu"
    ],
    "title": "SuPerPoV: Score and evolution of the stratospheric polar vortex via persistent homology",
    "abstract": "Classifying the stratospheric polar vortex provides predictability for surface weather on extended-range timescales definitions of these events proposed in over 60 years of study depend on empirically chosen parameters and yield different results when one of them changes. Moreover, as previous definitions are based on static thresholds, it is not straightforward to use them to study the spatiotemporal evolution of the vortexe introduce SuPerPoV, a score system that computes displacement and split ratiossing tools from applied topology. The computation is entirely threshold-free, open source, and does not require familiarity with applied topology. The scores generally recovers previous definitions and are output for a user-defined number of days, thus showing the evolution of the event. SuPerPoV offers a paradigm shift in the study of the polar vortex, hopefully bringing a deeper understanding of the polar vortex and related extreme events, such as sudden stratospheric warmings.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11308v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Ferhat Sindy",
      "Annalisa Buffa",
      "Marco Picasso"
    ],
    "title": "A Recovery-Based Error Indicator for Finite Difference Methods",
    "abstract": "A novel recovery-based error indicator for high-order Finite Difference Methods, based on post-processing of the Finite Difference values is presented. The values obtained on the Finite Difference grid are interpolated into a suitable polynomial Finite Element space. A recovery-based error indicator, with the polynomial-preserving property, is then applied to estimate the gradient error. The performance and accuracy of the proposed error indicator are demonstrated through several numerical experiments, including the two-dimensional Poisson problem solved using second- and fourth-order finite difference schemes. Additional experiments are conducted on elliptic problems with discontinuous coefficients, as well as on the two and three-dimensional wave equation in homogeneous media with second- and fourth-order finite differences, and in heterogeneous media with second-order finite differences.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11263v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Jiaxi Zha"
    ],
    "title": "Topological CoHochschild Homology and Thom Spectra",
    "abstract": "For an $\\E$-ring spectrum $R$ and a map $f:X\\to Pic(R)$ of spaces, the Thom spectrum $\\T f$ is a comodule over $R\\otimes\\Si X$. In this parper we study the topological coHochschild homology of $R\\otimes\\Si X$ with coefficient $\\T f$. More concretely, for a simply connected space $X$, we will give a filtration on $\\mathrm{coTHH}^R(\\T f;R\\otimes\\Si X)$ via the cellular structure of $X$. Furthermore, we will reduce the computation of $\\mathrm{coTHH}^R(\\T f;R\\otimes\\Si X)$ to that of $\\mathrm{coTHH}^R(R\\otimes\\Si G)$ for some group-like $\\mathbb{E}_1$-spaces. Finally, we will use these results to study properties of $\\mathrm{coTHH}(\\T f;R\\otimes\\Si X)$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11260v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Martin Ortiz"
    ],
    "title": "Theta operators on Hodge type Shimura varieties",
    "abstract": "We construct a new family of mod $p$ weight shifting differential operators on Hodge type Shimura varieties at hyperspecial level. First we construct basic theta operators, labelled by positive roots, that generalize Katz's theta operator for modular forms. Secondly we construct theta linkage maps, these are operators between automorphic vector bundles with linked weights, which can be thought of as generalizations of the classical theta cycle of Tate--Jochnowitz. In particular, there exist such maps within the $p$-restricted region, whose weight shifts are directly related to the conjectures of Herzig on the weight part of Serre's conjecture. We explain the relation between the two operators, and we prove some properties about them, e.g., the injectivity of some of them in a generic locus of the $p$-restricted region. As an application, we produce an example of a generic entailment of Serre weights for the groups $GL_{4,\\mathbb{Q}_p}$ and $U(4)_{\\mathbb{Q}_p}$, by combining the method of arxiv:2410.09602 with our stronger results about theta operators.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11253v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Luigi Iorio",
      "Marco Trombetti"
    ],
    "title": "Finite groups with a large normalized sum of element orders",
    "abstract": "For a finite group $G$, let $ψ(G)$ be the sum of the orders of its elements, and define the corresponding normalized sum as $ψ'(G) := ψ(G)/ψ(\\mathcal{C}_{|G|})$, where $\\mathcal{C}_{|G|}$ is the cyclic group of the same order as $G$. Inspired by analogous criteria for the classes of soluble, supersoluble, and nilpotent groups, our main result establishes that if $ψ'(G)>ψ'(D_8) = \\frac{19}{43}$, then $G$ belongs to the well-understood class of groups with a modular subgroup lattice, whose structure theory allows us to readily identify all groups satisfying this bound. Moreover, the equality case is fully settled. Finally, our arguments lead to a complete description of all groups satisfying $ψ'(G)> ψ'(A_4) = \\frac{31}{77}$, thereby fully determining the groups covered by the supersolubility criterion of Baniasad Azad and Khosravi [Canad. Math. Bull. 65 (2022), 30--38], and thus providing a more complete answer to a corresponding conjecture of Tǎrnǎuceanu.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11211v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Ju A Lee",
      "Ki-Heon Yun"
    ],
    "title": "Knot surgery $4$-manifolds $E(n)_K$ without $1$- and $3$-handles",
    "abstract": "In this article, we demonstrate that for any positive integer $n$, the knot surgery $4$-manifold $E(n)_K$ has a handle decomposition without $1$- and $3$-handles. Here, $K$ represents either a fibered two-bridge knot $C(2ε_1, 2ε_2,\\cdots, 2ε_{2g})$ ($ε_i \\in \\{ 1, -1\\}$) in Conway's notation or a Stallings knot $K_m$ ($m \\in \\mathbb{Z}$).",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11465v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "XuanLong Nguyen",
      "Yun Wei"
    ],
    "title": "Optimal transport based theory for latent structured models",
    "abstract": "This article is an exposition on some recent theoretical advances in learning latent structured models, with a primary focus on the fundamental roles that optimal transport distances play in the statistical theory. We aim at what may be the most critical and novel ingredient in this theory: the motivation, formulation, derivation and ramification of inverse bounds, a rich collection of structural inequalities for latent structured models which connect the space of distributions of unobserved structures of interest to the space of distributions for observed data. This theory is illustrated on classical mixture models, as well as the more modern hierarchical models that have been developed in Bayesian statistics, machine learning and related fields.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11520v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Mengyuan Zhao",
      "Maël Le Treust",
      "Tobias J. Oechtering"
    ],
    "title": "Empirical Coordination over Markov Channel with Independent Source",
    "abstract": "We study joint source-channel coding over Markov channels through the empirical coordination framework. More specifically, we aim at determining the empirical distributions of source and channel symbols that can be induced by a coding scheme. We consider strictly causal encoders that generate channel inputs, without access to the past channel states, henceforth driving the current Markov state evolution. Our main result is the single-letter inner and outer bounds of the set of achievable joint distributions, coordinating all the symbols in the network. To establish the inner bound, we introduce a new notion of typicality, the input-driven Markov typicality, and develop its fundamental properties. Contrary to the classical block-Markov coding schemes that rely on blockwise independence for discrete memoryless channels, our analysis directly exploits the Markov channel structure and improves beyond the independence-based arguments.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11493v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Lorenzo Lazzarino",
      "Katherine J. Pearce",
      "Nathaniel Pritchard"
    ],
    "title": "Efficient error estimators for Generalized Nyström",
    "abstract": "Randomized algorithms in numerical linear algebra have proven to be effective in ameliorating issues of scalability when working with large matrices, efficiently producing accurate low-rank approximations. A key remaining challenge, however, is to efficiently assess the approximation accuracy of randomized methods without additional expensive matrix accesses. Recent work has addressed this issue by deriving fast leave-one-out error estimators for the randomized SVD and Nyström decomposition, enabling accurate error estimation with no additional matrix accesses. In this work, we extend the leave-one-out framework to the generalized Nyström decomposition, an approach that can be applied to general rectangular matrices. We do this by deriving three new leave-one-out error estimators and validating their effectiveness through numerical experiments.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11490v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Melvyn B. Nathanson"
    ],
    "title": "Sumset size races for measurable sets",
    "abstract": "Let $G$ be a locally compact abelian group with Haar measure $μ$. For integers $n \\geq 2$ and $H \\geq 2$ and for any $n$-tuples $\\mathbf{u}_1,\\ldots, \\mathbf{u}_H \\in \\mathbf{N}^n$, there exist measurable subsets $A_1,\\ldots, A_n$ of $G$ such that the $n$-tuple $\\left( μ(hA_1),\\ldots, μ(hA_n) \\right)$ has the same relative order as the $n$-tuple $\\mathbf{u}_h$ for all $h = 1,\\ldots, H$.\n  For integers $m_{i,h}$ for $i =1,\\ldots, n-1$ and $h = 1,\\ldots, H$, there are Lebesgue measurable sets $A_1,\\ldots, A_n$ in $\\mathbf{R}$ such that $μ(hA_{i+1}) - μ(hA_i) = m_{i,h}$ for all $i$ and $h$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11481v1",
    "categories": [
      "math.GT",
      "cond-mat.soft",
      "cond-mat.stat-mech"
    ],
    "authors": [
      "Ryan Blair",
      "Puttipong Pongtanapaisan",
      "Christine E. Soteros"
    ],
    "title": "Entanglement complexity of spanning pairs of lattice polygons",
    "abstract": "We study the entanglement complexity of a system consisting of two simple-closed curves (self-avoiding polygons) that span a lattice tube, referred to as a 2SAP. 2SAPs are of interest as the first known model of confined ring polymers where the linking probability goes to 1 exponentially with the size of the system. Atapour et al proved this in 2010 by showing that all but exponentially few sufficiently large 2SAPs contain a pattern that guarantees the 2SAP is non-split, provided that the requisite pattern fits in the tube. This result was recently extended to all tubes sizes that admit non-trivial links. Here we develop and apply knot theory results to answer more general questions about the entanglement complexity of 2SAPs.\n  We first extend the 1992 concept of a good measure of knot complexity to a good measure, $F$, of spanning-link complexity for $k$-component links. Using tangle products, we show, for example, that the more complex the prime knot decomposition of any component of a given link type, the greater its $F$-measure. We then prove that all but exponentially few size $m$ 2SAPs have $F$ complexity that grows at least linearly in $m$ as $m\\to \\infty$. We establish that good measures of knot complexity yield good measures of spanning-link complexity. We also establish conditions whereby more general link invariants can yield good measures. In particular, we establish that measures based on several classical invariants are good measures by our definition, eg bridge number or the number of $p$-colourings.\n  Finally, we consider how the tube dimensions affect which links are embeddable as 2SAPs as well as geometric restrictions on the entanglement complexity of the embeddings. For example, we establish that there are two-component links that occur as 2SAPs in a given tube size only when one of the components is forced into a non-minimal bridge number conformation.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11439v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Johan Thunberg",
      "Galina Sidorenko"
    ],
    "title": "Projection-based discrete-time consensus on the unit sphere",
    "abstract": "We address discrete-time consensus on the Euclidean unit sphere. For this purpose we consider a distributed algorithm comprising the iterative projection of a conical combination of neighboring states. Neighborhoods are represented by a strongly connected directed graph, and the conical combinations are represented by a (non-negative) weight matrix with a zero structure corresponding to the graph. A first result mirrors earlier results for gradient flows. Under the assumptions that each diagonal element of the weight matrix is more than $\\sqrt{2}$ larger than the sum of the other elements in the corresponding row, the sphere dimension is greater or equal to 2, and the graph, as well as the weight matrix, is symmetric, we show that the algorithm comprises gradient ascent, stable fixed points are consensus points, and the set of initial points for which the algorithm converges to a non-consensus fixed point has measure zero. The second result is that for the unit circle and a strongly connected graph or for any unit sphere with dimension greater than or equal to $1$ and the complete graph, only for a measure zero set of weight matrices there are fixed points for the algorithm which do not have consensus or antipodal configurations.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11435v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Menglian Wang",
      "Zhuanghua Liu",
      "Luo Luo"
    ],
    "title": "Near-Optimal Decentralized Stochastic Nonconvex Optimization with Heavy-Tailed Noise",
    "abstract": "This paper studies decentralized stochastic nonconvex optimization problem over row-stochastic networks. We consider the heavy-tailed gradient noise which is empirically observed in many popular real-world applications. Specifically, we propose a decentralized normalized stochastic gradient descent with Pull-Diag gradient tracking, which achieves approximate stationary points with the optimal sample complexity and the near-optimal communication complexity. We further follow our framework to study the setting of undirected networks, also achieving the nearly tight upper complexity bounds. Moreover, we conduct empirical studies to show the practical superiority of the proposed methods.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11422v1",
    "categories": [
      "math.ST",
      "math.PR"
    ],
    "authors": [
      "Robert E. Gaunt",
      "Frédéric Ouimet",
      "Donald Richards"
    ],
    "title": "Stein's method for the matrix normal distribution",
    "abstract": "This work presents the first systematic development of Stein's method for matrix distributions. We establish the basic essential ingredients of Stein's method for matrix normal approximation: we derive a generator-based Stein identity from a matrix Ornstein--Uhlenbeck diffusion with two-sided scales, provide an explicit semigroup representation for the solution of the Stein equation, and obtain regularity estimates for the solution. The new methodology is illustrated with three statistical applications, these being smooth Wasserstein distance bounds to quantify the matrix central limit theorem, a Wasserstein distance bound for the matrix normal approximation of the centered matrix $T$ distribution, and the derivation of Stein's method-of-moments estimators for scale parameters of the matrix normal distribution.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11384v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Pedro Hernández-Llanos",
      "Rajesh Mahadevan",
      "Ravi Prakash"
    ],
    "title": "Homogenized moderately wrinkled shell theory from 3D Koiter's linear elasticity",
    "abstract": "In this paper we derive, by two$-$scale convergence, periodically wrinked shell models starting from three dimensional linear elasticity, depending of the behaviour of the small parameter $\\varepsilon>0$ and $p>1$, differents theories appear. We assume that the mid-surface of the shell is given by $\\displaystyle ψ(x_1,x_2)+\\varepsilon^pθ\\left(\\frac{x_1}{\\varepsilon},\\frac{x_2}{\\varepsilon}\\right)\\vect{a}_{3}(x_1,x_2)$, where $θ$ is $[0,1)^2$-periodic function and $p=2$. We also assume that the strain energy of the shell has the Koiter's model.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11376v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Karsten Müller",
      "Michael Taktikos"
    ],
    "title": "From ABC to Effective Roth and Ridout Constants for Cubic Roots",
    "abstract": "Enrico Bombieri showed conditionally (1994) that the ABC conjecture implies Roth's theorem, and Van Frankenhuysen (1999) later provided a complete proof. Building on Bombieri's and Van der Poorten's explicit formula for continued-fraction coefficients of algebraic numbers (specialized to cubic roots) we derive an effective bound for a Roth-type constant assuming an effective form of ABC. Roth's original argument establishes existence but does not yield an explicit value; our approach makes the dependence on the ABC parameters explicit and also gives an explicit bound in the corresponding special case of Ridout's theorem. We then introduce the notion of approximation gain as a refinement of the quality of an abc-triple. For c in a large computational range, the approximation gain remains below a strikingly small threshold, motivating the conjecture that the approximation gain is always smaller than 1.5. This suggests a potential strategy for attacking ABC by bounding approximation gain and power gain separately.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11364v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Chiara Boiti",
      "David Jornet",
      "Alessandro Oliaro"
    ],
    "title": "Stability of global wave front sets by perturbations of frames",
    "abstract": "In this paper we consider the Gabor wave front set of ultradistributions in the frame of ultradifferentiable functions. We prove that such a wave front set, defined through a Gabor frame on a regular lattice, is not affected by perturbations of the frame, in two different cases: when we consider $\\varepsilon$-perturbations of Christensen type, and when we consider nonstationary Gabor frames.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11348v1",
    "categories": [
      "math.OC",
      "q-fin.RM"
    ],
    "authors": [
      "Hansjoerg Albrecher",
      "Nora Muler"
    ],
    "title": "Optimal Abatement Schedules for Excess Carbon Emissions Towards a Net-Zero Target",
    "abstract": "Achieving net-zero carbon emissions requires a transformation of energy systems, industrial processes, and consumption patterns. In particular, a transition towards that goal involves a gradual reduction of excess carbon emissions that are not essential for the well-functioning of society. In this paper we study this problem from a stochastic control perspective to identify the optimal gradual reduction of the emission rate, when an allocated excess carbon budget is used up over time. Assuming that updates of the available carbon budget follow a diffusion process, we identify the emission strategy that maximizes expected discounted emissions under the constraint of a non-increasing emission rate, with an additional term rewarding the amount of time for which the budget is not yet depleted. We establish a link of this topic to optimal dividend problems in insurance risk theory under ratcheting constraints and show that the value function is the unique viscosity solution of the associated Hamilton-Jacobi-Bellman equation. We provide numerical illustrations of the resulting optimal abatement schedule of emissions and a quantitative evaluation of the effect of the non-increasing rate constraint on the value function.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11304v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Densuke Shiraishi"
    ],
    "title": "On the Landen formula for multiple polylogarithms and its $\\ell$-adic Galois analogue",
    "abstract": "In the present paper, we provide an algebraic and geometric proof of the Landen formula for complex multiple polylogarithms originally established by Okuda and Ueno. Our approach employs a chain rule of complex KZ solutions arising from the symmetry $z \\mapsto \\frac{z}{z-1}$ of $\\mathbb{P}^1 \\backslash \\{0,1,\\infty\\}$. Furthermore, by replacing complex KZ solutions with $\\ell$-adic Galois 1-cocycles in this proof, we obtain the Landen formula for $\\ell$-adic Galois multiple polylogarithms. This formula involves lower weight terms specific to the $\\ell$-adic Galois setting, which originate from the higher-order terms of the Baker-Campbell-Hausdorff sum ${\\rm log}({\\rm exp}(-e_1){\\rm exp}(-e_0))$. These lower weight terms are explicitly described by an integral involving Goldberg polynomials.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11300v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Pham Viet Hai",
      "Thanh Quoc Trinh",
      "Phan Tu Vuong"
    ],
    "title": "Second order continuous and discrete dynamical systems for solving inverse quasi-variational inequalities",
    "abstract": "In this paper, we investigate the inverse quasi-variational inequality problem in finite-dimensional spaces. First, we introduce a second-order dynamical system whose trajectory converges exponentially to the solution of the inverse quasi-variational inequality, under the assumptions of Lipschitz continuity and strong monotonicity. Next, we discretize the proposed dynamical system to develop an algorithm, and prove that the iterations converge linearly to the unique solution of the inverse quasi-variational inequality. Finally, we present numerical experiments and applications to validate the theoretical results and compare the performance with existing methods.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11274v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Sylvia Novo",
      "Rafael Obaya",
      "Ana M. Sanz"
    ],
    "title": "Precompact families of Carathéodory differential equations revisited",
    "abstract": "The space of parametric b-measures endowed with appropriate topologies is introduced to define a new class of generalized ODEs given by parametric b-measures. This framework offers a new approach for dealing with precompact families of Carathéodory ODEs using nonautonomous dynamical systems techniques. An application to the study of the dynamics of the fast variables of a slow-fast system of ODEs, where the fast motion is determined by a Carathéodory vector field with equicontinuous $m$-bounds and bounded $l$-bounds, is given.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11257v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yu Yang",
      "Yingxin Zhang",
      "Weijie Yuan",
      "Lin Zhou"
    ],
    "title": "Rate-Distortion-Perception Tradeoff for the Gray-Wyner Problem",
    "abstract": "We revisit the Gray-Wyner lossy source coding problem and derive the first-order asymptotic optimal rate-distortion-perception region when additional perception constraints are imposed on reproduced source sequences. The optimal trade-off is shown to be governed by a mutual information term involving common information and two conditional rate-distortion-perception functions. The perception constraint requires that the distribution of each reproduced sequence is close to that of the original source sequence, which is motivated by practical applications in image and video compression. Prior studies usually focus on the compression and reconstruction of a single source sequence. In this paper, we generalize the prior results for point-to-point systems to the representative multi-terminal setting of the Gray-Wyner problem with two correlated source sequences. In particular, we integrate the analyses of the distortion and the perception constraints by including the random circular shift operator in the encoding and decoding process directly.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11217v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Matthieu Meunier",
      "Huyên Pham",
      "Christoph Reisinger"
    ],
    "title": "Model-free policy gradient for discrete-time mean-field control",
    "abstract": "We study model-free policy learning for discrete-time mean-field control (MFC) problems with finite state space and compact action space. In contrast to the extensive literature on value-based methods for MFC, policy-based approaches remain largely unexplored due to the intrinsic dependence of transition kernels and rewards on the evolving population state distribution, which prevents the direct use of likelihood-ratio estimators of policy gradients from classical single-agent reinforcement learning. We introduce a novel perturbation scheme on the state-distribution flow and prove that the gradient of the resulting perturbed value function converges to the true policy gradient as the perturbation magnitude vanishes. This construction yields a fully model-free estimator based solely on simulated trajectories and an auxiliary estimate of the sensitivity of the state distribution. Building on this framework, we develop MF-REINFORCE, a model-free policy gradient algorithm for MFC, and establish explicit quantitative bounds on its bias and mean-squared error. Numerical experiments on representative mean-field control tasks demonstrate the effectiveness of the proposed approach.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11312v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Joonhyung Kim",
      "Ioannis D. Platis",
      "Li-Jie Sun"
    ],
    "title": "On the sub-Riemannian geometry of the quaternionic Heisenberg group",
    "abstract": "Utilizing the framework of quaternionic contact geometry, we define a sequence of Riemannian metrics $\\{g_L\\}$ on the quaternionic Heisenberg group $\\mathfrak{H}_{\\mathbb{H}}$ by rescaling the vertical directions. By analyzing the limit of this sequence, we characterize the Carnot-Carathéodory geodesics and provide the explicit description of the Carnot-Carathéodory distance and spheres in $\\mathfrak{H}_{\\mathbb{H}}$ . Furthermore, we derive a general formula for the horizontal mean curvature of hypersurfaces.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11221v1",
    "categories": [
      "math.LO",
      "math.CT"
    ],
    "authors": [
      "Ivan Di Liberti",
      "Lingyuan Ye"
    ],
    "title": "Craig Interpolation for Subgeometric Logics",
    "abstract": "We show that a vast class of finitary fragments of geometric logic admit a form of Craig interpolation property. In doing so, we provide a new dictionary to import technology from algebraic logic to categorical logic.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11501v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Frederik Walter",
      "Maria Abu-Sini",
      "Nils Weinhardt",
      "Antonia Wachter-Zeh"
    ],
    "title": "Coding Schemes for the Noisy Torn Paper Channel",
    "abstract": "To make DNA a suitable medium for archival data storage, it is essential to consider the decay process of the strands observed in DNA storage systems. This paper studies the decay process as a probabilistic noisy torn paper channel (TPC), which first corrupts the bits of the transmitted sequence in a probabilistic manner by substitutions, then breaks the sequence into a set of noisy unordered substrings. The present work devises coding schemes for the noisy TPC by embedding markers in the transmitted sequence. We investigate the use of static markers and markers connected to the data in the form of hash functions. These two tools have also been recently exploited to tackle the noiseless TPC. Simulations show that static markers excel at higher substitution probabilities, while data-dependent markers are superior at lower noise levels. Both approaches achieve reconstruction rates exceeding $99\\%$ with no false decodings observed, primarily limited by computational resources.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11495v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Hlel Missaoui"
    ],
    "title": "Global $C^{1,α}$-Regularity for Musielak-Orlicz Equations in Divergence Form",
    "abstract": "In this paper, we establish global $C^{1,α}$-regularity for bounded generalized solutions of elliptic equations in divergence form with Musielak-Orlicz growth and subject to Dirichlet or Neumann boundary conditions. In fact, our findings extend and generalize several important regularity results in cases of special attention such as variable exponent spaces, Orlicz spaces, and some $(p,q)$ situations. We also point out new conditions in the analysis that focus on the interplay between non-standard growth conditions and the boundary behavior in such generalized examples.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11486v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Musbahu Idris",
      "Jean-Marc Sac-Épée"
    ],
    "title": "Algorithmic aspects of Newman polynomials and their divisors",
    "abstract": "We study the problem of determining which integer polynomials divide Newman polynomials. In this vein, we first give results concerning the $8438$ known polynomials with Mahler measure less than $1.3$. We then exhibit a list of polynomials that divide no Newman polynomial. In particular, we show that a degree-10 polynomial of Mahler measure \\text{approximately} 1.419404632 divides no Newman polynomial, thereby improving the best known upper bound for any universal constant $σ$, if it exists, such that every integer polynomial of Mahler measure less than $σ$ divides a Newman polynomial. Finally, letting $l(x)$ denote Lehmer's polynomial, we explicitly construct Newman polynomials divisible by $l(x)^2$ with degrees up to $150$, and show that no Newman polynomial is divisible by $l(x)^3$ up to degree $160$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11474v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Olivier Benoist"
    ],
    "title": "The resultant divisor is negative",
    "abstract": "Fix two integers $1\\leq d<e$. We study the birational geometry of a parameter space for pairs of homogeneous polynomials of degrees $d$ and $e$ in two variables (in which the higher degree polynomial is well defined only up to a multiple of the lower degree polynomial). We show that one can run the MMP on this space, and that it eventually contracts the resultant divisor.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11473v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Ahmed Attia"
    ],
    "title": "A Probabilistic Approach to Trajectory-Based Optimal Experimental Design",
    "abstract": "We present a novel probabilistic approach for optimal path experimental design. In this approach a discrete path optimization problem is defined on a static navigation mesh, and trajectories are modeled as random variables governed by a parametric Markov policy. The discrete path optimization problem is then replaced with an equivalent stochastic optimization problem over the policy parameters, resulting in an optimal probability model that samples estimates of the optimal discrete path. This approach enables exploration of the utility function's distribution tail and treats the utility function of the design as a black box, making it applicable to linear and nonlinear inverse problems and beyond experimental design. Numerical verification and analysis are carried out by using a parameter identification problem widely used in model-based optimal experimental design.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11470v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Roope Anttila",
      "Markus Myllyoja"
    ],
    "title": "Dvoretzky covering problem for general measures",
    "abstract": "We study the Dvoretzky covering problem for random covering sets driven by general Borel probability measures. As our main result, we solve the problem of covering analytic sets by random covering sets generated by arbitrary Borel probability measures on the real line. Prior to this work, a complete solution was not known for any singular measure. Our solution is potential theoretic and involves a generalisation of a notion of capacity in the work of Kahane, who solved the problem of covering compact sets in the classical setting where the random covering process is driven by the Lebesgue measure on the unit circle. One of our key innovations is a simple but powerful application of the Jankov-von Neumann uniformisation theorem, which we believe to have interest outside of this work.\n  In addition, we determine the critical exponent for the covering problem for polynomially decreasing sequences $(cn^{-t})_n$ for random covering sets driven by Borel probability measures on $\\mathbb{R}^d$. At exactly the critical exponent, the covering property generally depends on the constant $c>0$, and as an application of our main result, we determine the critical constant for random covering sets driven by natural measures on strongly separated self-conformal sets on the line. The critical constant depends on the multifractal structure of the average densities of the measure, and the result is new even for the simplest case of the Hausdorff measure on the Cantor set.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11463v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Marek Cúth",
      "Jonáš Havelka",
      "Jakub Rondoš",
      "Bünyamin Sarı"
    ],
    "title": "The classification of $C(K)$ spaces for countable compacta by positive isomorphisms",
    "abstract": "We study the classification of spaces of continuous functions $C(K)$ under positive linear maps. For infinite countable compacta, we show that whenever $C(K)$ and $C(L)$ are isomorphic, there exists an isomorphism $T:C(K)\\to C(L)$ satisfying either $T\\geq 0$ or $T^{-1}\\geq 0$. We also prove that for any compact spaces $K$ and $L$, the existence of a positive embedding $T: C(K) \\to C(L)$ implies that the Cantor-Bendixson height of $K$ does not exceed the height of $L$. Furthermore, we introduce a one-sided positive Banach-Mazur distance and obtain new estimates for both the classical and positive distances. Notably, we prove the exact formula $d_{BM}(C(ω^{ω^α}), C(ω^{ω^αn})) = n+\\sqrt{(n-1)(n+3)}$.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11431v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Cain Edie-Michell",
      "Jacques Katumba"
    ],
    "title": "Classification of 1-super-transitive quantum subgroups in type A",
    "abstract": "We define a notion of super-transitivity for ètale algebra objects $A \\in \\mathcal{C}(\\mathfrak{sl}_N, k)$. This definition is a direct analogue of the notion of super-transitivity for subfactors, and measures at what depth the first ``new stuff'' appears in the category of $A$-modules internal to $\\mathcal{C}(\\mathfrak{sl}_N, k)$. Our main theorem gives a classification of all 1-super-transitive ètale algebra objects in $\\mathcal{C}(\\mathfrak{sl}_N, k)$ running over all $N,k \\in \\mathbb{N}$. Our classification captures all known infinite families of non-pointed ètale algebras in $\\mathcal{C}(\\mathfrak{sl}_N, k)$, and includes all but 16 of the known non-pointed ètale algebra objects in these categories. These remaining 16 known examples have super-transitivities between 2 and 4.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11406v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Ahmed Aberqi",
      "Ahmed Miloudi"
    ],
    "title": "Solving the Fisher nonlinear differential equations via Physics-Informed Neural Networks: A Comprehensive Retraining Study and Comparative Analysis with the Finite Difference Method",
    "abstract": "Physics-Informed Neural Networks (PINNs) represent a groundbreaking paradigm in scientific computing, seamlessly integrating the robust framework of deep learning with fundamental physical laws. This paper meticulously applies the standard PINN framework to solve the challenging one-dimensional nonlinear Fisher-KPP equation, a critical model in reaction-diffusion dynamics describing phenomena such as population spread and flame propagation. We detail a comprehensive methodology, encompassing the neural network architecture, the physics-informed loss function, and an in-depth investigation into retraining strategies aimed at optimizing model performance. Our approach is rigorously validated through a direct comparison of the PINN solution against both the known analytical solution and a numerical solution derived from the Finite Difference Method (FDM). Through this work, we elucidate the intricate balance between model complexity, training efficiency, and accuracy. Results highlight the PINN's remarkable capability in accurately approximating the solution to this complex PDE, while also shedding light on the critical aspects and challenges of model retraining, particularly concerning the optimizer's state. This study provides a thorough quantitative error analysis, demonstrating the efficacy of PINNs as a viable and competitive alternative to traditional numerical methods for solving nonlinear differential equations, and discusses their broader applications across various scientific domains.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11392v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Wing Hong Leung",
      "Mayank Pandey"
    ],
    "title": "The divisor function along sums of two biquadrates",
    "abstract": "We establish power saving asymptotics for the sum of the divisor function along a binary quartic form, improving on work of Daniel. The proof involves an application of a recent two dimensional delta method due to Li, Rydin-Myerson, and Vishe and an exploitation of $\\GL_2 $ automorphic forms arising from the factorization of varying cubic Dedekind zeta functions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11370v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Jesús A. Álvarez López",
      "Alejandro O. Majadas-Moure"
    ],
    "title": "New Applications and Computations of the Lefschetz Number of Homeomorphisms and Open Maps",
    "abstract": "We show that the combinatorial Lefschetz number is a topological invariant. This is an important result in itself; in order to point it out, we will also work here several relevant consequences in different directions. The first of them is a significant simplification of the computations involved in obtaining the Lefschetz number of certain maps, as well as some new Lefschetz fixed-point theorems for unbounded spaces. Indeed, these ideas allow us to obtain a clear lower bound for the Nielsen number of a triad in some spaces, such as, for example, the connected sum of two p-tori (p greater than 2). Another consequence, in the case of homeomorphisms, is that, in the classical axiomatic definition of the Lefschetz number, the wedge-of-circles axiom and the cofibration axiom can be replaced by the single axiom of topological invariance of the combinatorial Lefschetz number. Using the invariance of the combinatorial Lefschetz number we also generalize O'Neill's classical result about topological invariance of the fixed-point index and we prove a topological-invariance result for the relative Lefschetz number. We also generalize the combinatorial Lefschetz number from homeomorphisms to open maps and we obtain a new fixed-point theorem.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11356v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Huaian Diao",
      "Mourad Sini",
      "Ruixiang Tang"
    ],
    "title": "Elastic Calderón Problem via Resonant Hard Inclusions: Linearisation of the N-D Map and Density Reconstruction",
    "abstract": "We study an elastic Calderon-type inverse problem: recover the mass density $ρ(x)$ in a bounded domain $Ω\\subset\\mathbb{R}^3$ from the Neumann-to-Dirichlet map associated with the isotropic Lamé system $\\mathcal{L}_{λ,μ}u+ω^2ρ(x)u=0$. We introduce a constructive strategy that embeds a subwavelength periodic array of resonant high-density (hard) inclusions to create an effective medium with a uniform negative density shift. Specifically, we place a periodic cluster of inclusions of size $a$ and density $ρ_1\\asymp a^{-2}$ strictly inside $Ω$. For frequencies $ω$ tuned to an eigenvalue of the elastic Newton (Kelvin) operator of a single inclusion, we show that as $a\\to0$ and the number of inclusions $M\\to\\infty$, the Neumann-to-Dirichlet map $Λ_D$ converges to an effective map $Λ_{\\mathcal{P}}$ corresponding to a background density shift $-\\mathcal{P}^2$, with the operator norm estimate $\\|Λ_D-Λ_{\\mathcal{P}}\\|\\le Ca^α\\mathcal{P}^6$ for some $α>0$ determined by the geometric scaling. Around this negative background we derive a first-order linearization of $Λ_{\\mathcal{P}}$ in terms of $ρ$ and the Newton volume potential for the shifted Lamé operator. Testing the linearized relation with complex geometric optics solutions yields an explicit reconstruction formula for the Fourier transform of $ρ$, and hence a global density recovery scheme. The results provide a metamaterial-inspired analytic framework for inverse coefficient problems in linear elasticity and a concrete paradigm for leveraging nanoscale resonators in reconstruction algorithms.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11347v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Sebastian Arnold",
      "Eugenio Clerico"
    ],
    "title": "Optimal e-values for testing the mean of a bounded random variable against a composite alternative",
    "abstract": "We derive the unique e-values with optimal (relative) growth rate in the worst case for testing the mean of a bounded random variable, hereby contributing with the first application beyond the assumption of mutually absolutely continuous hypotheses of the (RE)GROW quality criteria for e-values originally proposed by Grünwald et al. (2024). For both criteria, we characterise explicitly the alternatives for which it is most difficult to test against, which also admit a meaningful interpretation. We give two important examples of interest where REGROW provides a powerful quality criterion to choose optimal e-variables whereas GROW leads to trivial solutions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11333v1",
    "categories": [
      "math.AP",
      "math.FA",
      "math.OC"
    ],
    "authors": [
      "Manuel Friedrich",
      "José Matias",
      "Elvira Zappale"
    ],
    "title": "Structured Deformations in Linearized Elasticity",
    "abstract": "We extend the theory of structured deformations to the setting of linearized elasticity by providing an integral representation for the underlying energy that features bulk and surface contributions. Our derivation is obtained both via a direct approach by means of a global method for relaxation in BD and via an approximation from nonlinear elastic energies associated to {nonsimple} materials.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11317v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Robbe Vermeiren"
    ],
    "title": "Constructing Orthonormal Rational Function Vectors with an application in Rational Approximation",
    "abstract": "We present two algorithms for constructing orthonormal bases of rational function vectors with respect to a discrete inner product, and discuss how to use them for a rational approximation problem. Building on the pencil-based formulation of the inverse generalized eigenvalue problem by Van Buggenhout et al.\\ (2022), we extend it to rational vectors of arbitrary length $k$, where the recurrence relations are represented by a pair of $k$-Hessenberg matrices, i.e., matrices with possibly $k$ nonzero subdiagonals. An updating algorithm based on similarity transformations using rotations and a Krylov-type algorithm related to the rational Arnoldi method are derived. The performance is demonstrated on the rational approximation of $\\sqrt{z}$ on $[0,1]$, where the optimal lightning + polynomial convergence rate of Herremans, Huybrechs, and Trefethen (2023) is successfully recovered. This illustrates the robustness of the proposed methods for handling exponentially clustered poles near singularities.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11373v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Pin-Jing Li",
      "Yu-Chih Huang"
    ],
    "title": "Polar Orbit Decoding: Universal Parallel Soft Decoding via Automorphism Orbits",
    "abstract": "Binary linear block codes (BLBCs) form the foundation of modern communication systems, yet no single code family simultaneously optimizes all performance aspects. This leads to the widely used multi-code architecture in the standard, significantly increasing the hardware complexity since multiple decoders are required in each piece of equipment. A universal decoding framework based on polar transformations has recently been proposed to unify BLBC decoding under polar-style decoders, but its parallelization has not yet been discussed. In this work, we propose Polar Orbit Decoding (POD), a universal parallel decoding framework for BLBCs. We identify that the automorphisms of BLBCs generate an orbit of permutations that induce diverse decoding trajectories with identical dynamic-frozen constraints after the polar transformations. By decoding over this automorphism orbit in parallel, POD achieves substantial latency-performance tradeoffs without requiring frozen-set readaptation or extra exhaustive permutation searches. Moreover, to enable efficient orbit traversal in the implementation, we represent the automorphism group in a base and strong generating set (BSGS) form using Schreier-Sims algorithms, making offline systematic computation accessible in polynomial time. Simulation results on extended BCH and extended Golay codes demonstrate that POD can achieve maximum-likelihood performance while significantly reducing the decoding latency compared to conventional successive cancellation list decoding.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11271v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Martin Ortiz"
    ],
    "title": "A de Rham weight part of Serre's conjecture and generalized mod $p$ BGG decompositions",
    "abstract": "We propose the use of de Rham cohomology of special fibers of Shimura varieties to formulate a geometric version of\n  the weight part of Serre's conjecture. We conjecture that this formulation is equivalent to the one using Serre weights and the étale cohomology of Shimura varieties.\n  We prove this equivalence for generic weights and generic non-Eisenstein eigensystems for a compact $U(2,1)$ Shimura variety such that $G_{\\mathbb{Q}_p}=GL_3$. We do this by proving\n  a generic concentration in middle degree of mod $p$ de Rham cohomology with coefficients.\n  In turn, we prove this generic concentration by constructing generalized mod $p$ BGG decompositions for de Rham cohomology. After applying the results\n  from our companion paper, this reduces to computing some BGG-like resolutions\n  in a certain mod $p$ version of category $\\mathcal{O}$, which is the main content\n  of the article.\n  In the $GSp_4$ case we also compute some explicit BGG decompositions, and assuming the generic concentration in middle degree of de Rham cohomology\n  we obtain an improvement on the main result of arxiv:2410.09602.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11240v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Angelo El Saliby"
    ],
    "title": "Highly regular vertex-transitive graphs are globally rigid",
    "abstract": "A graph is said to be globally rigid in $d$-dimensional space if almost all of its embeddings are unique up to isometries. If a graph has enough automorphisms to send any of its vertices into any other, then it is called vertex-transitive. We show that, in any dimension, highly regular vertex-transitive graphs are globally rigid, positively answering a conjecture of Sean Dewar. Furthermore, we construct examples that show that our constant for regularity is best possible.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11216v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Bernard Bercu",
      "Stefano Favaro"
    ],
    "title": "A Gaussian process limit for the self-normalized Ewens-Pitman process",
    "abstract": "For an integer $n\\geq1$, consider a random partition $Π_{n}$ of $\\{1,\\ldots,n\\}$ into $K_{n}$ partition sets with $K_{r,n}$ partition subsets of size $r=1,\\ldots,n$, and assume $Π_{n}$ distributed according to the Ewens-Pitman model with parameters $α\\in]0,1[$ and $θ>-α$. Although the large-$n$ asymptotic behaviors of $K_{n}$ and $K_{r,n}$ are well understood in terms of almost sure convergence and Gaussian fluctuations, much less is known about the asymptotic behavior of $P_{r,n}=K_{r,n}/K_n$ and of the self-normalized Ewens-Pitman process $(P_{1,n},P_{2,n},\\dots)$. Motivated by the almost sure convergence of $(P_{1,n},P_{2,n},\\dots)$ to the Sibuya distribution $p_α=(p_α(1),p_α(2),\\ldots)$, where $p_α(r)$ is the probability mass at $r=1,2,\\ldots$, we establish the $\\ell^{2}$ distributional convergence \\begin{displaymath} \\sqrt{K_{n}}((P_{1,n},\\,P_{2,n},\\ldots)-p_α)\\underset{n\\rightarrow+\\infty}{\\overset{\\cL}{\\longrightarrow}}\\mathcal{G}(Γ_α), \\end{displaymath} where $\\mathcal{G}(Γ_α)$ stands for a centered Gaussian process with covariance matrix $Γ_α=diag(p_α) - p_α p_α^T$. We apply our result to the estimation of the parameter",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11512v1",
    "categories": [
      "math.RT",
      "math.CT",
      "math.RA"
    ],
    "authors": [
      "Shantanu Sardar"
    ],
    "title": "Krull-Gabriel dimension of Skew group algebras",
    "abstract": "For an algebraically closed field K, let G be a finite abelian group of K-linear automorphisms of a finite-dimensional algebra A and AG is the associated skew group algebra. The author with S. Trepode and A. G. Chaio introduced the notion of a Galois semi-covering functor to study the irreducible morphisms over skew group algebras. In this paper, we establish a Galois semi-covering functor between the morphism categories as well as the functor categories over the algebras A and AG and prove that their Krull-Gabriel dimension are equal. This computation confirms Prests conjecture on the finiteness of Krull-Gabriel dimension and Schroers conjecture on its connection with the stable rank (the least stabilized radical power) over skew gentle algebras. Moreover, we determine all posible stable ranks for (skew) Brauer graph algebras.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11483v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Lukas Vierus",
      "Thomas Schuster",
      "Bernadette Hahn"
    ],
    "title": "Tensor field tomography with attenuation and refraction: adjoint operators for the dynamic case and numerical experiments",
    "abstract": "This article is concerned with tensor field tomography in a fairly general setting, that takes refraction, attenuation and time-dependence of tensor fields into account. The mathematical model is given by attenuated ray transforms of the fields along geodesic curves corresponding to a Riemannian metric that is defined by the index of refraction. The data are given at the boundary tangent bundle of the domain and it is well-known that they can be characterized as boundary data of a transport equation turning tensor field tomography into an inverse source problem. This way the adjoint of the forward mapping can be computed using the integral representation or, equivalently, associated to a dual transport equation. The article offers and proves two different representations for the adjoint mappings both in the dynamic and static case. The numerical implementation is demonstrated and evaluated for static fields using the damped Landweber method with Nesterov acceleration applied to both, the integral and PDE-based formulations. The transport equations are solved using a viscosity approximation. The error analysis reveals that the integral representation significantly outperforms PDE-based methods in terms of computational efficiency while achieving comparable reconstruction accuracy. The impact of noise and deviations from straight-line trajectories are investigated confirming improved accuracy if refraction is taken into account. We conclude that the inclusion of refraction to the forward model pays in spite of increased numerical cost.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11482v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Benjamin Hutz"
    ],
    "title": "A Genetic Algorithm for Generating Extreme Examples in Arithmetic Dynamics",
    "abstract": "We describe a genetic algorithm to find extreme examples in the arithmetic of dynamical systems. The algorithm is applied to four problems: small (non-zero) canonical heights, many rational preperiodic points, long rational cycles, and long rational tails. Data is provided for extreme examples generated for polynomials up to degree 13 and rational functions up to degree 5. This work significantly expands the known examples of extreme behavior for several of the conjectured behaviors in arithmetic dynamics and provides a foundation from which to begin a more advanced application of machine learning techniques in the creation of extreme examples for arithmetic dynamics.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11462v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Anik Kumar Paul",
      "Karthik Shenoy",
      "Arun D. Mahindrakar"
    ],
    "title": "Stochastic Recursive Inclusions under Biased Perturbations: An Input-to-State Stability Perspective",
    "abstract": "This paper investigates the asymptotic behavior of stochastic recursive inclusions in the presence of non-zero, non-diminishing bias, a setting that frequently arises in zeroth-order optimization, stochastic approximation with iterate-dependent noise, and distributed learning with adversarial agents. The analysis is conducted through the lens of input-to-state stability of an associated differential inclusion, which serves as the continuous-time limit of the discrete recursion. We first establish that if the limiting differential inclusion is input-to-state stable and the iterates remain almost surely bounded, then the iterates converge almost surely to the neighborhood of desired equilibrium. We then provide a verifiable sufficient condition for almost sure boundedness by assuming that the underlying operator is single-valued and globally Lipschitz. Finally, we show that several zeroth-order variants of stochastic gradient naturally fit within this framework, and we demonstrate their input-to-state stability under standard conditions. Overall, the results provide a unified theoretical foundation for studying almost sure convergence of biased stochastic approximation schemes through the Input to State stability theory of differential inclusions.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11395v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Alberto Domínguez Corella",
      "Onésimo Hernández-Lerma"
    ],
    "title": "The maximum principle for discrete-time control systems and applications to dynamic games",
    "abstract": "We study deterministic nonstationary discrete-time optimal control problems in both finite and infinite horizon. With the aid of Gateaux differentials, we prove a discrete-time maximum principle in analogy with the well-known continuous-time maximum principle. We show that this maximum principle, together with a transversality condition, is a necessary condition for optimality; we also show that it is sufficient under additional hypotheses. We use Gateaux differentials as a natural setting to derive first-order conditions. Additionally, we use the discrete-time maximum principle to derive the discrete-time Euler equation and to characterize Nash equilibria for discrete-time dynamic games.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11306v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Dimitry Gurevich",
      "Pavel Saponov",
      "Mikhail Zaitsev"
    ],
    "title": "Representations of Spectrum of GL(m) type Quantum Matrices",
    "abstract": "In the present paper we are dealing with reflection equation algebras ${\\cal L}(R)$ corresponding to even skew-invertible Hecke symmetries. Our main result consists in computing the characters of the spectral values of the generating matrix $L$ of ${\\cal L}(R)$ in finite-dimensional representations labeled by partitions of integers. As is known, the spectral values belong to an algebraic extension of the center of the reflection equation algebra and elements of the center can be presented as symmetric functions in spectral values. As an application of our approach, we calculate the characters of the power sums $\\mathrm{Tr}_R(L^n)$ in the mentioned finite dimensional representations.\n  In a particular case of the Drinfeld-Jimbo $R$-matrix the enveloping algebra $U(gl(N))$ can be obtained as a specific limit of the reflection equation algebra. In this limit our results for power sums coincide with the those obtained in [PP].",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11291v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Guoying Zhang",
      "Qingqing Wu",
      "Ziyuan Zheng",
      "Qiaoyan Peng",
      "Yanze Zhu",
      "Wen Chen",
      "Penghui Huang"
    ],
    "title": "Joint Antenna Rotation and IRS Beamforming for Multi-User Uplink Communications",
    "abstract": "Rotatable antenna (RA) enhances wireless coverage through directional gain steering, yet suffers from performance degradation under physical blockages. Intelligent reflecting surface (IRS) establishes reflective paths to bypass obstacles, but suffers from angular mismatch when deployed in the side-lobe region of base station (BS) antennas. To address this issue, we propose a new RA-enabled IRS-assisted multi-user uplink system, in which the BS antennas are capable of flexibly adjusting their 3D orientations to align their boresights with the IRS. We formulate a sum rate maximization problem by jointly optimizing the antenna 3D rotations, receive beamforming and IRS phase shifts. To tackle this non-convex problem, we propose an efficient alternating optimization (AO) algorithm. Specifically, we iteratively update the antenna rotations via projected gradient ascent (PGA), compute the receive beamforming via a closed-form solution, and optimize the IRS phase shifts via fractional programming (FP). Numerical results demonstrate that the proposed system yields significant performance gains over conventional fixed-antenna systems, especially under large angular misalignments.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11281v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Nana Han",
      "Siheng Chen",
      "Qingguo Li"
    ],
    "title": "S*-well-filtered spaces and d*-spaces",
    "abstract": "Recently, Xu proposed a strongly well-filtered space in [24] and systematically investigated some of its properties and characterizations. In this paper, we introduce a new class of T0-spaces called S*-well-filtered spaces, which is strictly larger than the class of strongly well-filtered spaces. First, we establish some connections among S*-well-filtered spaces, d*-spaces and weak well-filtered spaces. Then it is demonstrated that for any dcpo P, the Scott space ΣP is a d*-space if and only if it is S*-well-filtered. Furthermore, some basic properties of S*-well-filtered spaces are discussed. We prove that if Y is an S*-well-filtered space, the function space TOP(X,Y) equipped with the Isbell topology may not be an S*-well-filtered space. Finally, we study the S*-well-filteredness of Smyth power spaces. In addition, Johnstone's non-sober dcpo example is shown to be S*-well-filtered yet it is not strongly well-filtered, thereby establishing an obvious distinction between these two classes of dcpos.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11246v1",
    "categories": [
      "math.CO",
      "math.AC",
      "math.AG"
    ],
    "authors": [
      "Tara Fife",
      "Eline Mannino",
      "Felipe Rincón"
    ],
    "title": "The rank-nullity ring of a matroid",
    "abstract": "We introduce the rank-nullity ring of a matroid $M$, which is a subring of the Chow ring of the permutahedral toric variety. This subring contains the tautological Chern classes of $M$, a fact we deduce from a highly symmetric formula for these classes. When the matroid $M$ is a uniform matroid, the rank-nullity ring coincides with the subring of $S_n$-invariants of the Chow ring of the permutahedral toric variety. In this case, we compute its Hilbert function explicitly and provide a Gröbner basis for the ideal of relations among its generators.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11241v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alexander Quaas",
      "Erwin Topp"
    ],
    "title": "Ergodic pairs for fractional Hamilton-Jacobi equations on bounded domains: large solutions",
    "abstract": "In this article, we study the ergodic problem associated to viscous Hamilton-Jacobi equation where the diffusion is governed by the censored fractional Laplacian, a nonlocal elliptic operator restricted to a bounded domain $Ω\\subset \\mathbb{R}^N$. We restrict ourselves to the case in which the nonlinear gradient term has a scaling less or equal than the fractional order of the diffusion. In similarity to its second-order counterpart, we provide existence of ergodic pairs involving solutions that blow-up on $\\partial Ω$. We use the celebrated vanishing discount method, where the analysis of the approximated solutions have its own interest, leading to qualitative properties for the ergodic problem such as precise blow-up rates for the solution and characterization of the ergodic constant. The main difficulties arise from the state-dependency of the operator, from which the arguments of the local case based on well-known invariance properties of the Laplacian are not longer at disposal.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11226v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Bernhard Heim und Markus Neuhauser"
    ],
    "title": "Polynomization of Sun's Conjecture",
    "abstract": "Let $p(n)$ denote the number of partitions of a natural number $n$. As $ n \\to \\infty$, the $n$th root of $p(n)$ tends to $1$, which is related to the Cauchy--Hadamard test for power series. Andrews also discovered an elementary proof. Sun conjectured that this happens in a certain way for $n\\geq 6$: \\begin{equation*} \\sqrt[n]{p(n)} > \\sqrt[n+1]{p(n+1)}. \\end{equation*} The conjecture was proved by Wang and Zhu; shortly thereafter, Chen and Zheng independently obtained a second proof. In this paper, we follow an approach by Rota. We consider $p(n)$ as special values of the D'Arcais polynomials, known as the Nekrasov--Okounkov polynomials. This identifies Sun's conjecture as a property of the largest real zero of certain polynomials. This leads to results towards $k$-coloured partitions, overpartitions, and plane partitions. Moreover, we also consider Chebyshev and Laguerre polynomials. The main purpose of this paper is to offer a uniform approach.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11225v1",
    "categories": [
      "math.FA",
      "math-ph"
    ],
    "authors": [
      "Sergiusz Kużel",
      "Piotr Łukasiewicz"
    ],
    "title": "Operators and POVMs generated by Parseval frames",
    "abstract": "Let $F$ be a Parseval frame in a Hilbert space\n  and let $E$ be a set of real numbers. From these data, we construct an operator $H_{E,e}$ and a positive operator-valued measure (POVM) $F_{E,e}$. This paper investigates in detail the relationship between the operator $H_{E, e}$ and the POVM $F_{E,e}$. Our results extend the classical correspondence between a self-adjoint operator generated by an orthonormal basis and its associated projection-valued (spectral) measure.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11511v1",
    "categories": [
      "math.OA",
      "cond-mat.str-el",
      "math-ph"
    ],
    "authors": [
      "Danilo Polo Ojito",
      "Emil Prodan"
    ],
    "title": "On a C*-Diagonal Generated by the Toric Code",
    "abstract": "We study the abelian sub-C*-algebra of the CAR algebra generated by the start and face opertors of Kitaev's toric code. We show that it is a C*-diagonal equivalent to the canonical diagonal of the CAR algebra.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11498v1",
    "categories": [
      "cs.IT",
      "cs.NI",
      "eess.SP",
      "quant-ph"
    ],
    "authors": [
      "Alptug Aytekin",
      "Mohamed Nomeir",
      "Lei Hu",
      "Sennur Ulukus"
    ],
    "title": "Convergence Properties of Good Quantum Codes for Classical Communication",
    "abstract": "An important part of the information theory folklore had been about the output statistics of codes that achieve the capacity and how the empirical distributions compare to the output distributions induced by the optimal input in the channel capacity problem. Results for a variety of such empirical output distributions of good codes have been known in the literature, such as the comparison of the output distribution of the code to the optimal output distribution in vanishing and non-vanishing error probability cases. Motivated by these, we aim to achieve similar results for the quantum codes that are used for classical communication, that is the setting in which the classical messages are communicated through quantum codewords that pass through a noisy quantum channel. We first show the uniqueness of the optimal output distribution, to be able to talk more concretely about the optimal output distribution. Then, we extend the vanishing error probability results to the quantum case, by using techniques that are close in spirit to the classical case. We also extend non-vanishing error probability results to the quantum case on block codes, by using the second-order converses for such codes based on hypercontractivity results for the quantum generalized depolarizing semi-groups.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11472v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Elena Caviglia",
      "Zurab Janelidze",
      "Luca Mesiti"
    ],
    "title": "Comonadic approach to pretorsion theories",
    "abstract": "We present a comonadic approach to pretorsion theories on semiexact categories, i.e. categories equipped with a closed ideal of null morphisms that admits all kernels and all cokernels. We first prove that bihereditary pretorsion theories are comonadic in a 2-dimensional sense over the 2-category of semiexact categories with naturally chosen 1-cells. We then extend the built pseudo-comonad to guarantee that all pretorsion theories are pseudo-coalgebras. But interestingly, not all pseudo-coalgebras are pretorsion theories. Rather, pseudo-coalgebras give a generalized notion of pretorsion theory.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11445v1",
    "categories": [
      "math.PR",
      "math.OC"
    ],
    "authors": [
      "Juan Guillermo Garrido",
      "Nabil Kazi-Tani",
      "Emilio Vilches"
    ],
    "title": "Stochastic Perturbation of Sweeping Process for Uniformly Prox-Regular Moving Sets",
    "abstract": "In this paper, we study the existence of solutions to a sweeping process in the presence of stochastic perturbations, where the moving set takes uniformly prox-regular values and varies continuously with respect to the Hausdorff distance, without smoothness assumptions. We consider several geometric assumptions and establish important relationships between them.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11420v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Yulei You",
      "Junyi Liu"
    ],
    "title": "Statistical Robustness of Interval CVaR Based Regression Models under Perturbation and Contamination",
    "abstract": "Robustness under perturbation and contamination is a prominent issue in statistical learning. We address the robust nonlinear regression based on the so-called interval conditional value-at-risk (In-CVaR), which is introduced to enhance robustness by trimming extreme losses. While recent literature shows that the In-CVaR based statistical learning exhibits superior robustness performance than classical robust regression models, its theoretical robustness analysis for nonlinear regression remains largely unexplored. We rigorously quantify robustness under contamination, with a unified study of distributional breakdown point for a broad class of regression models, including linear, piecewise affine and neural network models with $\\ell_1$, $\\ell_2$ and Huber losses. Moreover, we analyze the qualitative robustness of the In-CVaR based estimator under perturbation. We show that under several minor assumptions, the In-CVaR based estimator is qualitatively robust in terms of the Prokhorov metric if and only if the largest portion of losses is trimmed. Overall, this study analyzes robustness properties of In-CVaR based nonlinear regression models under both perturbation and contamination, which illustrates the advantages of In-CVaR risk measure over conditional value-at-risk and expectation for robust regression in both theory and numerical experiments.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11334v1",
    "categories": [
      "cs.IT",
      "cs.LG"
    ],
    "authors": [
      "Deborah Pereg"
    ],
    "title": "Information Theoretic Perspective on Representation Learning",
    "abstract": "An information-theoretic framework is introduced to analyze last-layer embedding, focusing on learned representations for regression tasks. We define representation-rate and derive limits on the reliability with which input-output information can be represented as is inherently determined by the input-source entropy. We further define representation capacity in a perturbed setting, and representation rate-distortion for a compressed output. We derive the achievable capacity, the achievable representation-rate, and their converse. Finally, we combine the results in a unified setting.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11294v1",
    "categories": [
      "math.OC",
      "math.PR"
    ],
    "authors": [
      "Antonio Ocello"
    ],
    "title": "Controlled Interacting Branching Diffusion Processes: A Viscosity Approach",
    "abstract": "We study optimal control problems for interacting branching diffusion processes, a class of measure-valued dynamics capturing both spatial motion and branching mechanisms. From the perspective of the dynamic programming principle, we establish a rigorous connection between the control problem and an infinite system of coupled Hamilton--Jacobi--Bellman (HJB) equations, obtained through a bijection between admissible particle configurations and the disjoint topological union of countable Euclidean spaces. Under natural coercivity conditions on the cost functionals, we show that these growth conditions transfer to the value function and yield a viscosity characterization in the class of functions satisfying the same bounds. We further prove a comparison principle, which allows us to fully characterize the control problem through the associated HJB equation. Finally, we show that the problem simplifies in the mean-field regime, where the model coefficients exhibit symmetry with respect to the indices of the individuals in the population. This permutation invariance allows us to restrict attention to a reduced class of symmetric admissible controls, a reduction established by combining the viscosity characterization of the value function with measurable selection arguments.",
    "date": "01-19"
  },
  {
    "link": "https://arxiv.org/pdf/2601.11278v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Chufeng Nien",
      "Chenyan Wu"
    ],
    "title": "Associated Representations of finite pattern groups",
    "abstract": "In this paper, we consider the construction of irreducible representations of finite pattern groups in terms of Panov's associative polarization, which is a finite-field analogue of Kirillov's orbital method. Using this construction, first, we are able to classify the irreducible representations of the unipotent radical of the standard parabolic subgroups of $\\mathrm{GL}_n$ with 4 parts; second, we can parameterize irreducible characters of degree $q$ in terms of coadjoint orbits of cardinality $q^2$, for any finite pattern groups $G$ over $\\mathbb{F}_q,$ where $\\mathbb{F}_q$ is a finite field with $q$ elements.",
    "date": "01-19"
  }
]