[
  {
    "link": "https://arxiv.org/pdf/2602.05489v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Kevin Kurian Thomas Vaidyan",
      "Michael P. Friedlander",
      "Ahmet Alacaoglu"
    ],
    "title": "Convergence Rate of the Last Iterate of Stochastic Proximal Algorithms",
    "abstract": "We analyze two classical algorithms for solving additively composite convex optimization problems where the objective is the sum of a smooth term and a nonsmooth regularizer: proximal stochastic gradient method for a single regularizer; and the randomized incremental proximal method, which uses the proximal operator of a randomly selected function when the regularizer is given as the sum of many nonsmooth functions. We focus on relaxing the bounded variance assumption that is common, yet stringent, for getting last iterate convergence rates. We prove the $\\widetilde{O}(1/\\sqrt{T})$ rate of convergence for the last iterate of both algorithms under componentwise convexity and smoothness, which is optimal up to log terms. Our results apply directly to graph-guided regularizers that arise in multi-task and federated learning, where the regularizer decomposes as a sum over edges of a collaboration graph.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05054v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Oğuz Han Altıntaş",
      "Hamdullah Yücel"
    ],
    "title": "An Adaptive Framework for Robust Structural Shape Optimization under Uncertainty",
    "abstract": "This work proposes an adaptive framework to solve a robust structural shape optimization problem governed by linear elasticity models that account for uncertainties in the loading and material inputs. A posteriori error estimators are constructed to adjust the sample size, mesh size, and step length. The size of the sample set in the stochastic gradient approximation is dynamically determined depending on the variance of the shape derivative. When constructing the a posteriori error estimator in the physical domain, errors arising from the discretization of the deformation bilinear form, which provides a descent direction, are considered, in addition to errors from the discretization of the linear elasticity system. The step length in gradient-based optimization is also adaptively adjusted by estimating the Lipschitz constant of the stochastic shape derivative. Moreover, an analysis of the existence and distributed-form derivation of the stochastic shape derivative is provided. Finally, the proposed estimation-based adaptive stochastic optimization framework is validated on leg-like structural components, demonstrating its effectiveness in minimizing touchdown compliance under uncertain contact forces.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.04993v1",
    "categories": [
      "math.DS",
      "math-ph"
    ],
    "authors": [
      "Krzysztof Frączek",
      "Łukasz Kotlewski"
    ],
    "title": "A surprising discrepancy in the regularity of conjugacies between generalized interval exchange transformations and their inverses at freezing",
    "abstract": "Generalized interval exchange transformations (GIETs) are semi-conjugate to interval exchange transformations (IETs) when the Rauzy-Veech combinatorics is $\\infty$-complete. When this semi-conjugacy is a homeomorphism, a fundamental problem is to understand the regularity of the conjugacy and its inverse. Contrary to the usual expectation that their Hölder regularities degenerate simultaneously, we exhibit a strongly asymmetric behavior. For self-similar IETs of hyperbolic periodic type and a natural one-parameter central family of affine IET deformations obtained via a freezing (zero-temperature) limit, the conjugacy becomes arbitrarily irregular while its inverse remains uniformly Hölder. Using thermodynamic formalism for renormalization and zero-temperature limits, we obtain sharp asymptotics for Hausdorff dimensions of invariant and conformal measures and for the supremal Hölder exponents of the conjugacy and its inverse.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.04984v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Fabio Ciccarelli",
      "Fabio Furini",
      "Christopher Hojny",
      "Marco Lübbecke"
    ],
    "title": "Branch-and-price strikes back for the k-vertex cut problem",
    "abstract": "Given an undirected graph, the k-vertex cut problem (k-VCP) asks for a minimum-cost set of vertices whose removal yields at least k connected components in the resulting graph. The k-VCP is an important problem in network optimization, with applications in infrastructure protection and epidemic containment. We present a new extended integer linear programming (ILP) formulation that unifies and strengthens existing models and serves as the foundation for a new branch-and-price algorithm for the k-VCP. An in-depth theoretical study enables us to devise algorithmic components such as tailored branching rules that preserve the structure of the pricing problems, as well as valid inequalities and symmetry-handling techniques. We also show that our new model dominates all previous ILP formulations of the k-VCP in terms of their linear relaxations, which theoretically justifies the computational effectiveness of our approach. Extensive computational experiments against state-of-the-art methods demonstrate substantially improved performance, both in terms of instances solved to proven optimality and running times. On the full benchmark of 608 instances, our algorithm consistently outperforms all competitors and is able to solve 73 previously unsolved instances within the time limit of one hour.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05652v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Torben Grabbel",
      "Gebhard Martin",
      "Giacomo Mezzedimi",
      "Maia Raitz von Frentz",
      "Paul Jakob Schmidt"
    ],
    "title": "On symmetries of hyperbolic lattices of large rank",
    "abstract": "For an even, integral hyperbolic lattice $L$, the symmetry group of $L$ is the quotient of the group of isometries of $L$ by the Weyl subgroup of $(-2)$-reflections. Following Nikulin, the exceptional lattice of $L$ is defined as the sublattice generated by elements that have finite orbit under the symmetry group of $L$. We prove that every hyperbolic lattice of rank at least $46$ has trivial exceptional lattice. In particular, every such lattice admits a symmetry of maximal Salem degree.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05643v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Marius Leonhardt",
      "Martin Lüdtke"
    ],
    "title": "Affine Chabauty II",
    "abstract": "We present an algorithm for determining the set of $S$-integral points on an affine curve based on the Affine Chabauty method developed in the first part of this series. We achieve this by constructing explicit logarithmic differentials whose integrals take on prescribed values on $S$-integral points. Along the way, we prove a $p$-adic residue theorem for Coleman integrals of log differentials.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05642v1",
    "categories": [
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "Carlos Mudarra"
    ],
    "title": "The sharp Whitney extension theorem for convex $C^1$ Lipschitz functions",
    "abstract": "For an arbitrary set $E \\subset \\mathbb{R}^n$, and functions $f:E \\to \\mathbb{R}$, $G: E\\to \\mathbb{R}^n$ with $G$ bounded, we construct $C^1(\\mathbb{R}^n)$ convex extensions $(F, \\nabla F)$ of $(f,G)$ with the sharp Lipschitz constant\n  $$\n  \\mathrm{Lip}(F) = \\sup_{x\\in E} |G(x)|,\n  $$\n  provided that $(f,G)$ satisfies the pertinent necessary and sufficient conditions for $C^1$ convex, and Lipschitz extendability. Also, these extensions can be constructed with prescribed global behavior in terms of directions of coercivity.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05634v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Feng-Yu Wang",
      "Qiumiao Wen",
      "Fen-Fen Yang"
    ],
    "title": "Regularity Estimates for Singular Density Dependent SDEs",
    "abstract": "Consider the density dependent (i.e. Nemytskii-type) SDEs on $\\mathbb R^d$, where the drift $b_t(x,ρ(x),ρ)$ is locally integrable in $(t,x)\\in [0,\\infty)\\times \\mathbb R^d$ and may be singular in the distribution density function $ρ$. The relative/Renyi entropies between two time-marginal distributions are estimated by using the Wasserstein distance of initial distributions. When $d=1$ and $b_t$ decays at $t=0$ with rate $t^{\\frac 1 2+}$, our the relative entropy estimate coincides with the classical entropy-cost inequality for elliptic diffusion processes. To estimate the Renyi entropy, a refined Khasminskii estimate is presented for singular SDEs which may be interesting by itself.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05631v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Linshuo Jiang",
      "Nachuan Xiao",
      "Xin Liu"
    ],
    "title": "A Smooth Locally Exact Penalty Method for Optimization Problems over Generalized Stiefel Manifolds",
    "abstract": "In this paper, we consider a class of optimization problems constrained to the generalized Stiefel manifold. Such problems are fundamental to a wide range of real-world applications, including generalized canonical correlation analysis, linear discriminant analysis, and electronic structure calculations. Existing works mainly focuses on cases where the generalized orthogonality constraint is induced by a symmetric positive definite matrix M, a setting where the geometry essentially reduces to that of the standard Stiefel manifold. However, many practical scenarios involve a singular M, which introduces significant analytical and computational challenges. Therefore, we propose a Smooth Locally Exact Penalty model (SLEP) and establish its equivalence to the original problem in the aspect of stationary points under a finitly large penalty parameter. This penalty model admits the direct application of various unconstrained optimization techniques, with convergence guarantees inherited from established results. Compared to Riemannian optimization approaches, our proposed penalty mode eliminates the need for retractions and vector transports, hence significantly reducing per-iteration computational costs. Extensive numerical experiments validate our theoretical results and demonstrate the effectiveness and practical potential of the proposed penalty model SLEP.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05622v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Taha El Bakkali",
      "El Mahdi Chayti",
      "Omar Saadi"
    ],
    "title": "Nonsmooth Optimization with Zeroth Order Comparison Feedback",
    "abstract": "We study unconstrained optimization problems of nonsmooth, nonconvex Lipschitz functions, using only noisy pairwise comparisons governed by a known link function. Our goal is to compute a $(δ,\\varepsilon)$-Goldstein stationary point. We combine randomized smoothing with a novel unbiased reduction from comparisons to local value differences. By leveraging a Russian-roulette truncation on the Bernoulli-product expansion of the inverse link, we construct an exactly unbiased estimator for directional differences. This estimator has finite expected cost and variance scaling quadratically with the function gap, $\\mathcal{O}(B^2)$, under mild conditions. Plugging this into the smoothed gradient identity enables a standard nonconvex SGD analysis, yielding explicit comparison-complexity bounds for common symmetric links such as logistic, probit, and cauchit.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05614v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Michael Revers"
    ],
    "title": "A new improved explicit estimate for $ζ\\left( 1/2+it\\right)$",
    "abstract": "In this paper, we present an improved explicit subconvexity result for the Riemann zeta function $ζ\\left( s\\right)$ along the critical line $s=1/2+it$, given by Hiary, Patel and Yang in 2024. This new bound is derived by combining a refined, explicit version of the van der Corput method together with computational calculations.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05589v1",
    "categories": [
      "math.NA",
      "math.FA"
    ],
    "authors": [
      "Sachin Saini"
    ],
    "title": "Taylor-Accelerated Neural Network Interpolation Operators on Irregular Grids with Higher Order Approximation",
    "abstract": "In this paper, a new class of \\emph{Taylor-accelerated neural network interpolation operators} is introduced on quasi-uniform irregular grids. These operators improve existing neural network interpolation operators by incorporating Taylor polynomials at the sampling nodes, thereby exploiting the higher smoothness of the target function. The proposed operators are shown to be well defined, uniformly bounded, and to satisfy an exact interpolation property at the grid points. In addition, polynomial reproduction up to a prescribed degree is established. Direct approximation estimates are derived in terms of higher-order moduli of smoothness, yielding enhanced convergence rates for sufficiently smooth functions. Numerical experiments are presented to support the theoretical analysis and to demonstrate the significant accuracy improvement achieved through the Taylor-accelerated construction. In particular, higher-order convergence on irregular grids is obtained, and the proposed approach outperforms existing neural network interpolation operators on irregular partitions, including Lagrange-based schemes.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05531v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Ahmet Alacaoglu",
      "Jun-Hyun Kim"
    ],
    "title": "Solving Stochastic Variational Inequalities without the Bounded Variance Assumption",
    "abstract": "We analyze algorithms for solving stochastic variational inequalities (VI) without the bounded variance or bounded domain assumptions, where our main focus is min-max optimization with possibly unbounded constraint sets. We focus on two classes of problems: monotone VIs; and structured nonmonotone VIs that admit a solution to the weak Minty VI. The latter assumption allows us to solve structured nonconvex-nonconcave min-max problems. For both classes of VIs, to make the expected residual norm less than $\\varepsilon$, we show an oracle complexity of $\\widetilde{O}(\\varepsilon^{-4})$, which is the best-known for constrained VIs. In our setting, this complexity had been obtained with the bounded variance assumption in the literature, which is not even satisfied for bilinear min-max problems with an unbounded domain. We obtain this complexity for stochastic oracles whose variance can grow as fast as the squared norm of the optimization variable.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05438v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Derong Kong",
      "Dantong Pu"
    ],
    "title": "Phase transitions on periodic orbits in $β$-transformation with a hole at zero",
    "abstract": "Given $β\\in(1,2]$, let $T_β: [0,1)\\to[0,1);~x\\mapstoβx\\pmod 1$. For $m\\in\\mathbb N$ let\n  \\[\n  τ_m(β):=\\sup\\left\\{t\\in[0,1): K_β(t)\\textrm{ {contains a periodic orbit} of smallest period }m \\right\\},\n  \\]\n  where $K_β(t)=\\{x\\in[0,1): T_β^n(x)\\notin(0,t)~\\forall n\\ge 0\\}$ is the survivor set of the open dynamical system $(T_β, [0,1), H)$ with a hole $H=(0,t)$. In this paper we give a complete characterization of $τ_m$, and show that $τ_m$ is piecewise continuous with precisely $ψ(m)$ discontinuity points, where $ψ(m)$ is the number of bulbs of period $m$ in the Mandelbrot set. To describe the critical value function $τ_m$ we construct a finite butterfly tree $\\mathcal T_m$, from which we are able to determine the discontinuity points and the analytic formula of $τ_m$ based on Farey words and substitution operators. As a by product, we characterize the extremal Lyndon words and extremal Perron words. Since we are working in the symbolic space, our result can be applied to study phase transitions for periodic orbits in topologically expansive Lorenz maps, doubling map with an asymmetric hole, intermediate $β$-transformations, unique expansions in double bases, and so on.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05433v1",
    "categories": [
      "math.DS",
      "math.AC",
      "math.AG",
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "J. Rogelio Pérez-Buendía"
    ],
    "title": "Rational Interpreters for Discrete Dynamics: Existence, Exactness, and Decomposition over $p$-adic Fields",
    "abstract": "We address an inverse problem in non-Archimedean dynamics: given a finite discrete dynamical system (equivalently, a functional graph on $N$ states), construct a continuous $p$-adic dynamical system whose residue-level behavior reproduces the prescribed transitions. Using the cylinder partition of $\\mathcal{O}_K$ (viewed as \\emph{Witt cylinders} for unramified $K/\\mathbb{Q}_p$), we encode states by pairwise disjoint closed balls and formalize an \\textbf{interpreter} as a map sending each state ball into its target ball.\n  Our main existence result constructs rational interpreters that are analytic (hence pole-free) on the prescribed state cylinders, combining rigid-analytic Runge approximation with finite interpolation constraints. Under a linear-dominance condition on each cylinder, ball images are explicit and locally affine, leading to a robust classification of discrete behavior into contractive, indifferent, and expansive regimes. Good reduction provides a selection principle for natural interpreters; effective degree and height bounds for general rational interpreters remain open.\n  For composite alphabets we prove a \\textbf{Dynamic Chinese Remainder Theorem} for congruence-preserving systems: the CRT isomorphism $Θ:\\mathbb{Z}/m\\mathbb{Z}\\xrightarrow{\\sim}\\prod_i\\mathbb{Z}/p_i^{k_i}\\mathbb{Z}$ (for $m=\\prod p_i^{k_i}$) yields a factorization of the \\emph{dynamics} (equivalently, the functional graph) on $\\mathbb{Z}/m\\mathbb{Z}$ into dynamics on the prime-power components, compatible with reduction. Finally, we discuss an inverse-limit (profinite) extension: compatible towers define a $1$-Lipschitz map on $\\mathbb{Z}_p$, while selecting compatible analytic/rational interpreters across levels becomes a separate problem.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05412v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Rhys J. Evans",
      "Sergey Goryainov",
      "Grigory Ryabov",
      "Da Zhao"
    ],
    "title": "On Neumaier Cayley graphs",
    "abstract": "In the present paper, we study Neumaier Cayley graphs. First, we give a criterion for a Cayley graph to be a Neumaier graph with a spread given by the cosets of a subgroup. Further, we construct a new infinite family of Neumaier Cayley graphs of unbounded nexus. Finally, we provide an algorithm for enumerating Neumaier Cayley graphs and computational results obtained by this algorithm.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05254v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Cassie Grace",
      "José Felipe Voloch"
    ],
    "title": "Algebraic capsets",
    "abstract": "Capsets are subsets of $\\mathbb{F}_3^n$ with no three points on a line and a capset is complete if it is not a subset of a larger capset. We study some new constructions of capsets via algebraic equations over extensions of $\\mathbb{F}_3$. In particular we construct the smallest known complete capsets with size proportional to the best known lower bound.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05225v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "László Györfi",
      "Pierre Humbert",
      "Batiste Le Bars"
    ],
    "title": "Metric space valued Fr{é}chet regression",
    "abstract": "We consider the problem of estimating the Fr{é}chet and conditional Fr{é}chet mean from data taking values in separable metric spaces. Unlike Euclidean spaces, where well-established methods are available, there is no practical estimator that works universally for all metric spaces. Therefore, we introduce a computable estimator for the Fr{é}chet mean based on random quantization techniques and establish its universal consistency across any separable metric spaces. Additionally, we propose another estimator for the conditional Fr{é}chet mean, leveraging data-driven partitioning and quantization, and demonstrate its universal consistency when the output space is any Banach space.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05210v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Ting Chen",
      "Hanwen Lu",
      "Wenchang Sun",
      "Yutong Zhao"
    ],
    "title": "STFT Phase Retrieval with Two Window Functions",
    "abstract": "In this paper, we consider the uniqueness of STFT phase retrieval with two window functions. We show that a complex-valued locally integrable nonseparable signal is uniquely determined up to a global phase by phaseless samples of its short time Fourier transforms with respect to two well-chosen window functions over countable parallel lines or certain lattices. Moreover, we give the optimal sampling interval for STFT phase retrieval with compactly supported window functions. For periodic locally integrable signals, we obtain a uniqueness result for STFT phase retrieval with sampled values over two parallel lines whose distance is an irrational multiple of the period. And for quasi-periodic signals, we obtain a similar result.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05364v1",
    "categories": [
      "math.OC",
      "quant-ph"
    ],
    "authors": [
      "Raoul Heese",
      "Timothée Leleu",
      "Sam Reifenstein",
      "Christian Nietner",
      "Yoshihisa Yamamoto"
    ],
    "title": "Hybrid Quantum-Classical Optimization for Multi-Objective Supply Chain Logistics",
    "abstract": "A multi-objective logistics optimization problem from a real-world supply chain is formulated as a Quadratic Unconstrained Binary Optimization Problem (QUBO) that minimizes cost, emissions, and delivery time, while maintaining target distributions of supplier workshare. The model incorporates realistic constraints, including part dependencies, double sourcing, and multimodal transport. Two hybrid quantum-classical solvers are proposed: a structure-aware informed tree search (IQTS) and a modular bilevel framework (HBS), combining quantum subroutines with classical heuristics. Experimental results on IonQ's Aria-1 hardware demonstrate a methodology to map real-world logistics problems onto emerging combinatorial optimization-specialized hardware, yielding high-quality, Pareto-optimal solutions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05361v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Huanqing Dong",
      "Jingtao Shi"
    ],
    "title": "Relationship between MP and DPP for Risk-Sensitive Stochastic Optimal Control Problems: Viscosity Solution Framework",
    "abstract": "In this paper, we study the relationship between general maximum principle and dynamic programming principle for risk-sensitive stochastic optimal control problems, where the control domain is not necessarily convex. The original problem is equivalent to a stochastic recursive optimal control problem of a forward-backward system with quadratic generators. Relations among the adjoint processes, the generalized Hamiltonian function and the value function are proved under the framework of viscosity solutions. Some examples are given to illustrate the theoretical results.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05357v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Chao Ding",
      "Ebrahim Sarabi",
      "Shiwei Wang"
    ],
    "title": "Twice Epi-Differentiability of Spectral Functions and its applications",
    "abstract": "Second-order variational properties have been shown to play important theoretical and numerical roles for different classes of optimization problems. Among such properties, twice epi-differentiability has a special place because of its ubiquitous presence in various classes of extended-real-valued functions that are important for optimization problems. We provide a useful characterization of this property for spectral functions by demonstrating that it can be characterized via the same property of the symmetric part of the spectral representation of an eigenvalue function. Our approach allows us to bypass the rather restrictive convexity assumption, used in many recent works that targeted second-order variational properties of spectral functions. By this theoretical tool, several applications on the proto-differentiability of subgradient mappings, the directional differentiability of the proximal mapping of spectral functions are achieved. We finally use our established theory to study twice epi-differentiability of leading eigenvalue functions and practical regularization terms that have important applications in statistics and the robust PCA.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05331v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yao Chen",
      "Yihong Du",
      "Wan-Tong Li",
      "Rong Wang"
    ],
    "title": "Dynamics of a nonlocal epidemic model with a new free boundary condition, part 1: Spreading-vanishing dichotomy",
    "abstract": "This paper investigates the long-time dynamics of a nonlocal epidemic model with free boundaries, where a pathogen with density $u(t,x)$ and the infected humans with density $v(t,x)$ evolve according to a reaction-diffusion system with nonlocal diffusion over a one dimensional interval $[g(t), h(t)]$, which represents the epidemic region expanding through its boundaries $x=g(t)$ and $x=h(t)$, known as free boundaries. Such a model with free boundary conditions based on those of Cao et al. \\cite{fb27} was considered by several works. Inspired by recent works of Feng et al. \\cite{fb20} and Long et al. \\cite{fb5}, we propose a new free boundary condition, where the expansion rate of the epidemic region, determined by $h'(t)$ and $g'(t)$, is proportional to a linear combination of the outward flux of the pathogen \\(u\\) through the range boundary (as in \\cite{fb27}) and the weighted total population of infected individuals \\(v\\) within the region (as in \\cite{fb5}). We prove that the system under this new free boundary condition is well-posed, and its long-time dynamical behavior is characterized by a spreading-vanishing dichotomy. Moreover, we obtain sharp criteria for this dichotomy, including a sharp threshold in terms of the initial data $(u_0,v_0)$; and by studying a related eigenvalue problem, we also find a sharp threshold in terms of the diffusion rate, which complements related results in Nguyen and Vo \\cite{fb7}. This is Part $1$ of a two part series. In Part $2$, we will determine the spreading speed of the model when spreading occurs, and for some typical classes of kernel functions, we will obtain the precise rates of accelerated spreading.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05320v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Lachlan Bennett",
      "Phillip S. Isaac",
      "Jon Links"
    ],
    "title": "Bethe ansatz solution to integrable bosonic cube networks",
    "abstract": "We study two extended Bose-Hubbard-type Hamiltonians representing bosonic networks restricted to the graph of a cube. For both Hamiltonians, we demonstrate that Bethe ansatz methods of solution can be employed after applying a canonical transformation of operators. We provide the resulting Bethe ansatz equations, and corresponding formulae for states and energies of both Hamiltonians.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05290v1",
    "categories": [
      "math.OA",
      "math.GR"
    ],
    "authors": [
      "Juan Felipe Ariza Mejía",
      "Ionuţ Chifan",
      "Adriana Fernández Quero"
    ],
    "title": "Non-amenable C$^*$-superrigid groups that are not W$^*$-superrigid",
    "abstract": "Using techniques at the intersection of deformation/rigidity theory, geometric group theory, and the theory of $C^*$-algebras, we construct a continuum of nonamenable groups $G$ that can be completely reconstructed from their reduced $C^*$-algebras $C_r^*(G)$, but not from their group von Neumann algebras $\\mathrm{L}(G)$. These groups arise as infinite direct sums of amalgamated free product groups and constitute the first known examples of nonamenable groups exhibiting this phenomenon.\n  In addition, we provide examples of finite direct products of amalgamated free product groups that are simultaneously $C^*$-superrigid and $W^*$-superrigid. Finally, for a fairly large subclass of these amalgamated free product groups $G$, we show that all $\\ast$-endomorphisms of $C_r^*(G)$ are weakly inner.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05276v1",
    "categories": [
      "math.AG",
      "math.CO",
      "math.MG"
    ],
    "authors": [
      "Naoki Kitazawa"
    ],
    "title": "Regions surrounded by parabolas in the plane and trees representing their shapes respecting their natural projection to the line",
    "abstract": "The author has been interested in regions surrounded by real algebraic curves of degree $1$ or $2$ in the plane. The author is mainly interested in their shapes and combinatorics. This is a fundamental and natural problem in mathematics being also elementary and connected to various fields. The shapes are understood via graphs the regions collapsing to respecting the canonical projection onto the 1st component.\n  Our main result is the following: each tree is realized by regions surrounded by parabolas of two types, here.\n  Related studies are elementary and interesting and surprisingly, this explicit field is started very recently, by Bodin, Popescu-Pampu and Sorea in the 2020s. After that, this is developing, due to the author. The author also investigates this motivated by studies on explicit construction of real algebraic maps onto the regions locally so-called moment maps: this comes from singularity theory of differentiable maps and real algebraic geometry.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05267v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Licheng Zhang Yuanqiu Huang Zhangdong Ouyang"
    ],
    "title": "Near-perfect matchings in highly connected 1-planar graphs with a local crossing constraint",
    "abstract": "For planar graphs, it is well known that high connectivity implies a Hamiltonian cycle and hence any 4-connected planar graph has a near-perfect matching. Nevertheless, whether 6-connected 1-planar graphs admit near-perfect matchings remains largely open. The prior art established this for 4-connected 1-planar graphs only when each crossing involves four endpoints that induce a $K_4$. In this paper, we study 6-connected 1-planar graphs that are drawn such that at all crossings the four endpoints induce a 4-cycle (plus perhaps more edges). We show that these have a near-perfect matching, and in fact even stronger, their scattering number is at most one. Moreover, under the local crossing restriction, the requirement of 6-connectivity is best possible; this is witnessed by explicit constructions due to Biedl and Fabrici et al.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05259v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "Ashwin Ram",
      "Aaditya Ramdas"
    ],
    "title": "An Asymptotic Law of the Iterated Logarithm for $\\mathrm{KL}_{\\inf}$",
    "abstract": "The population $\\mathrm{KL}_{\\inf}$ is a fundamental quantity that appears in lower bounds for (asymptotically) optimal regret of pure-exploration stochastic bandit algorithms, and optimal stopping time of sequential tests. Motivated by this, an empirical $\\mathrm{KL}_{\\inf}$ statistic is frequently used in the design of (asymptotically) optimal bandit algorithms and sequential tests. While nonasymptotic concentration bounds for the empirical $\\mathrm{KL}_{\\inf}$ have been developed, their optimality in terms of constants and rates is questionable, and their generality is limited (usually to bounded observations). The fundamental limits of nonasymptotic concentration are often described by the asymptotic fluctuations of the statistics. With that motivation, this paper presents a tight (upper and lower) law of the iterated logarithm for empirical $\\mathrm{KL}_{\\inf}$ applying to extremely general (unbounded) data.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05124v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yesom Park",
      "Stanley Osher"
    ],
    "title": "Scalable Fixed-Point Framework for High-Dimensional Hamilton-Jacobi Equations",
    "abstract": "We propose a novel, mesh-free, and gradient-free fixed-point approach for computing viscosity solutions of high-dimensional Hamilton-Jacobi (HJ) equations. By leveraging the Hopf-Lax formula, our approach iteratively solves the associated variational problem via a Picard iteration, enabling efficient evaluation of both the solution and its corresponding control without relying on grids, characteristics, or differentiation. We demonstrate the practical efficacy and scalability of the approach through numerical experiments in up to 100 dimensions, including control problems and non-smooth solutions. Our results show that the proposed scheme achieves high accuracy, is highly efficient, and exhibits computational times that are largely independent of dimensionality, highlighting its suitability for high-dimensional problems.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05558v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Dag Normann",
      "Sam Sanders"
    ],
    "title": "The uncountability of the reals and the Axiom of Choice",
    "abstract": "The uncountability of the reals was first established by Cantor in what was later heralded as the first paper on set theory. Since the latter constitutes the official foundations of mathematics, the logical study of the uncountability of the reals is a worthy endeavour for historical, foundational, and conceptual reasons. In this paper, we shall study the following principle:\n  $\\textsf{NIN}_{[0,1]}$: there is no injection from the unit interval to the natural numbers.\n  We show that relatively strong logical systems cannot prove $\\textsf{NIN}_{[0,1]}$. In particular, the former system implies second-order arithmetic and fragments of the Axiom of Choice, including dependent choice. We also study the latter choice fragments in Kohlenbach's higher-order Reverse Mathematics.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05504v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Julien Hermant",
      "Jean-François Aujol",
      "Charles Dossal",
      "Lorick Huang",
      "Aude Rondepierre"
    ],
    "title": "Continuized Nesterov Momentum Achieves the $O(\\varepsilon^{-7/4})$ Complexity without Additional Mechanisms",
    "abstract": "For first-order optimization of non-convex functions with Lipschitz continuous gradient and Hessian, the best known complexity for reaching an $\\varepsilon$-approximation of a stationary point is $O(\\varepsilon^{-7/4})$. Existing algorithms achieving this bound are based on momentum, but are always complemented with safeguard mechanisms, such as restarts or negative-curvature exploitation steps. Whether such mechanisms are fundamentally necessary has remained an open question. Leveraging the continuized method, we show that a Nesterov momentum algorithm with stochastic parameters alone achieves the same complexity in expectation. This result holds up to a multiplicative stochastic factor with unit expectation and a restriction to a subset of the realizations, both of which are independent of the objective function. We empirically verify that these constitute mild limitations.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05477v1",
    "categories": [
      "math.PR",
      "math.AP",
      "math.FA",
      "math.MG"
    ],
    "authors": [
      "Sylvester Eriksson-Bique"
    ],
    "title": "On the Resistance Conjecture",
    "abstract": "We give an affirmative answer to the resistance conjecture on characterization of parabolic Harnack inequalities in terms of volume doubling, upper capacity bounds and a Poincaré inequalities. The key step is to show that these three assumptions imply the so called cutoff Sobolev inequality, an important inequality in the study of anomalous diffusions, Dirichlet forms and re-scaled energies in fractals. This implication is shown in the general setting of $p$-Dirichlet Spaces introduced by the author and Murugan, and thus a unified treatment becomes possible to proving Harnack inequalities and stability phenomena in both analysis on metric spaces and fractals and for graphs and manifolds for all exponents $p\\in (1,\\infty)$. As an application, we also show that a Dirichlet space satisfying volume doubling, Poincaré and upper capacity bounds has finite martingale dimension and admits a type of differential structure similar to the work of Cheeger. In the course of the proof, we establish methods of extension and characterizations of Sobolev functions by Poincaré-inequalities, and extend the methods of Jones and Koskela to the general setting of $p$-Dirichlet spaces.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05418v1",
    "categories": [
      "math-ph",
      "hep-th"
    ],
    "authors": [
      "R. L. Mkrtchyan"
    ],
    "title": "Universal Quantum Dimensions: I. $γ$-Independent Factors",
    "abstract": "We propose a method for computing universal (in Vogel's sense) quantum dimension formulae for universal multiplets whose associated $sl$, $so$, and $sp$ representations are nonzero. The method uses the relation between $sl$ and $so$ representations given by the vertical-sum operation, and the dual relation between $sl$ and $sp$ representations given by the horizontal-sum operation on the corresponding Young diagrams. The usual quantum dimensions of these three representations, together with subtleties related to the invariance of universal formulae under automorphisms of the $sl$ Dynkin diagram, allow one to determine the $γ$-independent factors of a universal quantum dimension (note that $γ$ is the only parameter for classical algebras, depending on their rank). Using this approach, we compute the $γ$-independent factors for (known) adjoints' universal quantum dimension, and also obtain such a factor in one new case. We discuss how to extend this approach to the $γ$-dependent factors in the quantum dimension formulae, and other issues. This is another instance in which calculations purely within the classical algebras predict the answers for the exceptional cases, due to the hidden universality structure of the theory of simple Lie algebras.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05394v1",
    "categories": [
      "math.NA",
      "cs.DS"
    ],
    "authors": [
      "Noah Amsel",
      "Yves Baumann",
      "Paul Beckman",
      "Peter Bürgisser",
      "Chris Camaño",
      "Tyler Chen",
      "Edmond Chow",
      "Anil Damle",
      "Michal Derezinski",
      "Mark Embree",
      "Ethan N. Epperly",
      "Robert Falgout",
      "Mark Fornace",
      "Anne Greenbaum",
      "Chen Greif",
      "Diana Halikias",
      "Zhen Huang",
      "Elias Jarlebring",
      "Yiannis Koutis",
      "Daniel Kressner",
      "Rasmus Kyng",
      "Jörg Liesen",
      "Jackie Lok",
      "Raphael A. Meyer",
      "Yuji Nakatsukasa",
      "Kate Pearce",
      "Richard Peng",
      "David Persson",
      "Eliza Rebrova",
      "Ryan Schneider",
      "Rikhav Shah",
      "Edgar Solomonik",
      "Nikhil Srivastava",
      "Alex Townsend",
      "Robert J. Webber",
      "Jess Williams"
    ],
    "title": "Linear Systems and Eigenvalue Problems: Open Questions from a Simons Workshop",
    "abstract": "This document presents a series of open questions arising in matrix computations, i.e., the numerical solution of linear algebra problems. It is a result of working groups at the workshop \\emph{Linear Systems and Eigenvalue Problems}, which was organized at the Simons Institute for the Theory of Computing program on \\emph{Complexity and Linear Algebra} in Fall 2025. The complexity and numerical solution of linear algebra problems %in matrix computations and related fields is a crosscutting area between theoretical computer science and numerical analysis. The value of the particular problem formulations here is that they were produced via discussions between researchers from both groups.\n  The open questions are organized in five categories: iterative solvers for linear systems, eigenvalue computation, low-rank approximation, randomized sketching, and other areas including tensors, quantum systems, and matrix functions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05046v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Abhijeet",
      "Suman Chakravorty"
    ],
    "title": "Safe Optimal Control using Log Barrier Constrained iLQR",
    "abstract": "This paper presents a constrained iterative Linear Quadratic Regulator (iLQR) framework for nonlinear optimal control problems with box constraints on both states and control inputs. We incorporate logarithmic barrier functions into the stage cost to enforce box constraints (upper and lower bounds on variables), yielding a smooth interior-point formulation that integrates seamlessly with the standard iLQR backward-forward pass. The Hessian contributions from the log barriers are positive definite, preserving and enhancing the positive definiteness of the quadratic approximations in iLQR and providing an intrinsic regularization effect that improves numerical stability and convergence. Moreover, since the negative logarithm is convex, the addition of log barrier terms preserves convexity if the cost is already convex. We further analyze how the barrier-augmented iLQR naturally adapts feedback gains near constraint boundaries. In particular, at convergence, the feedback terms associated with saturated control channels go to zero, recovering a purely feedforward behavior whenever control is saturated. Numerical examples on constrained nonlinear control problems demonstrate that the proposed method reliably respects box constraints and maintains favorable convergence properties.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05025v1",
    "categories": [
      "math.OC",
      "math.PR"
    ],
    "authors": [
      "Isabel Agostino",
      "Thibaut Mastrolia"
    ],
    "title": "Approximation of Singular-Stopping Control Driven by Hawkes Processes via Rescaled MDPs",
    "abstract": "We investigate a singular-optimal stopping stochastic control problem driven by self-exciting dynamics governed by a Hawkes process. In the continuous-time setting, we show that the optimization problem reduces to solving a variational partial differential equation with gradient constraints. We then introduce its discrete-time counterpart, modeled as a Markov Decision Process. We prove that, under an appropriate rescaling procedure, the value function of the discrete-time problem converges to its continuous-time equivalent, implying that the discrete-time optimizers are asymptotically optimal for the continuous-time problem. Finally, we apply these results to an Ornstein-Uhlenbeck stochastic differential equation driven by a Hawkes process with singular control, motivated by optimal power plant investment under cyber threat and we illustrate the theoretical findings through numerical simulations.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05015v1",
    "categories": [
      "math.AP",
      "math.CA"
    ],
    "authors": [
      "Cristian Bereanu",
      "Alexandru Pîrvuceanu"
    ],
    "title": "$\\bf{S^1}$-index theory for the Lorentz force equation",
    "abstract": "In this paper we prove that the $S^1$-invariance of the Poincaré action functional associated to the Lorentz force equation gives the existence of multiple critical points which are periodic solutions with a fixed period. To do this, we prove an abstract multiplicity result which is based upon the Lusternik-Schnirelman method with the $S^1$-index. The corresponding result in the context of the Fadell-Rabinowitz index is proved in Ekeland and Lasry (Ann. Math., 112 (1980)). The main feature of our abstract result is that it allows us to consider nonsmooth functionals satisfying only a weak compactness condition well adapted to the Poincaré functional.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05005v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Joshua Bannister",
      "David P. Hewett",
      "Andrew Gibbs"
    ],
    "title": "Acoustic scattering by fractal inhomogeneities via geometry-conforming Galerkin methods for the Lippmann-Schwinger equation",
    "abstract": "We propose and analyse a numerical method for time-harmonic acoustic scattering in $\\mathbb{R}^n$, $n=2,3$, by a class of inhomogeneities (penetrable scatterers) with fractal boundary. Our method is based on a Galerkin discretisation of the Lippmann-Schwinger volume integral equation, using a discontinuous piecewise-polynomial approximation space on a geometry-conforming mesh comprising elements which themselves have fractal boundary. We first provide a semi-discrete well-posedness and error analysis for both the $h$- and $p$-versions of our method for completely arbitrary inhomogeneities (without any regularity assumption on the boundary of the inhomogeneity or of the mesh elements). We prove convergence estimates for the integral equation solution and superconvergence estimates for linear functionals such as scattered field and far-field pattern evaluations, and elucidate how the regularity of the inhomogeneity boundary and the regularity of the refractive index affect the rates of convergence predicted. We then specialise to the case where the inhomogeneity is an ``$n$-attractor'', i.e.\\ the fractal attractor of an iterated function system satisfying the open set condition with non-empty interior, showing how in this case the self-similarity of the inhomogeneity can be used to generate geometry-conforming meshes. For the $h$-version with piecewise constant approximation we also present singular quadrature rules, supported by a fully discrete error analysis, permitting practical implementation of our method. We present numerical results for two-dimensional examples, which validate our theoretical results and show that our method is significantly more accurate than a comparable method involving replacement of the fractal inhomogeneity by a smoother prefractal approximation.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05591v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Chin Pang Ho",
      "Marek Petrik",
      "Wolfram Wiesemann"
    ],
    "title": "Efficient Algorithms for Robust Markov Decision Processes with $s$-Rectangular Ambiguity Sets",
    "abstract": "Robust Markov decision processes (MDPs) have attracted significant interest due to their ability to protect MDPs from poor out-of-sample performance in the presence of ambiguity. In contrast to classical MDPs, which account for stochasticity by modeling the dynamics through a stochastic process with a known transition kernel, a robust MDP additionally accounts for ambiguity by optimizing against the most adverse transition kernel from an ambiguity set constructed via historical data. In this paper, we develop a unified solution framework for a broad class of robust MDPs with $s$-rectangular ambiguity sets, where the most adverse transition probabilities are considered independently for each state. Using our algorithms, we show that $s$-rectangular robust MDPs with $1$- and $2$-norm as well as $φ$-divergence ambiguity sets can be solved several orders of magnitude faster than with state-of-the-art commercial solvers, and often only a logarithmic factor slower than classical MDPs. We demonstrate the favorable scaling properties of our algorithms on a range of synthetically generated as well as standard benchmark instances.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05101v1",
    "categories": [
      "math.AP",
      "math-ph",
      "nlin.SI"
    ],
    "authors": [
      "Aikaterini Gkogkou",
      "Guido Mazzuca",
      "Kenneth D. T-R McLaughlin"
    ],
    "title": "Painlevé Universality classes for the maximal amplitude solution of the Focusing Nonlinear Schrödinger Equation with randomness",
    "abstract": "We establish universality for extremal solutions of the focusing nonlinear Schrödinger equation. Extremal solutions are $N$-soliton solutions that achieve the theoretical maximal amplitude and diverge as $N \\to \\infty$. We consider extremal solutions with the discrete eigenvalues randomly drawn from sub-exponential distributions, and identify two distinct universality classes, determined by the macroscopic structure of the spectrum: the Painlevé--III rogue-wave solution, where the eigenvalues take the form $λ_j = v_j + i μ_j$, and the Painlevé--V rogue wave solution, where $λ_j = -ζ\\, j + v_j + i μ_j$, with $0 < ζ< 1$. (In both cases, $μ_{j}$ and $v_{j}$ are subexponential random variables.) Universality can then be summarized as follows: independently of the specific distribution of the eigenvalues, the rescaled solutions converge locally to a deterministic profile governed by the Painlevé-III equation in the first regime, and the Painlevé-V equation in the second. These results demonstrate that the formation of Painlevé-type rogue waves is a universal phenomenon robust to randomness.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05097v1",
    "categories": [
      "cs.IT",
      "math.AG"
    ],
    "authors": [
      "Matteo Bonini",
      "Arianna Dionigi",
      "Francesco Ghiandoni"
    ],
    "title": "On QC and GQC algebraic geometry codes",
    "abstract": "We present new constructions of quasi-cyclic (QC) and generalized quasi-cyclic (GQC) codes from algebraic curves. Unlike previous approaches based on elliptic curves, our method applies to curves that are Kummer extensions of the rational function field, including hyperelliptic, norm-trace, and Hermitian curves. This allows QC codes with flexible co-index. Explicit parameter formulas are derived using known automorphism-group classifications.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05677v1",
    "categories": [
      "math-ph",
      "hep-th"
    ],
    "authors": [
      "Giovanni Camilletti",
      "María A. Lledó",
      "Mariano A. del Olmo"
    ],
    "title": "Representations of the D=2 Euclidean and Poincaré groups",
    "abstract": "In this paper we compute explicitly the Unitary Irreducible Representations of the Poincaré and Euclidean groups in dimension D=2, following, step by step, Mackey's theorem of induced representations.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05666v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Chao Zhou",
      "Changsheng You",
      "Cong Zhou",
      "Li Chen",
      "Yi Gong",
      "Chengwen Xing"
    ],
    "title": "Low-complexity Design for Beam Coverage in Near-field and Far-field: A Fourier Transform Approach",
    "abstract": "In this paper, we study efficient beam coverage design for multi-antenna systems in both far-field and near-field cases. To reduce the computational complexity of existing sampling-based optimization methods, we propose a new low-complexity yet efficient beam coverage design. To this end, we first formulate a general beam coverage optimization problem to maximize the worst-case beamforming gain over a target region. For the far-field case, we show that the beam coverage design can be viewed as a spatial-frequency filtering problem, where angular coverage can be achieved by weight-shaping in the antenna domain via an inverse FT, yielding an infinite-length weighting sequence. Under the constraint of a finite number of antennas, a surrogate scheme is proposed by directly truncating this sequence, which inevitably introduces a roll-off effect at the angular boundaries, yielding degraded worst-case beamforming gain. To address this issue, we characterize the finite-antenna-induced roll-off effect, based on which a roll-off-aware design with a protective zoom is developed to ensure a flat beamforming-gain profile within the target angular region. Next, we extend the proposed method to the near-field case. Specifically, by applying a first-order Taylor approximation to the near-field channel steering vector (CSV), the two-dimensional (2D) beam coverage design (in both angle and inverse-range) can be transformed into a 2D inverse FT, leading to a low-complexity beamforming design. Furthermore, an inherent near-field range defocusing effect is observed, indicating that sufficiently wide angular coverage results in range-insensitive beam steering. Finally, numerical results demonstrate that the proposed FT-based approach achieves a comparable worst-case beamforming performance with that of conventional sampling-based optimization methods while significantly reducing the computational complexity.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05647v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Stefano Biagi",
      "Marco Bramanti"
    ],
    "title": "Fundamental solution for higher order homogeneous hypoelliptic operators structured on Hörmander vector fields",
    "abstract": "We introduce and study a new class of higher order differential operators defined on $\\mathbb{R}^{n}$, which are built with Hörmander vector fields, homogeneous w.r.t. a family of dilations (but not left invariant w.r.t. any structure of Lie group) and have a structure such that a suitably lifted version of the operator is hypoelliptic. We call these operators ''generalized Rockland operators''. We prove that these operators are themselves hypoelliptic and, under a natural condition on the homogeneity degree, possess a global fundamental solution $Γ\\left( x,y\\right) $ which is jointly homogeneous in $\\left( x,y\\right) $ and satisfies sharp pointwise estimates. Our theory can be applied also to some higher order heat-type operators and their fundamental solutions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05640v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Felix Meyer"
    ],
    "title": "Large time existence in a thermoviscoelastic evolution problem with mildly temperature-dependent parameters",
    "abstract": "We consider \\begin{align*} \\label{HS} \\left\\{ \\begin{array}{l} u_{tt} = (γ(Θ) u_{xt})_x + a (γ(Θ) u_x)_x +(f(Θ))_x, \\\\[1mm] Θ_t = DΘ_{xx} + Γ(Θ) u_{xt}^2 + F(Θ) u_{xt}, \\end{array}\\right. \\qquad \\qquad (\\star) \\end{align*} under Neumann boundary conditions for $u$ and Dirichlet boundary conditions for $Θ$ in a bounded interval $Ω\\subset\\mathbb{R}$. \\abs This model is a generalization of the classical system for the description of strain and temperature evolution in a thermo-viscoelastic material following a Kelvin-Voigt material law, in which $γ\\equiv Γ$ and $f\\equiv F$. Different variations of this model have already been analyzed in the past and the present study draws upon a known result concerning the existence of classical solutions, which are local in time, for suitably smooth initial data, arbitrary $a>0$, $D>0$ and $γ,f\\in C^2([0,\\infty))$ as well as $Γ,F\\in C^1([0,\\infty))$ with $γ>0,Γ\\ge0$ and $F(0)=0$. Our work focuses on proving that existence times for classical solutions can be arbitrarily large, assuming sublinear temperature dependencies of $γ$ and $f$, and further $|F(s)|\\le C_F(1+s)^α$ for some $C_F>0$ and $α\\in(0,1)$. In particular, for any given $T_\\star$, initial mass $M$ and $0<\\underlineγ<\\overlineγ$, there exists a constant $δ_\\star(M,T_\\star,a,D, Ω, \\underlineγ, \\overlineγ,C_F,α)>0$, such that if $$\\underlineγ\\leγ\\le \\overlineγ\\quad\\mbox{ and }\\quad 0\\le Γ\\le \\overlineγ\\quad \\mbox{ as well as } \\quad\\|γ'\\|_{L^\\infty([0,\\infty))}\\le δ_\\star \\quad \\mbox{ and }\\quad \\|f'\\|_{L^\\infty([0,\\infty))}\\le δ_\\star $$ hold, the maximal existence time of the classical solution to $(\\star)$ surpasses $T_\\star$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05095v1",
    "categories": [
      "math.CO",
      "math.NT",
      "math.PR"
    ],
    "authors": [
      "Evan Chen",
      "Chris Cummins",
      "Ben Eltschig",
      "Dejan Grubisic",
      "Leopold Haller",
      "Letong Hong",
      "Andranik Kurghinyan",
      "Kenny Lau",
      "Hugh Leather",
      "Seewoo Lee",
      "Aram Markosyan",
      "Ken Ono",
      "Manooshree Patel",
      "Gaurang Pendharkar",
      "Vedant Rathi",
      "Alex Schneidman",
      "Volker Seeker",
      "Shubho Sengupta",
      "Ishan Sinha",
      "Jimmy Xin",
      "Jujian Zhang"
    ],
    "title": "Dead ends in square-free digit walks",
    "abstract": "We study \"dead ends\" in square-free digit walks: square-free integers $N$ such that, in base $b$, every one-digit extension $bN+d$ is non-square-free. In base $10$, the stochastic independence model of Miller et al. suggests that infinite square-free walks occur with probability near $1$, corresponding to an asymptotic dead-end density of $\\approx 5.218\\times 10^{-5}$. We prove that the true asymptotic dead-end density satisfies \\[ c_{\\mathrm{dead}} \\approx 1.317\\times 10^{-9}, \\] roughly a factor of $\\sim 4\\times 10^4$ smaller than the prediction. For every base $b\\geq 2$, we prove that dead-end densities exist and are given by a closed-form expression (as a finite alternating sum of Euler products). The argument is fully formalized in Lean/Mathlib, and was produced automatically by AxiomProver from a natural-language statement of the problem.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05593v1",
    "categories": [
      "math.DS",
      "math.CA",
      "math.NT"
    ],
    "authors": [
      "Simon Baker",
      "Amlan Banaji"
    ],
    "title": "Self-similar and self-conformal measures with slow Fourier decay",
    "abstract": "Given any function $φ\\colon [0,\\infty)\\to (0,1]$ satisfying $\\lim_{ξ\\to\\infty}φ(ξ) = 0$, we prove the existence of i) self-similar measures and ii) nonlinear $C^{\\infty}$ self-conformal measures which are Rajchman and whose Fourier transform $\\widehatμ$ satisfies \\[ \\limsup_{ξ\\to\\infty}\\frac{|\\widehatμ(ξ)|}{φ(ξ)}>0.\\] Moreover, we derive new sufficient conditions for a self-conformal measure to be Rajchman, and construct an explicit self-similar measure $μ$ such that $μ$ almost every $x$ is normal in base $10$ but the sequence $(10^{n}x \\mod 1)_{n=1}^{\\infty}$ equidistributes extremely slowly.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05511v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jean-François Burnol"
    ],
    "title": "Some series representing the eta function for $\\Re s>0$",
    "abstract": "We represent the Dirichlet eta function, and generally $(b^s-b)ζ(s)/b^s$ for $b>1$ an integer, in the half-plane $\\Re s>0$, via series dominated by geometric series, with arbitrarily small convergence ratio (up to the prize of a longer first approximation). Due to the underlying recurrence, the cost for each new term is at first sight linearly increasing, so the cost appears to be quadratic in the number of terms kept. And the number of terms needed to achieve a given target precision increases linearly with the imaginary part of $s$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05497v1",
    "categories": [
      "math.AP",
      "math.NA"
    ],
    "authors": [
      "Qianyuan Yin",
      "Changkun Wei",
      "Bo Zhang"
    ],
    "title": "Convergence of the PML method for thermoelastic wave scattering problems",
    "abstract": "This paper is concerned with the thermoelastic obstacle scattering problem in three dimensions. A uniaxial perfectly matched layer (PML) method is firstly introduced to truncate the unbounded scattering problem, leading to a truncated PML problem in a bounded domain. Under certain constraints on model parameters, the well-posedness for the truncated PML problem is then proved except possibly for a discrete set of frequencies, based on the analytic Fredholm theory. Moreover, the exponential convergence of the uniaxial PML method is established in terms of the thickness and absorbing parameters of PML layer. The proof is based on the PML extension technique and the exponential decay properties of the modified fundamental solution. As far as we know, this is the first convergence result of the PML method for the time-harmonic thermoelastic scattering problem.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05460v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Antoine Godichon-Baggioni",
      "Bruno Portier",
      "Guillaume Sallé"
    ],
    "title": "Complexity reduction in online stochastic Newton methods with potential O(N d) total cost",
    "abstract": "Optimizing smooth convex functions in stochastic settings, where only noisy estimates of gradients and Hessians are available, is a fundamental problem in optimization. While first-order methods possess a low per-iteration cost, their convergence is slow for ill-conditioned problems. Stochastic Newton methods utilize second-order information to correct for local curvature, but the O(d 3 ) per-iteration cost of computing and inverting a full Hessian, where d is the problem dimension, is prohibitive in high dimensions. This paper introduces an online mini-batch stochastic Newton algorithm. The method employs a random masking strategy that selects a subset of Hessian columns at each iteration, substantially reducing the per-step computational cost. This approach allows the algorithm, in the mini-batch setting, to achieve a total computational cost for a single pass over N data points of O(N d), which is comparable to first-order methods while retaining the advantages of second-order information. We establish the almost sure convergence and asymptotic efficiency of the resulting estimator. This property is obtained without requiring iterate averaging, which distinguishes this work from prior analyses.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05428v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Jacob S. Christiansen",
      "Benjamin Eichinger",
      "Olof Rubin",
      "Maxim Zinchenko"
    ],
    "title": "Weighted residual polynomials on a circular arc",
    "abstract": "We study the behavior of weighted residual polynomials on circular arcs, including weighted Chebyshev polynomials. For weights given by reciprocals of polynomials, we establish Szegő-Widom asymptotics. Extending our analysis to less regular weights, we determine the asymptotic behavior of the corresponding weighted Widom factors, generalizing results by Eichinger and Thiran et al. As an application, we derive the asymptotics of Widom factors on certain lemniscatic arcs.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05376v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Hongyi Li",
      "Jun Xu",
      "Jinfeng Liu"
    ],
    "title": "Distributed Model Predictive Control for Energy and Comfort Optimization in Large Buildings Using Piecewise Affine Approximation",
    "abstract": "The control of large buildings encounters challenges in computational efficiency due to their size and nonlinear components. To address these issues, this paper proposes a Piecewise Affine (PWA)-based distributed scheme for Model Predictive Control (MPC) that optimizes energy and comfort through PWA-based quadratic programming. We utilize the Alternating Direction Method of Multipliers (ADMM) for effective decomposition and apply the PWA technique to handle the nonlinear components. To solve the resulting large-scale nonconvex problems, the paper introduces a convex ADMM algorithm that transforms the nonconvex problem into a series of smaller convex problems, significantly enhancing computational efficiency. Furthermore, we demonstrate that the convex ADMM algorithm converges to a local optimum of the original problem. A case study involving 36 zones validates the effectiveness of the proposed method. Our proposed method reduces execution time by 86\\% compared to the centralized version.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05336v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Jiguang Yu",
      "Louis Shuo Wang",
      "Yuansheng Gao",
      "Ye Liang"
    ],
    "title": "Full-Covariance Chemical Langevin Predator--Prey Diffusion with Absorbing Boundaries",
    "abstract": "Many stochastic Rosenzweig--MacArthur predator--prey models inject ad hoc independent (diagonal) noise and therefore cannot encode the event-level coupling created by predation and biomass conversion. We derive an absorbed, fully mechanistic diffusion approximation and its extinction structure from a continuous-time Markov chain on $\\mathbb N_0^2$ with four reaction channels: prey birth, prey competition death, predator death, and a coupled predation--conversion event. Absorbing coordinate axes are imposed to represent the irreversibility of demographic extinction. Under Kurtz density-dependent scaling, the law-of-large-numbers limit recovers the classical RM ODE, while central-limit scaling yields a chemical-Langevin diffusion with explicit drift and full state-dependent covariance. A distinctive signature is the strictly negative cross-covariance $Σ_{12}(N,P)=-mNP/(1+N)$ induced solely by the predation--conversion increment $(-1,1)$. We define the absorbed Itô SDE by freezing trajectories at the first boundary hit and prove strong well-posedness, non-explosion, and moment bounds up to absorption. Extinction has positive probability from every interior state, and predator extinction is almost sure when $m\\le c$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05314v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Lei Wu"
    ],
    "title": "Generalized nearby cycles via relative and logarithmic $\\mathscr{D}$-modules",
    "abstract": "For a regular map $F$ from a complex smooth affine variety $X$ to $\\mathbb A^r_\\mathbb C$, we construct generalized nearby-cycle modules of a regular holonomic $\\mathscr D$-modules $\\mathcal M$ along log strata with the log structure induced by the graph of $F$, whose relative supports are infinite unions of translated linear subvarieties of $\\mathbb C^r$ determined by the zero loci of Bernstein-Sato ideals along monoid ideals. For a fixed log stratum, the nearby-cycle module corresponds to the Sabbah specialization complex of DR$(\\mathcal M)$ under the relative regular Riemann-Hilbert correspondence of Fiorot-Fernandes-Sabbah, which generalizes the classical comparison theorem of Kashiwara-Malgrange for Deligne's nearby cycles. As an application, when $\\mathcal M=\\mathcal O_X$, we give a topological interpretation of the zero loci of Bernstein-Sato ideals of $F$ along monoid ideals under the exponential map, which answers a question of Budur-Shi-Zuo.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05283v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Qingfang Wang",
      "Mingxue Zhai"
    ],
    "title": "Infinitely many new solutions for a nonlinear coupled Schrödinger system",
    "abstract": "We revisit the following nonlinear Schrödinger system \\begin{align*}\\begin{cases} -ε^{2}Δu +P(x) u= μ_1 u^3 +βuv^2, &~\\text{in}\\;\\mathbb {R}^3,\\\\ -ε^{2}Δv+Q(x) v= μ_2 v^3 +βu^2v, &~\\text{in}\\;\\mathbb{ R}^3, \\end{cases} \\end{align*} where $ε$ is a positive parameter, $P(x),\\,Q(x)$ are the potential functions, $μ_1>0$, $μ_2>0$ and $β\\in\\mathbb R$ is a coupling constant. Employing the finite dimensional reduction method, we prove that there are new kind of synchronized and segregated solutions, which concentrate both in a bounded domain and near infinity, and present a special structure. Moreover, by applying the local Pohozaev identities and some point-wise estimates of the errors, we prove that the new kind of synchronized solutions are non-degenerate, which is of great interest independently. One of the main difficulties of Schrödinger system come from the interspecies interaction between the components, which never appear in the study of single equation. Secondly, prior to the construction of new solutions, we shall verify the non-degeneracy of the solutions established in [Peng-Pi, Discrete Contin. Dyn. Syst., 2016] for the Schrödinger systems.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05264v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jiaxu Li",
      "Boqiang Lü",
      "Bing Yuan"
    ],
    "title": "Strong solutions to the initial-boundary-value problem of compressible MHD equations with degenerate viscosities and far field vacuum in 3D exterior domains",
    "abstract": "This paper concerns the initial-boundary-value problem (IBVP) of the compressible Magnetohydrodynamic (MHD) equations in 3D exterior domains with Navier-slip boundary conditions for the velocity and perfect conducting conditions for the magnetic field. For the case that the density approaches far-field vacuum initially and the viscosities are power functions of the density (ρ}δ with 0 < δ < 1), the local existence and uniqueness of strong solutions to the IBVP is established for regular large initial data. In particular, in contrast to the local theory of compressible Navier-Stokes equation Li-Lü-Yuan [24], we show that the magnetic field maintains the initial quality of decaying faster rate than density throughout the time evolution, which reveals the role of the magnetic field in handling singularities arising from density-dependent viscosities.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05197v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Andrew Burke"
    ],
    "title": "Local Cohomological Defect and a Conjecture of Mustata-Popa",
    "abstract": "We prove a general result on the depth of Du Bois complexes of a singular variety. We apply it to prove a conjecture of Mustata-Popa and to study the local cohomological defect, extending results of Ogus and Dao-Takagi over the complex numbers.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05188v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Masato Tsujii"
    ],
    "title": "Non-stationary normal coordinates on neighborhoods of Pesin stable manifolds",
    "abstract": "We construct non-stationary normal coordinates in a neighborhood of Pesin stable manifolds \\cite{Pesin}. This construction is a natural extension, via jets in the normal directions, of the non-stationary normal coordinates on stable manifolds introduced by Guysinsky and Katok. We emphasize that this extension provides a useful framework for describing the fractal geometric structures of stable and unstable foliations in smooth dynamical systems.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05185v1",
    "categories": [
      "math.LO",
      "math.CO",
      "math.OA",
      "math.SP"
    ],
    "authors": [
      "Cecelia Higgins",
      "Pieter Spaas",
      "Alexander Tenenbaum"
    ],
    "title": "Spectral Theory for Borel PMP Graphs",
    "abstract": "We initiate a systematic study of spectral theory for bounded-degree Borel pmp graphs. Specifically, we study spectral properties of the associated adjacency and Laplacian operators. We start with proving a spectral characterization of approximate measurable bipartiteness. Next, we adapt classical theorems of Wilf and Hoffman to give novel upper and lower bounds on the approximate measurable chromatic number. Using similar techniques, we then show that the approximate measurable chromatic number of a pmp graph generated by $n$ bounded-to-one functions is at most $2n + 1$. Next, concerning matchings, we introduce a measurable version of Tutte's condition and show that a spectral assumption analogous to the one from a classical theorem of Brouwer and Haemers implies this measurable Tutte condition. Finally, we show that the spectrum is continuous under local-global convergence.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05127v1",
    "categories": [
      "math.CA",
      "math.PR"
    ],
    "authors": [
      "Ji Li",
      "Chun-Yen Shen",
      "Chaojie Wen"
    ],
    "title": "Maximal Averages on the Affine Group $G_n$ and applications",
    "abstract": "The general affine group $G_n$ sits at the intersection of harmonic analysis on solvable groups and the geometry of negatively curved symmetric spaces. In this work, we characterize the $L^p$-behavior of maximal operators associated with the fundamental motions of $G_n$. We establish a sharp dichotomy: while translation and geodesic averages exhibit Euclidean-like or improved regularity (yielding $L^1$ boundedness for the latter), dilation averages are governed by the group's non-unimodularity. We prove that dilation averages require a modular-weighted correction to achieve $L^p$ boundedness for $p > 1$, but we establish a fundamental failure at the endpoint $p=1$. Specifically, we prove that dilation maximal operators and those associated with expansive random walks fail the weak-type $(1,1)$ estimate due to an exponential drift-to-volume mismatch. These results connect analytic maximal inequalities to the transience of Brownian motion, demonstrating that modular weights are necessary to compensate for the stochastic drift in the upper half-space.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05045v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "W. Cuellar Carrera",
      "V. Ferenczi"
    ],
    "title": "On complex structures and uniqueness of algebra norms in Banach spaces",
    "abstract": "For $X$ an infinite dimensional Banach space, we contribute to the study of the Banach algebra $L(X)/S(X)$, where $S(X)$ is the ideal of strictly singular operators. We extend results of Ferenczi-Galego (2007) by proving that $\\|I-J\\|_S \\geq 2$, whenever $I$ is a complex structure on a real space $X$ and $J$ extends a complex structure on a hyperplane of $X$, and where $\\|.\\|_S$ denotes a certain algebra norm on $L(X)/S(X)$ dominated by the usual quotient norm $\\|.\\|$. We solve two questions of Kalton-Swanson (1982) by proving that if $X=Z_2$ the Kalton-Peck space, then $L(Z_2)/S(Z_2)$ a) is not complete for $\\|.\\|_S$ and b) that it is not *-isomorphic to a $C^*$-algebra for $\\|.\\|$. In particular $L(Z_2)/S(Z_2)$ admits two inequivalent *-algebra norms.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05039v1",
    "categories": [
      "math.RA",
      "math.GR"
    ],
    "authors": [
      "Benjamin Bachner"
    ],
    "title": "Linear sofic approximations of amenable algebras",
    "abstract": "We introduce the notion of linear sofic approximations for algebras, analogous to the concept of sofic approximations for groups. We prove that for a finitely generated amenable $K$-algebra with no zero divisors, all linear sofic approximations are conjugate. This provides an algebraic analogue to Elek and Szabó's theorem for amenable groups. The proof relies on a \"linear monotiling\" technique, constructed using a theorem by Brešar, Meshulam and Šemrl on locally linearly dependent operators. Finally, we apply this uniqueness result to the problem of weak stability in the rank metric, showing that the group algebra of an amenable group is weakly stable if and only if the group is residually finite.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.04897v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Mihai Ivan"
    ],
    "title": "Almost groupoids and their substructures",
    "abstract": "The aim of this paper is to present the main constructions of the substructures of an almost groupoid and to discuss their basic properties. The definitions and properties concerning these new algebraic constructions extend to almost groupoids, the corresponding well-known results for groupoids.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05326v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jiyang Gao",
      "Shiliang Gao",
      "Yibo Gao"
    ],
    "title": "Tilted Richardson Varieties",
    "abstract": "The study of the flag variety $\\mathrm{Fl}_n$ and its subvarieties, including Schubert and Richardson varieties, plays a fundamental role in algebraic geometry and algebraic combinatorics. In this paper, we introduce and develop the theory of tilted Richardson varieties $\\mathrm{T}_{u,v}$, a new family of subvarieties of the flag variety that provides a geometric framework for the quantum Bruhat graphs. These varieties are defined for all pairs of permutations $u$ and $v$, extending the classical Richardson varieties in the case where $u\\leq v$ in the Bruhat order. We establish their fundamental geometric properties, proving irreducibility and providing explicit dimension formulas. Moreover, we show that they have a well-defined stratification indexed by tilted Bruhat intervals, a generalization of classical Bruhat intervals previously introduced by Brenti, Fomin, and Postnikov. Additionally, we introduce a tilted generalization of the classical Deodhar decomposition of Richardson varieties, which leads to a combinatorial formula for tilted Kazhdan--Lusztig R-polynomials, a notion that arises naturally in our framework.\n  We further develop a theory of total positivity for tilted Richardson varieties. In particular, we define and study the totally nonnegative parts of tilted Richardson varieties, proving they form a CW complex. This generalizes earlier results on the totally nonnegative flag variety and answers Björner's questions regarding geometric realizations of tilted Bruhat intervals.\n  Finally, we establish explicit connections between tilted Richardson varieties and quantum Schubert calculus. Specifically, we prove that $\\mathrm{T}_{u,v}$ coincides with minimal-degree two-point curve neighborhoods. As a result, we compute their cohomology classes and derive new relationships among Gromov--Witten invariants of the flag variety.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05090v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Evan Chen",
      "Chris Cummins",
      "Ben Eltschig",
      "Dejan Grubisic",
      "Leopold Haller",
      "Letong Hong",
      "Andranik Kurghinyan",
      "Kenny Lau",
      "Hugh Leather",
      "Seewoo Lee",
      "Aram Markosyan",
      "Ken Ono",
      "Manooshree Patel",
      "Gaurang Pendharkar",
      "Vedant Rathi",
      "Alex Schneidman",
      "Volker Seeker",
      "Shubho Sengupta",
      "Ishan Sinha",
      "Jimmy Xin",
      "Jujian Zhang"
    ],
    "title": "Almost all primes are partially regular",
    "abstract": "For odd primes $p$, we let $K_p:=\\mathbb{Q}(ζ_p)$ be the $p$th cyclotomic field and let $ω$ denote its Teichmuller character. For $α>1/2$, we say that an odd prime $p$ is partially regular if the eigenspaces of the $p$-Sylow subgroup of $\\operatorname{Cl}(K_p)$ under the Galois action vanish for all characters $ω^{p-2k}$ with \\[ 2\\le 2k \\le \\frac{\\sqrt{p}}{(\\log p)^α}. \\] Equivalently, $p\\nmid \\operatorname{num}(B_{2k})$ throughout this range. We prove that a density-one subset of primes is partially regular in this sense. By Leopoldt reflection, this yields a partial Vandiver Theorem: for a density-one set of primes $p$, the even eigenspaces $A_p(ω^{2k})$ vanish for all even $2k$ satisfying the inequality above. This result has consequences for Kubota-Leopoldt $p$-adic $L$-functions, congruences between cusp forms and Eisenstein series, and $p$-torsion in algebraic $K$-groups. The theorem proving partial regularity for almost all $p$ is fully formalized in Lean/Mathlib and was produced automatically by AxiomProver from a natural-language statement of the conjecture.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05592v1",
    "categories": [
      "math.ST",
      "econ.EM"
    ],
    "authors": [
      "Angelo Garate",
      "Felipe Osorio",
      "Federico Crudu"
    ],
    "title": "An invariant modification of the bilinear form test",
    "abstract": "The invariance properties of certain likelihood-based asymptotic tests as well as their extensions for M-estimation, estimating functions and the generalized method of moments have been well studied. The simulation study reported in Crudu and Osorio [Econ. Lett. 187: 108885, 2020] shows that the bilinear form test is not invariant to one-to-one transformations of the parameter space. This paper provides a set of suitable conditions to establish the invariance property under reparametrization of the bilinear form test for linear or nonlinear hypotheses that arise in extremum estimation which leads to a simple modification of the test statistic. Evidence from a Monte Carlo simulation experiment suggests good performance of the proposed methodology.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05585v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Alexander Clay",
      "Evgeni Dimitrov",
      "Rundong Ding",
      "Alex Fu"
    ],
    "title": "Long-time asymptotics for Airy wanderer line ensembles",
    "abstract": "We investigate the long-time behavior of the Airy wanderer line ensembles, an infinite-parameter family of Brownian Gibbsian line ensembles arising as edge-scaling limits of inhomogeneous models in the Kardar--Parisi--Zhang universality class. These ensembles are governed by sequences of nonnegative parameters that encode the asymptotic slopes of the curves at positive and negative infinity. Our main results characterize the fluctuations around this leading-order behavior and establish functional limit theorems for the ensembles near both ends of the spatial axis.\n  We show that, at a macroscopic level, an Airy wanderer line ensemble organizes into groups of finitely many curves sharing a common asymptotic slope. After appropriate centering and scaling, each such group converges to a Dyson Brownian motion whose dimension equals the size of the group. In the case where only finitely many slope parameters are positive, we further prove a curve separation phenomenon: the upper curves follow deterministic parabolic trajectories, while the remaining lower curves remain globally flat and converge to the classical Airy line ensemble.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05509v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Niklas Müller"
    ],
    "title": "Characterising Ball Quotients through their (higher) Chern Numbers",
    "abstract": "In this short note we provide a characterisation of ball quotients among all minimal smooth projective varieties of general type purely in terms of their characteristic numbers. This generalises earlier work of Miyaoka, Yau and Greb--Kebekus--Peternell--Taji.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05462v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kuo Shang",
      "Chen Yuan",
      "Ruiqi Zhu"
    ],
    "title": "Explicit List-Decodable Linearized Reed-Solomon Subspace Codes via Subspace Designs",
    "abstract": "The sum-rank metric is the mixture of the Hamming and rank metrics. The sum-rank metric found its application in network coding, locally repairable codes, space-time coding, and quantum-resistant cryptography. Linearized Reed-Solomon (LRS) codes are the sum-rank analogue of Reed-Solomon codes and strictly generalize both Reed-Solomon and Gabidulin codes.\n  In this work, we construct an explicit family of $\\mathbb{F}_h$-linear sum-rank metric codes over arbitrary fields $\\mathbb{F}_h$. Our construction enables efficient list decoding up to a fraction $ρ$ of errors in the sum-rank metric with rate $1-ρ-\\varepsilon$, for any desired $ρ\\in (0,1)$ and $\\varepsilon>0$. Our codes are subcodes of LRS codes, obtained by restricting message polynomials to an $\\mathbb{F}_h$-subspace derived from subspace designs, and the decoding list size is bounded by $h^{\\mathrm{poly}(1/\\varepsilon)}$.\n  Beyond the standard LRS setting, we further extend our linear-algebraic decoding framework to folded Linearized Reed-Solomon (FLRS) codes. We show that folded evaluations satisfy appropriate interpolation conditions and that the corresponding solution space forms a low-dimensional, structured affine subspace. This structure enables effective control of the list size and yields the first explicit positive-rate FLRS subcodes that are efficiently list decodable beyond the unique-decoding radius. To the best of our knowledge, this also constitutes the first explicit construction of positive-rate sum-rank metric codes that admit efficient list decoding beyond the unique decoding radius, thereby providing a new general framework for constructing efficiently decodable codes under the sum-rank metric.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05457v1",
    "categories": [
      "math.OC",
      "math.FA"
    ],
    "authors": [
      "Rafael Correa",
      "Abderrahim Hantoute",
      "Marco A. López"
    ],
    "title": "Relaxation in infinite convex programming under Slater-type regularity conditions",
    "abstract": "The main purpose of this paper is to close the gap between the optimal values of an infinite convex program and that of its biconjugate relaxation. It is shown that Slater and continuity-type conditions guarantee such a zero-duality gap. The approach uses calculus rules for the conjugation and biconjugation of the sum and pointwise supremum operations. A second important objective of this work is to exploit these results on relaxation by applying them in the context of duality theory.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05436v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Anton Gjokaj",
      "David Kalaj"
    ],
    "title": "Lipschitz regularity of harmonic quasiconformal maps between Lyapunov domains in $\\mathbb{R}^n$",
    "abstract": "We prove that every sense-preserving harmonic $K$--quasiconformal homeomorphism $f\\colon D\\toΩ$ between Lyapunov domains (equivalently, bounded $C^{1,α}$ domains) in $\\mathbb{R}^n$, $α\\in(0,1]$, is globally Lipschitz on $\\overline D$. The argument is based on a boundary iteration scheme: an initial Hölder modulus for the boundary trace (coming from quasiconformality) is improved via the $C^{1,α}$ graph representation of $\\partialΩ$, yielding higher Hölder regularity for the normal component. This boundary gain is converted into a near-boundary gradient bound for harmonic functions through a basepoint boundary Hölder-to-gradient estimate obtained by flattening the boundary and using local harmonic-measure bounds. Quasiconformality then propagates the resulting control from one component to the full differential, and iteration gives boundedness of $|Df|$ up to the boundary. Along the way we briefly survey several standard tools from the theory of quasiconformal harmonic mappings (QCH), including boundary Hölder continuity, distortion of derivatives, and boundary-to-interior propagation principles that enter the iteration.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05328v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yihong Du",
      "Zhuo Ma",
      "Zhi-Cheng Wang"
    ],
    "title": "Precise propagation profile for some monostable free boundary problems in time-periodic media",
    "abstract": "We consider reaction-diffusion equations of the form \\begin{equation*} u_t - d u_{xx} = f(t,u), \\quad t>0,\\ \\ x \\in [g(t), h(t)], \\end{equation*} where $f(t,u)$ is periodic in $t$ and monostable in $u$, and the interval $[g(t), h(t)]$ represents the one dimensional population range of a species with density $u(t,x)$ at time $t$ and spatial location $x$. The free boundaries $x=g(t)$ and $x=h(t)$ evolve subject to a ``preferred population density\" condition at the habitat edges. Analogous to the traveling wave solutions in the corresponding Cauchy problem, semi-wave solutions play a fundamental role in understanding the propagation phenomena governed by the free boundary problem here. But in contrast to the Cauchy problem, where the KPP condition plays a subtle role in the precise approximation of its solution (with compactly supported initial function) by the traveling wave solution with minimal speed, here we prove the existence and uniqueness of a semi-wave in a general monostable setting, and obtain a precise description of the convergence of the solution toward the semi-wave as time goes to infinity, where the KPP condition plays no special role. Previously, such a sharp result was proved for a free boundary model only when $f$ is autonomous ($f=f(u)$, see \\cite{D} or \\cite{DL15} for a related free boundary model), or a less precise result was obtained in the time-periodic case under an extra strong KPP condition on $f$ (see \\cite{MDW}, or \\cite{DGP} for a related free boundary model). This work appears to be the first to prove the sharp convergence result for a general monostable free boundary problem in a heterogeneous environment, and we believe the methods developed here should have applications to related free boundary problems in heterogeneous media with nonlinearities more general than those of KPP type.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05306v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Macarena Navarro",
      "Willem-Jan van Hoeve",
      "Karan Singh"
    ],
    "title": "Inverse Optimization Without Inverse Optimization: Direct Solution Prediction with Transformer Models",
    "abstract": "We present an end-to-end framework for generating solutions to combinatorial optimization problems with unknown components using transformer-based sequence-to-sequence neural networks. Our framework learns directly from past solutions and incorporates the known components, such as hard constraints, via a constraint reasoning module, yielding a constrained learning scheme. The trained model generates new solutions that are structurally similar to past solutions and are guaranteed to respect the known constraints. We apply our approach to three combinatorial optimization problems with unknown components: the knapsack problem with an unknown reward function, the bipartite matching problem with an unknown objective function, and the single-machine scheduling problem with release times and unknown precedence constraints, with the objective of minimizing average completion time. We demonstrate that transformer models have remarkably strong performance and often produce near-optimal solutions in a fraction of a second. They can be particularly effective in the presence of more complex underlying objective functions and unknown implicit constraints compared to an LSTM-based alternative and inverse optimization.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05303v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Xiaoling Chai",
      "Shimpei Kobayashi",
      "Changping Wang",
      "Zhenxiao Xie"
    ],
    "title": "Two classes of Willmore Surfaces in $\\mathbb{S}^2\\times \\mathbb{S}^2$",
    "abstract": "We establish two classification theorems for Willmore surfaces in $\\mathbb{S}^2 \\times \\mathbb{S}^2$. Firstly, we prove that a Willmore surface which is also minimal must be either a special complex curve given by a slice or a diagonal; or, a minimal surface in a totally geodesic submanifold $\\mathbb{S}^2 \\times \\mathbb{S}^1$ described by a solution of the sinh-Gordon equation in one variable. Secondly, we demonstrate that a Willmore surface is of product type if and only if it is the product of an elastic curve in $\\mathbb{S}^2$ and a great circle.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05284v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yves Aubry",
      "Christelle Vincent"
    ],
    "title": "Inseparable endomorphisms and rank-2 sublattices of the Gross lattice",
    "abstract": "We answer a question posed by Love asking about a correspondence between isogenies from a supersingular elliptic curve to its Frobenius base-change and rank-2 sublattices of its Gross lattice. We recast the question as one about the inseparable endomorphisms of the curve, and show that the correspondence holds when the trace of the endomorphism is zero, and may not hold otherwise.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05179v1",
    "categories": [
      "math.OC",
      "cs.DC"
    ],
    "authors": [
      "Jingyi Zhao",
      "Linxin Yang",
      "Haohua Zhang",
      "Tian Ding"
    ],
    "title": "From Sequential to Parallel: Reformulating Dynamic Programming as GPU Kernels for Large-Scale Stochastic Combinatorial Optimization",
    "abstract": "A major bottleneck in scenario-based Sample Average Approximation (SAA) for stochastic programming (SP) is the cost of solving an exact second-stage problem for every scenario, especially when each scenario contains an NP-hard combinatorial structure. This has led much of the SP literature to restrict the second stage to linear or simplified models. We develop a GPU-based framework that makes full-fidelity integer second-stage models tractable at scale. The key innovation is a set of hardware-aware, scenario-batched GPU kernels that expose parallelism across scenarios, dynamic-programming (DP) layers, and route or action options, enabling Bellman updates to be executed in a single pass over more than 1,000,000 realizations. We evaluate the approach in two representative SP settings: a vectorized split operator for stochastic vehicle routing and a DP for inventory reinsertion. Implementation scales nearly linearly in the number of scenarios and achieves a one-two to four-five orders of magnitude speedup, allowing far larger scenario sets and reliably stronger first-stage decisions. The computational leverage directly improves decision quality: much larger scenario sets and many more first-stage candidates can be evaluated within fixed time budgets, consistently yielding stronger SAA solutions. Our results show that full-fidelity integer second-stage models are tractable at scales previously considered impossible, providing a practical path to large-scale, realistic stochastic discrete optimization.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05155v1",
    "categories": [
      "math.OC",
      "math.PR",
      "q-fin.RM"
    ],
    "authors": [
      "Heather N. Fogarty",
      "Sooie-Hoe Loke",
      "Nicholas F. Marshall",
      "Enrique A. Thomann"
    ],
    "title": "Optimal Risk-Sharing Rules in Network-based Decentralized Insurance",
    "abstract": "This paper studies decentralized risk-sharing on networks. In particular, we consider a model where agents are nodes in a given network structure. Agents directly connected by edges in the network are referred to as friends. We study actuarially fair risk-sharing under the assumption that only friends can share risk, and we characterize the optimal signed linear risk-sharing rule in this network setting. Subsequently, we consider a special case of this model where all the friends of an agent take on an equal share of the agent's risk, and establish a connection to the graph Laplacian. Our results are illustrated with several examples.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05072v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yuan-Pon Chen",
      "Olgica Milenkovic",
      "João Ribeiro",
      "Jin Sima"
    ],
    "title": "Correcting Contextual Deletions in DNA Nanopore Readouts",
    "abstract": "The problem of designing codes for deletion-correction and synchronization has received renewed interest due to applications in DNA-based data storage systems that use nanopore sequencers as readout platforms. In almost all instances, deletions are assumed to be imposed independently of each other and of the sequence context. These assumptions are not valid in practice, since nanopore errors tend to occur within specific contexts. We study contextual nanopore deletion-errors through the example setting of deterministic single deletions following (complete) runlengths of length at least $k$. The model critically depends on the runlength threshold $k$, and we examine two regimes for $k$: a) $k=C\\log n$ for a constant $C\\in(0,1)$; in this case, we study error-correcting codes that can protect from a constant number $t$ of contextual deletions, and show that the minimum redundancy (ignoring lower-order terms) is between $(1-C)t\\log n$ and $2(1-C)t\\log n$, meaning that it is a ($1-C$)-fraction of that of arbitrary $t$-deletion-correcting codes. To complement our non-constructive redundancy upper bound, we design efficiently and encodable and decodable codes for any constant $t$. In particular, for $t=1$ and $C>1/2$ we construct efficient codes with redundancy that essentially matches our non-constructive upper bound; b) $k$ equal a constant; in this case we consider the extremal problem where the number of deletions is not bounded and a deletion is imposed after every run of length at least $k$, which we call the extremal contextual deletion channel. This combinatorial setting arises naturally by considering a probabilistic channel that introduces contextual deletions after each run of length at least $k$ with probability $p$ and taking the limit $p\\to 1$. We obtain sharp bounds on the maximum achievable rate under the extremal contextual deletion channel for arbitrary constant $k$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05621v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Felix Meyer"
    ],
    "title": "Global smooth solutions in a one-dimensional thermoviscoelastic model with temperature-dependent paramaters",
    "abstract": "This manuscript is concerned with the system \\begin{align*} \\left\\{ \\begin{array}{l} u_{tt} = (γ(Θ) u_{xt})_x + (a(x,t) u_x)_x +(f(Θ))_x, \\\\[1mm] Θ_t = DΘ_{xx} + γ(Θ) u_{xt}^2 + f(Θ) u_{xt}, \\end{array} \\right. \\end{align*} which is used to describe thermoviscoelastic developments in one-dimensional Kelvin-Voigt materials. \\abs It is assumed that $a,γ$ and $f$ are sufficiently smooth functions that satisfy $$c_γ<γ(ζ)<C_γ, \\quad γ''(ζ) \\le 0,\\quad f(0)=0, \\quad |f'(ζ)|\\le C_f \\quad \\mbox{ and } |f(ζ)|\\le C_f(1+ζ)^α\\quad \\mbox{ for all }ζ\\ge 0 $$ and some positive constants $c_γ,C_γ,C_f>0$ and $α\\in (0,5/6)$. Under these conditions, this study then establishes a result on the existence of global classical solutions for sufficiently smooth but arbitrarily large initial data.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05673v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Noboru Ito",
      "Nodoka Kawajiri"
    ],
    "title": "Genera of two-component alternating links",
    "abstract": "We extend the equality-type results of Ito--Takimura and Kindred for the non-orientable genera of alternating knots to the setting of two-component alternating links. We show that, for such links, a unified quantity capturing both orientable and non-orientable genera is completely determined by the splice sequence realizing the splice-unknotting number up to an explicit correction term.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05632v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "José A. Carrillo",
      "Yurij Salmaniw",
      "Antonio León Villares"
    ],
    "title": "Numerical stationary states for nonlocal Fokker-Planck equations via fixed points of consistency maps",
    "abstract": "We propose a fixed-point-based numerical framework for computing stationary states of nonlocal Fokker-Planck-type equations. Instead of discretising the differential operators directly, we reformulate the stationary problem as a nonlinear fixed-point map built from the original PDE and its nonlocal interaction terms, and solve the resulting finite-dimensional problem with a matrix-free Newton-Krylov method. We compare implementations using the analytic Frechet derivative of this map with a simple central-difference approximation. Because the method does not rely on time evolution, it is agnostic to dynamical stability and can detect both stable and unstable stationary states. Its accuracy is determined mainly by the numerical treatment of convolutions and quadrature, rather than by differentiation stencils. We apply the approach to three model problems with linear diffusion, use existing analytical results to verify the outputs, and reproduce known bifurcation diagrams, as well as new bifurcation behaviour not previously observed in this kind of problem.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05620v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Dag Normann",
      "Sam Sanders"
    ],
    "title": "On the computational properties of ambivalent sets and functions",
    "abstract": "Examples of discontinuous functions already appear in the work of Euler, Abel, Dirichlet, Fourier, and Bolzano. A ground-breaking discovery due to Baire was that many discontinuous functions are well-behaved in that they are the pointwise limit of a sequence of continuous functions; the latter form a class nowadays simply called `Baire 1'. We shall study a class strictly between the semi-continuous and Baire 1 functions, called the ambivalent fuctions. In particular, we investigate the computational properties of the class of ambivalent functions and sets, denoted $\\bf Δ$, working with Kleene's S1-S9 schemes. Computational equivalences for various standard operations (supremum, Baire 1 representation, \\dots) on $\\bf Δ$ are established, including the structure functional $Ω_{\\bf Δ}$ that decides if a given ambivalent set is non-empty. A selector is shown to be computable relative to $Ω_{\\bf Δ}$ and Kleene's quantifier $\\exists^{2}$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05618v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Jakub Curda",
      "Daniel Drimbe"
    ],
    "title": "Examples of W$^*$ and C$^*$-superrigid product groups",
    "abstract": "We provide a new large class $\\mathcal C_{AFP}$ of amalgamated free product groups for which the product rigidity result from [CdSS15] holds: if $G_1,\\dots,G_n\\in\\mathcal C_{AFP}$ and $H$ is any group such that $L(G_1\\times\\dots\\times G_n)\\cong L(H)$, then there exists a product decomposition $H=H_1\\times\\dots\\times H_n$ such that $L(H_i)$ is stably isomorphic to $L(G_i)$, for any $1\\leq i\\leq n$. The class $\\mathcal C_{AFP}$ contains $W^*$ and $C^*$-superrigid groups from [CD-AD20]. Consequently, we obtain examples of product groups that are both $W^*$ and $C^*$-superrigid.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05498v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yiming Jiang",
      "Yawei Wei",
      "Yiyun Yang"
    ],
    "title": "Regularity results for linear parabolic equations on Carnot tori via mollifier kernel construction",
    "abstract": "This paper first proves the existence, uniqueness and regularity of the solution to a class of linear backward parabolic equations on Carnot tori, namely the periodic linear parabolic equation on Carnot groups. Such groups are non-commutative and typical examples of sub-Riemannian manifolds. Moreover, we apply the results for this equation to its dual equation (i.e., the Fokker-Planck-Kolmogorov equation in the general form), and derive the existence, uniqueness and regularity of its weak solution. To obtain the regularity results for solutions to the linear parabolic equation and its dual equation, firstly, we construct several families of mollifiers adapted respectively to the Hörmander vector fields generating Carnot groups, Carnot tori and dual spaces of non-isotropic Hölder spaces; secondly, we use the theory of singular integral operators to establish stronger a priori regularity for the solutions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05417v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Mattia Solla",
      "Johannes O. Royset"
    ],
    "title": "Optimistic Bilevel Optimization with Composite Lower-Level Problem",
    "abstract": "This paper introduces a novel double regularization scheme for bilevel optimization problems whose lower-level problem is composite and convex, but not necessarily strongly convex, in the lower-level variable. The analysis focuses on the primal-dual solution mapping of the regularized lower-level problem and exploits its properties to derive an almost-everywhere formula for the gradient of the regularized hyper-objective under mild assumptions. The paper then establishes conditions under which the hyper-objective of the actual problem is well defined and shows that its gradient can be approximated by the gradient of the regularized hyper-objective. Building on these results, a gradient sampling-based algorithm computes approximately stationary points of the regularized hyper-objective, and we prove its convergence to stationary points of the actual problem. Two numerical examples from machine learning demonstrate the proposed approach.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05409v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Marek Janasz"
    ],
    "title": "On the boundedness of some real line arrangements of type at most one",
    "abstract": "In this note, we show that real line arrangements of type at most one, admitting only intersection points of multiplicity at most five, satisfy certain boundedness properties. In particular, we prove that a free real arrangement of $d$ lines with intersection multiplicities bounded by $5$ can have at most $522$ lines and consequently there exist only finitely many combinatorial types of such arrangements.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05405v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Yi Chen",
      "Li Ming",
      "Chong Han"
    ],
    "title": "Enabling Large-Scale Channel Sounding for 6G: A Framework for Sparse Sampling and Multipath Component Extraction",
    "abstract": "Realizing the 6G vision of artificial intelligence (AI) and integrated sensing and communication (ISAC) critically requires large-scale real-world channel datasets for channel modeling and data-driven AI models. However, traditional frequency-domain channel sounding methods suffer from low efficiency due to a prohibitive number of frequency points to avoid delay ambiguity. This paper proposes a novel channel sounding framework involving sparse nonuniform sampling along with a likelihood-rectified space-alternating generalized expectation-maximization (LR-SAGE) algorithm for multipath component extraction. This framework enables the acquisition of channel datasets that are tens or even hundreds of times larger within the same channel measurement duration, thereby providing the massive data required to harness the full potential of AI scaling laws. Specifically, we propose a Parabolic Frequency Sampling (PFS) strategy that non-uniformly distributes frequency points, effectively eliminating delay ambiguity while reducing sampling overhead by orders of magnitude. To efficiently extract multipath components (MPCs) from the channel data measured by PFS, we develop a LR-SAGE algorithm, rectifying the likelihood distortion caused by nonuniform sampling and molecular absorption effect. Simulation results and experimental validation at 280--300~GHz confirm that the proposed PFS and LR-SAGE algorithm not only achieve 50$\\times$ faster measurement, a 98\\% reduction in data volume and a 99.96\\% reduction in post-processing computational complexity, but also successfully captures MPCs and channel characteristics consistent with traditional exhaustive measurements, demonstrating its potential as a fundamental enabler for constructing the massive ISAC datasets required by AI-native 6G systems.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05402v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Qimai Sun",
      "Guangwa Wang",
      "Wanlou Wu"
    ],
    "title": "On the Density of Periodic Measures for Star Vector Fields",
    "abstract": "In this paper, we prove that every ergodic hyperbolic invariant measure of a $C^1$ star vector field can be approximated by periodic measures in weak$^*$ topology. This extends a classical result of Katok \\cite{Ka} for $C^{1+α}(α>0)$ diffeomorphisms to $C^1$ star vector field of any dimension.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05341v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Kyoungjin Jung",
      "Jae Yong Lee",
      "Dongwook Shin"
    ],
    "title": "Numerically Informed Convolutional Operator Network with Subproblem Decomposition for Poisson Equations",
    "abstract": "Neural operators have shown remarkable performance in approximating solutions of partial differential equations. However, their convergence behavior under grid refinement is still not well understood from the viewpoint of numerical analysis. In this work, we propose a numerically informed convolutional operator network, called NICON, that explicitly couples classical finite difference and finite element methods with operator learning through residual-based training loss functions. We introduce two types of networks, FD-CON and FE-CON, which use residual-based loss functions derived from the corresponding numerical methods. We derive error estimates for FD-CON and FE-CON using finite difference and finite element analysis. These estimates show a direct relation between the convergence behavior and the decay rate of the training loss. From these analyses, we establish training strategies that guarantee optimal convergence rates under grid refinement. Several numerical experiments are presented to validate the theoretical results and show performance on fine grids.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05317v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.AP"
    ],
    "authors": [
      "Le Chen",
      "Cheuk Yin Lee",
      "Panqiu Xia"
    ],
    "title": "Strong local nondeterminism for stochastic time-fractional slow and fast diffusion equations",
    "abstract": "We study a class of stochastic time-fractional equations on $\\mathbb{R}^d$ driven by a centered Gaussian noise, involving a Caputo time derivative of order $β>0$, a fractional (power) Laplacian of order $α>0$, and a Riemann-Liouville time integral of order $γ\\ge0$ acting on the noise. The noise is fractional in time (index $H$) and Riesz-type in space (index $\\ell$). We derive sharp Dalang-type necessary and sufficient conditions for the existence of a random field solution across almost full parameter range $(α,β,γ;H,\\ell)$. Under the Dalang-type conditions, we prove sharp variance bounds for temporal and spatial increments, as well as strong local nondeterminism in time in several regimes (two-sided version for $β=1$ and for parts of the case $β=2$; one-sided version for $0<β<2$) and strong local nondeterminism in space for the whole range of parameters. As applications, we derive exact uniform and local moduli of continuity, Chung-type laws of the iterated logarithm, and quantitative bounds on small ball probabilities. Along the way, we obtain sharp asymptotics for the fundamental solution kernels at $0$ and $\\infty$, which may be of independent interest.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05294v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "math.PR"
    ],
    "authors": [
      "Qidong He"
    ],
    "title": "Unified criteria for crystallization in hard-core lattice systems with applications to polyomino fluids and chiral mixtures",
    "abstract": "We present a unified extension of two sets of criteria for high-fugacity crystallization in hard-core lattice systems developed previously by Jauslin, Lebowitz, and the author. Our new criterion is formulated in terms of the existence of a volume allocation rule with desirable properties, in analogy to the scoring function constructed in Hales' proof of the Kepler conjecture. The proof uses a recent systematic extension of Pirogov--Sinai theory to systems with infinite interactions by Mazel--Stuhl--Suhov. Notably, our result applies to a large class of polyomino models with discrete rotational degrees of freedom and chiral mixtures thereof.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05272v1",
    "categories": [
      "math.ST",
      "math.PR",
      "stat.ML"
    ],
    "authors": [
      "Ashwin Ram",
      "Aaditya Ramdas"
    ],
    "title": "Asymptotically optimal sequential change detection for bounded means",
    "abstract": "We consider the problem of quickest changepoint detection under the Average Run Length (ARL) constraint where the pre-change and post-change laws lie in composite families $\\mathscr{P}$ and $\\mathscr{Q}$ respectively. In such a problem, a massive challenge is characterizing the best possible detection delay when the \"hardest\" pre-change law in $\\mathscr{P}$ depends on the unknown post-change law $Q\\in\\mathscr{Q}$. And typical simple-hypothesis likelihood-ratio arguments for Page-CUSUM and Shiryaev-Roberts do not at all apply here. To that end, we derive a universal sharp lower bound in full generality for any ARL-calibrated changepoint detector in the low type-I error ($γ\\to\\infty$ regime) of the order $\\log(γ)/\\mathrm{KL}_{\\mathrm{inf}}(Q,\\mathscr{P})$. We show achievability of this universal lower bound by proving a tight matching upper bound (with the same sharp $\\logγ$ constant) in the important bounded mean detection setting. In addition, for separated mean shifts, we also we derive a uniform minimax guarantee of this achievability over the alternatives.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05203v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Guozhen Lu",
      "Chunxia Tao"
    ],
    "title": "Existence and symmetry of extremals for the high order Hardy-Sobolev-Maz'ya inequalities",
    "abstract": "In this article, we establish the existence of an extremal function for the k-th order critical Hardy-Sobolev-Maz'ya (HSM) inequalities on the upper half space $\\mathbb{R}^{n+1}_{+}$ when $k\\ge 2$ and $n\\geq 2k+2$:\n  $$\\int_{\\mathbb{R}^{n}_{+}}|\\nabla^{k}u|^2dx-\\prod_{i=1}^{k}\\frac{\\left(2i-1\\right)^2}{4}\\int_{\\mathbb{R}^{n}_{+}}\\frac{u^2}{x_1^{2k}}dx\\geq C_{n,k,\\frac{2n}{n-2k}} \\left(\\int_{\\mathbb{R}^{n}_{+}}|u|^{\\frac{2n}{n-2k}}dx\\right)^{\\frac{n-2k}{n}}. $$\n  The analysis of this extremal problem is challenging due to the presence of the higher order derivatives, the lack of translation invariance, the inapplicability of rearrangement techniques on the upper half-space, and the presence of a Hardy singularity along the boundary. To overcome these difficulties, instead of directly considering the HSM inequality on the upper half space, we establish the existence of an extremal for its equivalent version: Poincaré-Sobolev inequality on the hyperbolic space. We develop a novel duality theory of the minimizing sequences, the concentration-compactness principle for radial functions in the hyperbolic setting, which combines with the Helgason-Fourier analysis and the Riesz rearrangement inequality on the hyperbolic space, to resolve the lack of compactness issue. As an application, we also obtain the existence of positive symmetric solutions for the high order Brezis-Nirenberg equation on the entire hyperbolic space associated with the GJMS operators $P_k$ (i.e., when $k\\ge 2$): $$ P_{k}\\left(f\\right)-αf=|f|^{p-2}f $$ at the critical situation $α=\\prod\\limits_{i=1}^{k}\\frac{\\left(2i-1\\right)^2}{4}$ when either $2k+2\\leq n$ and $p=\\frac{2n}{n-2k}$ or $2k<n$ and $2<p<\\frac{2n}{n-2k}$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05071v1",
    "categories": [
      "math.DS",
      "q-bio.PE"
    ],
    "authors": [
      "Tung D. Nguyen",
      "Zhisheng Shuai",
      "Tingting Tang",
      "Amy Veprauskas",
      "Yixiang Wu",
      "Ying Zhou"
    ],
    "title": "Optimal Harvesting in Stream Networks: Maximizing Biomass and Yield",
    "abstract": "In this study, we develop a metapopulation model framework to identify optimal harvesting strategies for a population in a stream network. We consider two distinct optimization objectives: maximization of total biomass and maximization of total yield, under the constraint of a fixed total harvesting effort. We examine in detail the special case of a two-patch network and fully characterize the optimal strategies for each objective. We show that when the population growth rate exceeds a critical threshold, a single harvesting strategy can simultaneously maximize both objectives. For general $n$-patch networks with homogeneous growth rates across patches, we focus on the regime of large growth rates and demonstrate that the optimal harvesting strategy selects patches according to their intraspecific competition rates and an effective net flow metric determined by network connectivity parameters.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05020v1",
    "categories": [
      "math.OC",
      "math.DS"
    ],
    "authors": [
      "Lars Grüne",
      "Mario Sperl"
    ],
    "title": "Decaying Sensitivity of the Zero Solution for a Class of Nonlinear Optimal Control Problems",
    "abstract": "We study spatial decay properties of sensitivities in a nonlinear optimal control problem with a graph--structured interaction topology. For a problem with nonlinear decoupled dynamics and quadratic cost, we show that a localized perturbation of the zero reference leads to an optimal trajectory that decays exponentially with the graph distance. The analysis, based on a nonlinear controllability condition, provides a first step toward extending known spatial decay results from linear--quadratic to nonlinear systems. A numerical example illustrates the theoretical findings.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05011v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Xuting Gao",
      "Guillem Pascual",
      "Scott Brown",
      "Sonia Martínez"
    ],
    "title": "Banach Control Barrier Functions for Large-Scale Swarm Control",
    "abstract": "This paper studies the safe control of very large multi-agent systems via a generalized framework that employs so-called Banach Control Barrier Functions (B-CBFs). Modeling a large swarm as probability distribution over a spatial domain, we show how B-CBFs can be used to appropriately capture a variety of macroscopic constraints that can integrate with large-scale swarm objectives. Leveraging this framework, we define stable and filtered gradient flows for large swarms, paying special attention to optimal transport algorithms. Further, we show how to derive agent-level, microscopical algorithms that are consistent with macroscopic counterparts in the large-scale limit. We then identify conditions for which a group of agents can compute a distributed solution that only requires local information from other agents within a communication range. Finally, we showcase the theoretical results over swarm systems in the simulations section.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05003v1",
    "categories": [
      "math.GT",
      "math.AT"
    ],
    "authors": [
      "Ian Hambleton",
      "Ozgun Unlu"
    ],
    "title": "Closed manifold surgery obstructions and the Oozing Conjecture",
    "abstract": "We complete the description of surgery obstructions up to homotopy equivalence for closed oriented manifolds with finite fundamental group. New examples are presented of non-trivial obstructions for Arf invariant product formulas in codimensions $\\geq 4$, which give counterexamples to the well-known ''Oozing Conjecture'' from the 1980's.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.04988v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Weizhu Bao",
      "Caoyi Liu"
    ],
    "title": "A uniformly accurate multiscale time integrator for the nonlinear Klein-Gordon equation in the nonrelativistic regime via simplified transmission conditions",
    "abstract": "We propose a new and simplified multiscale time integrator Fourier pseudospectral (MTI-FP) method for the nonlinear Klein-Gordon equation (NKGE) with a dimensionless parameter epsilon in (0,1] inversely proportional to the speed of light, and establish its uniform first-order accuracy in time in the nonrelativistic regime, i.e. 0 < epsilon << 1. In this regime, the solution of the NKGE is highly oscillatory in time with O(epsilon^2)-wavelength, which brings significant difficulties in designing uniformly accurate numerical methods. The MTI-FP is based on (i) a multiscale decomposition by frequency of the NKGE in each time interval with simplified transmission conditions, and (ii) an exponential wave integrator for temporal discretization and a Fourier pseudospectral method for spatial discretization. By adapting the energy method and the mathematical induction, we obtain two error bounds in H1-norm at O(h^{m0}+tau^2/epsilon^2) and O(h^{m0}+tau+epsilon^2) with mesh size h, time step tau and m0 an integer dependent on the regularity of the solution, which immediately implies a uniformly accurate error bound O(h^{m0}+tau) with respect to epsilon in (0,1]. In addition, by adopting a linear interpolation of the micro variables with the multiscale decomposition in each time interval, we obtain a uniformly accurate numerical solution for any time t larger than zero. Thus the proposed MTI-FP method has a super resolution property in time in terms of the Shannon sampling theory, i.e. accurate numerical solutions can be obtained even when the time step is much bigger than the O(epsilon^2)-wavelength. Extensive numerical results are reported to confirm our error bounds and demonstrate their super resolution in time. Finally the proposed MTI-FP method is applied to study numerically convergence rates of the NKGE to its different limiting models in the nonrelativistic regime.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.04978v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Siyan Daniel Li-Huerta"
    ],
    "title": "Courbes et fibrés vectoriels en théorie de Hodge $z$-adique globale",
    "abstract": "We study the global analogue of the Fargues-Fontaine curve over function fields $F$. We prove some foundational results about its moduli of $G$-bundles $\\operatorname{Bun}_{G,F}$, which is a geometrization of the global Kottwitz set $B(F,G)$. For example, $\\operatorname{Bun}_{G,F}$ plays the role of Igusa stacks over function fields. We use $\\operatorname{Bun}_{G,F}$ to reformulate the global Langlands conjecture for $G$ over $F$ in terms of categorical local Langlands, refining conjectures of Arinkin-Gaitsgory-Kazhdan-Raskin-Rozenblyum-Varshavsky and Zhu. Finally, we verify this conjecture when $G$ is commutative. Along the way, we prove a GAGA theorem for smooth proper schemes over sousperfectoid spaces, which is of independent interest.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05076v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Trung Chau",
      "Art Duval",
      "Sara Faridi",
      "Thiago Holleben",
      "Susan Morey",
      "Liana Şega"
    ],
    "title": "Symbolic powers and integral closures via extremal ideals",
    "abstract": "This paper demonstrates that extremal ideals can be used to great effect to compute integral closures of powers and symbolic powers of square-free monomial ideals. We show that the generators of these powers are images of the generators of the corresponding powers of extremal ideals under a specific ring homomorphism.\n  Extremal ideals provide sharp bounds for a variety of invariants widely studied in the literature, including resurgence, asymptotic resurgence, and symbolic defect, as well as Betti numbers of symbolic powers and of integral closures of powers of square-free monomial ideals. When restricted to the class of extremal ideals, algebraic computations are reduced to problems of discrete geometry and linear programming, allowing the use of a wide variety of techniques.\n  As a result, in situations where computations are feasible for extremal ideals, we provide concrete sharp bounds for many of these invariants. Our methods reduce finding homological invariants and algebraic constructions for infinitely many ideals to computations for a single highly symmetric ideal, based solely on the number of generators.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.06010v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Mattia Calzi",
      "Elena Rizzo"
    ],
    "title": "Vector-Valued Singular Integrals on Locally Doubling Spaces",
    "abstract": "We prove vector-valued boundedness of (suitable) Calderon-Zygmund operators and of the (truncated) Hardy-Littlewood maximal function on a connected locally doubling metric measure space.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05942v1",
    "categories": [
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Jonathan Rau",
      "Marvin R. Schulz"
    ],
    "title": "On the Efimov Effect for Four Particles in Dimension Two",
    "abstract": "We prove that the Schrödinger operator describing four particles in two dimensions, interacting solely through short-range three-body forces, can possess infinitely many bound states. This holds under the assumption that each three-body subsystem has a virtual level at zero energy. Our result establishes an analog of the Efimov effect for such four-particle systems in two dimensions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05906v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Javad A. Asadzade",
      "Jasarat J. Gasimov",
      "Nazim I. Mahmudov",
      "Ismail T. Huseynov"
    ],
    "title": "Explicit representation of solutions to a linear wave equation with time delay",
    "abstract": "This paper develops an explicit spectral representation for solutions of a one-dimensional linear wave equation with a constant time delay. The model is considered on a bounded interval with non-homogeneous Dirichlet boundary data and a prescribed history function. To accommodate the loss of global smoothness in time caused by delay terms, solutions are understood in a \\textit{stepwise classical sense}, allowing jump discontinuities in the second time derivative at multiples of the delay while maintaining continuity of the solution and its first time derivative.\n  By combining separation of variables with Sturm-Liouville expansions, the delayed PDE is reduced to a family of scalar second-order delay differential equations. Using delay-dependent fundamental solutions, we derive closed-form representation formulas for the modal dynamics and reconstruct the PDE solution as a Fourier series. Convergence conditions guaranteeing uniform convergence and admissibility of termwise differentiation in space are established. A numerical example demonstrates the practical computation of truncated series solutions and their visualization.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05898v1",
    "categories": [
      "math.PR",
      "cs.LG",
      "q-fin.MF"
    ],
    "authors": [
      "Mihriban Ceylan",
      "Anna P. Kwossek",
      "David J. Prömel"
    ],
    "title": "Universal approximation with signatures of non-geometric rough paths",
    "abstract": "We establish a universal approximation theorem for signatures of rough paths that are not necessarily weakly geometric. By extending the path with time and its rough path bracket terms, we prove that linear functionals of the signature of the resulting rough paths approximate continuous functionals on rough path spaces uniformly on compact sets. Moreover, we construct the signature of a path extended by its pathwise quadratic variation terms based on general pathwise stochastic integration à la Föllmer, in particular, allowing for pathwise Itô, Stratonovich, and backward Itô integration. In a probabilistic setting, we obtain a universal approximation result for linear functionals of the signature of continuous semimartingales extended by the quadratic variation terms, defined via stochastic Itô integration. Numerical examples illustrate the use of signatures when the path is extended by time and quadratic variation in the context of model calibration and option pricing in mathematical finance.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05893v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Marianna De Santis",
      "Gabriele Eichfelder",
      "Margherita Porcelli"
    ],
    "title": "Objective-Function Free Multi-Objective Optimization: Rate of Convergence and Performance of an Adagrad-like algorithm",
    "abstract": "We propose an Adagrad-like algorithm for multi-objective unconstrained optimization that relies on the computation of a common descent direction only. Unlike classical local algorithms for multi-objective optimization, our approach does not rely on the dominance property to accept new iterates, which allows for a flexible and function-free optimization framework. New points are obtained using an adaptive stepsize that does not require neither knowledge of Lipschitz constants nor the use of line search procedures. The rate of convergence is analyzed and is shown to be $\\mathcal{O}(1 / \\sqrt{ k+1})$ with respect to the norm of the common descent direction. The method is extensively validated on a broad class of unconstrained multi-objective problems and simple multi-task learning instances, and compared against a first-order line search algorithm. Additionally, we present a preliminary study of the behavior under noisy multi-objective settings, highlighting the robustness of the method.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05866v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Anand Pillay"
    ],
    "title": "Remarks on relative categoricity",
    "abstract": "We make some elementary observations about relative categoricity and the Gaifman property. T will be a complete theory in a countable language L with a distinguished unary predicate P. We will assume L is relational and T has quantifier elimination. For M a model of of T, M^P is the substructure of M with universe P(M), and T^P is the common L-theory of these M^P. T is said to be relatively categorical if for any models M_1, M_2 of T any isomorphism between M_1^P and M_2^P lifts to an isomorphism between M_1 and M_2. T has the Gaifman property (or P-existence) if every model of T^P is of the form M^P for a model M of T. It was conjectured that if T is relatively categorical then T has the Gaifman property. T is said to be relatively (omega, omega) categorical if relative categoricity holds when restricted to countable models of T. We observe that (i) if T is relatively (omega, omega) categorical then any model of T^P of cardinality at most aleph_1 is of the form M^P for M a model of T, and (ii) if in addition every model M of T is in the algebraic closure of P(M) together with a (finite) subset of M, then T is relatively categorical and has the Gaifman property.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05851v1",
    "categories": [
      "math.RT",
      "math.RA"
    ],
    "authors": [
      "Changchang Xi"
    ],
    "title": "Ringel's contributions to quasi-hereditary algebras",
    "abstract": "Quasi-hereditary algebras were introduced by Cline, Parshall and Scott to describe the highest weight categories of representations of semisimple Lie algebras and algebraic groups by the module categories of finite-dimensional algebras. Since then a lot of homological, structural and categorical properties of quasi-hereditary algebras have been discovered. This class of algebras seems quite common and occurs in many branches of mathematics. There are lots of important works on the subject. In this note we mainly survey some of Claus Michael Ringel's works or works jointly with his collaborators on quasi-hereditary algebras. Also, some of related works and recent developments on quasi-hereditary algebras are mentioned.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05795v1",
    "categories": [
      "math.CV",
      "math.DG"
    ],
    "authors": [
      "Jaan Amla Srimurthy",
      "Kyle Huang",
      "Jinwoo Park",
      "Aleksander Skenderi",
      "Ruo Wen",
      "Andrew Zimmer"
    ],
    "title": "Rigidity of proper holomorphic maps between balls with Hölder boundary regularity",
    "abstract": "In this paper, we prove a rigidity result for proper holomorphic maps between unit balls that have many symmetries and which extend to Hölder continuous maps on the boundary, with Hölder exponent strictly greater than 1/2.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05753v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Jonathan Washburn",
      "Milan Zlatanović"
    ],
    "title": "Uniqueness of the Canonical Reciprocal Cost",
    "abstract": "We study a rigidity problem for functions \\(F:\\R_{>0}\\to\\R_{\\ge 0}\\) that penalize deviation of a positive ratio from equilibrium \\(x=1\\). Assuming (i) normalization \\(F(1)=0\\), (ii) a d'Alembert-type composition law on \\(\\R_{>0}\\), and (iii) a single quadratic calibration at the identity (in logarithmic coordinates), we prove that \\(F\\) is uniquely determined. The unique solution is called the canonical reciprocal cost, namely the difference between the arithmetic and geometric means of \\(x\\) and its reciprocal.\n  Our proof uses the logarithmic coordinates \\(H(t)=F(e^t)+1\\), where the composition law becomes d'Alembert's functional equation on \\(\\R\\). The calibration provides the minimal regularity needed to invoke the classical classification of continuous solutions and fixes the remaining scaling freedom, selecting the hyperbolic-cosine branch. We also establish necessity of each assumption: without calibration the composition law admits a continuous one-parameter family, without the composition law the calibration does not determine the global form, and without regularity the composition law admits pathological non-measurable solutions. Finally, we establish a stability estimate for approximate solutions under bounded defect and characterize some properties of the canonical cost.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05744v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Guglielmo Beretta",
      "Tommaso Cesari",
      "Roberto Colomboni"
    ],
    "title": "Generalized Pinsker Inequality for Bregman Divergences of Negative Tsallis Entropies",
    "abstract": "The Pinsker inequality lower bounds the Kullback--Leibler divergence $D_{\\textrm{KL}}$ in terms of total variation and provides a canonical way to convert $D_{\\textrm{KL}}$ control into $\\lVert \\cdot \\rVert_1$-control. Motivated by applications to probabilistic prediction with Tsallis losses and online learning, we establish a generalized Pinsker inequality for the Bregman divergences $D_α$ generated by the negative $α$-Tsallis entropies -- also known as $β$-divergences. Specifically, for any $p$, $q$ in the relative interior of the probability simplex $Δ^K$, we prove the sharp bound \\[\n  D_α(p\\Vert q) \\ge \\frac{C_{α,K}}{2}\\cdot \\|p-q\\|_1^2, \\] and we determine the optimal constant $C_{α,K}$ explicitly for every choice of $(α,K)$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05858v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tongkeun Chang",
      "Kyungkeun Kang",
      "Chanhong Min"
    ],
    "title": "Flow reversal of the Stokes system with localized boundary data in the half space",
    "abstract": "We consider the unsteady Stokes system in the half-space with zero initial data and nonzero, space-time localized boundary data. We show that there exist boundary influxes for which the induced flow exhibits flow reversal, in the sense that at least one component of the velocity field changes its sign in the half-space. This phenomenon is demonstrated by a careful analysis of the representation formula for the Stokes system in the half-space, including pointwise estimates, based on the Green tensor with nonzero boundary data. We construct solutions of the Stokes system such that the tangential components of the velocity field exhibit at least one sign change, while the normal component exhibits at least two sign changes. Moreover, the normal component of the constructed velocity field has the opposite sign to the tangential components near the boundary, whereas it has the same sign as the tangential components sufficiently far from the boundary.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05841v1",
    "categories": [
      "math.MG",
      "math.NT"
    ],
    "authors": [
      "Alexander Oertel",
      "Achill Schürmann"
    ],
    "title": "Generalized Perfect Matrices",
    "abstract": "We generalize Voronoi's theory of perfect quadratic forms to generalized copositive matrices over a closed convex and full-dimensional cone K. We introduce a notion of a K-copositive minimum and of perfect K-copositive matrices. We consider a key feature of a given cone, which we call Interior Ryshkov (IR) property. Under this property the classical theory and its applications generalize nicely and we prove that rationally generated cones possess this IR property. For contrast, we give a detailed example of a simple cone without the IR property, showing various differences to the classical case. Moreover, this example yields connections to questions of number theory, in particular to Diophantine approximation and the Pell Equation. Finally, as an application, we give inner and outer polyhedral approximations for the generalized completely positive cone and a method to find rational certificates for (non-)membership in this cone.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05800v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Siyuan Lang",
      "Zhiyue Zhang"
    ],
    "title": "A Perturbation-Correction Method Based on Local Randomized Neural Networks for Quasi-Linear Interface Problems",
    "abstract": "For quasi-linear interface problems with discontinuous diffusion coefficients, the nonconvex objective functional often leads to optimization stagnation in randomized neural network approximations. This paper Proposes a perturbation-correction framework based on Loacal Randomized Neural Networks(LRaNNs) to overcome this limitation. In the initialization step, a satisisfactory based approximation is obtained by minimizing the original nonconvex residual, typically stagnating at a moderate accuracy level. Subsequently, in the correction step, a correction term is determined by solving a subproblem governed by a perturbation expansion around the base approximation. This reformulation yields a convex optimization problem for the output coefficients, which guarantees rapic convergence. We rigorously derive an a posteriori error estitmate, demonstrating that the total generalization error is governed by the discrete residual norm, quadrature error, and a controllable truncation error. Numerical experiments on nonlinear diffusion problems with irregular moving interfaces, gradient-dependent diffusivities, and high-contrast media demonstrate that the proposed method effectively overcomes the optimization plateau. The correction step yields a significant improvement of 4-6 order of magnitude in L^2 accuracy.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05788v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Hwanyup Jung"
    ],
    "title": "Mertens products in arithmetic progressions over function fields",
    "abstract": "We establish a function field analogue of Mertens' formula for Euler products restricted to primes in arithmetic progressions over the polynomial ring F_q[t]. Our results are in direct correspondence with those of Languasco and Zaccagnini for arithmetic progressions in the integers.\n  Over function fields, Weil's Riemann hypothesis for Dirichlet L-functions holds unconditionally, and consequently the analogue of the GRH-strength asymptotic is obtained without any exceptional zero correction term.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05768v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jie Ma",
      "Quanyu Tang"
    ],
    "title": "An Erdős problem on random subset sums in finite abelian groups",
    "abstract": "Let $f(N)$ denote the least integer $k$ such that, if $G$ is an abelian group of order $N$ and $A \\subseteq G$ is a uniformly random $k$-element subset, then with probability at least $\\tfrac12$ the subset-sum set $\\{ \\sum_{x \\in S} x : S \\subseteq A \\}$ equals $G$. In 1965, Erdős and Rényi proved that for all $N$, $$ f(N) \\le \\log_2 N + \\left(\\frac{1}{\\log 2}+o(1)\\right)\\log\\log N. $$ Erdős later conjectured that this bound cannot be improved to $f(N)\\le \\log_2 N+o(\\log\\log N)$. In this paper we confirm this conjecture by showing that, for primes $p$, $$ f(p)\\ge \\log_2 p+\\left(\\frac{1}{2\\log 2}+o(1)\\right)\\log\\log p. $$ This work is an outcome of human--AI collaboration: the original qualitative proof was generated autonomously by ChatGPT-5.2 Pro, while the quantitative refinement was developed by the authors.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05761v1",
    "categories": [
      "math.AC",
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Barbara Betti",
      "Claudiu Raicu",
      "Francesco Romeo",
      "Jyoti Singh"
    ],
    "title": "Diagonal F-thresholds for determinants and Pfaffians",
    "abstract": "We compute the diagonal F-thresholds of determinantal hypersurfaces arising from a generic matrix and from a generic symmetric matrix, as well as of the Pfaffian hypersurface arising from a generic skew-symmetric matrix of even size. The main ingredient is a cohomology vanishing theorem for certain line bundles on flag varieties in characteristic $p$. In the cases of the generic matrix and the generic skew-symmetric matrix, we show that the diagonal F-threshold attains its minimal possible value, namely the negative of the a-invariant. The symmetric case is more subtle and relies in addition on a polynomiality result for representations afforded by cohomology, building on work of the second author with VandeBogert.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05740v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Tadashi Fujioka",
      "Kenshiro Tashiro"
    ],
    "title": "Busemann and MCP",
    "abstract": "We study the structure of Busemann spaces with measures satisfying the measure contraction property (MCP). The main results are rigidity theorems and structure theorems under the assumption of geodesic completeness or non-collapse. The appendix contains some observations on the tangent cones of geodesically complete Busemann spaces.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05727v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Ken Mattsson",
      "David Niemelä",
      "Andrew R. Winters"
    ],
    "title": "Optimal boundary closures for diagonal-norm upwind SBP operators",
    "abstract": "By employing non-equispaced grid points near boundaries, boundary-optimized upwind finite-difference operators of orders up to nine are developed. The boundary closures are constructed within a diagonal-norm summation-by-parts (SBP) framework, ensuring linear stability on piecewise curvilinear multiblock grids. Boundary and interface conditions are imposed using either weak enforcement through simultaneous approximation terms (SAT) or strong enforcement via the projection method.\n  The proposed operators yield significantly improved accuracy and computational efficiency compared with SBP operators constructed on equidistant grids. The resulting SBP--SAT and SBP--projection discretizations produce fully explicit systems of ordinary differential equations. The accuracy and stability properties of the proposed operators are demonstrated through numerical experiments for linear hyperbolic problems in one spatial dimension and for the compressible Euler equations in two spatial dimensions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05719v1",
    "categories": [
      "math.SP",
      "math-ph"
    ],
    "authors": [
      "Erik Skibsted"
    ],
    "title": "Finite energy subspace for time-periodic Schrödinger operators",
    "abstract": "For $N$-body Schrö\\-dinger operators with\n  time-periodic short-range pair-potentials we show by a time-dependent commutator method that all channel wave operators\n  exist. For $N=2$ we prove asymptotic completeness by a simplified version of the method, recovering Yajima's completeness result \\cite{Yaj1} proven by a stationary method.\n  We propose a definition of a \\emph{finite energy\n  subspace}, intuitively consisting of states with `finite asymptotic energy'. This\n  geometric notion is used to characterize the \\emph{wave operator\n  subspace} given as the direct sum of the ranges of the channel wave operators. Thus our main result states that the two subspaces coincide. In turn they coincide for $N= 2$ with the orthogonal subspace of the pure point subspace of\n  the monodromy operator (by asymptotic\n  completeness). For $N\\geq 3$ asymptotic\n  completeness for time-periodic short-range potentials remains an open problem. The main result of the paper may in this case potentially serve as an\n  intermediate step for proving (or possibly disproving) asymptotic completeness. Another potential ingredient could be a key intermediate result of the paper, asserting that the states orthogonal to the pure point subspace obey a (sharp) \\emph{minimal velocity bound}. Thus it remains an open problem possibly to derive a good maximal velocity bound for $N\\geq 3$. Our results apply to $N$-body systems of particles in a time-periodic external electric field with time-mean equal to zero, for example the AC-Stark model.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05685v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Luca Battistella",
      "Francesca Carocci",
      "Jonathan Wise"
    ],
    "title": "Vector bundles on Olsson fans",
    "abstract": "Artin fans are algebro-geometric incarnations of cone complexes. We study weakly convex Olsson fans, generalising Artin fans in two ways: first, they admit lineality spaces, thus including tropical tori as well; second, they are defined over a base logarithmic scheme, thus providing a relative version of equivariant toric geometries. We determine conditions under which Olsson fans are well-behaved, in the sense that their geometry is determined combinatorially. We undertake the study of quasicoherent sheaves, and in particular vector bundles, on Olsson fans: we describe their moduli stack in the case of a (subdivided) cone, and some failures of algebraicity in the general case; Weyl convexity shows up naturally in this context.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05684v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Helmut Gfrerer",
      "Jiri V. Outrata"
    ],
    "title": "Characterizations of the Aubin property of the KKT-mapping in composite optimization by SC derivatives and quadratic bundles",
    "abstract": "For general set-valued mappings, the Aubin property is ultimately tied to limiting coderivatives by the Mordukhovich criterion. Likewise, the existence of single-valued Lipschitzian localizations is related to strict graphical derivatives. In this paper we will show that for the special case of the KKT-mapping from composite optimization, the Aubin property and the existence of single-valued Lipschitzian localizations can be characterized by SC derivatives and quadratic bundles, respectively, which are easier accessible than limiting coderivatives and strict graphical derivatives.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.06016v1",
    "categories": [
      "math.CO",
      "math.AG",
      "math.GT"
    ],
    "authors": [
      "Soohyun Park"
    ],
    "title": "Convex unions and completions from simplicial pseudomanifolds",
    "abstract": "While intersections of convex sets are convex, their unions have rather complicated behavior. Some natural contexts where they appear include duality arguments involving boundaries of convex sets and valuations, which have an Euler characteristic-like structure. However, there are certain settings where the convexity property itself is important to consider. For example, this includes (preservation of) positivity properties of divisors on toric varieties under blowdowns. In the case of (restrictions of) conormal bundles, this can be interpreted in terms of interactions between local convexity data stored in rational equivalence relations. We consider generalizations to realizations of simplicial pseudomanifolds and replace rational equivalence with effects of PL homeomorphisms.\n  Decomposing the PL homeomorphisms into edge subdivisions and contractions, we characterize the space of suitable contraction points compatible with local convexity properties in terms of convex unions and completions. This gives rise to certain external edge subdivisions that make this ``contraction space'' of the starting edge empty, which is unexpected given the expected ``increased convexity'' from edge subdivisions. We also obtain strong affine/linear restrictions on realizations of facets containing nearby edges preserving local convexity. This implies that contracting certain nearby edges results in a very large or very small contraction space of the starting edge. As for boundary behavior, there are parallels between effects of PL homeomorphisms on induced 4-cycles in the 1-skeleton. Finally, we find effects of PL homeomorphisms and suspensions on analogues of local convexity properties stored by linear systems of parameters. This indicates that simplicial spheres PL homeomorphic to the boundary of a cross polytope store record local convexity changes in the most natural way.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05981v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jacob Bedrossian",
      "Jiajie Chen",
      "Maria Pia Gualdani",
      "Sehyun Ji",
      "Vlad Vicol",
      "Jincheng Yang"
    ],
    "title": "Finite time singularities in the Landau equation with very hard potentials",
    "abstract": "We consider the inhomogeneous Landau equation with $γ\\in (\\sqrt{3},2]$ and construct smooth, strictly positive initial data that develop a finite time singularity. The $C^α$-norm of the distribution function blows up for every $α>0$, whereas its $L^{\\infty}$-norm remains uniformly bounded. In self-similar variables, the solution becomes asymptotically hydrodynamic - the distribution function converges to a local Maxwellian, while the hydrodynamic fields develop an asymptotically self-similar implosion whose profile coincides with a smooth imploding profile of the compressible Euler equations. To our knowledge, this provides the first example of a collisional kinetic model which is globally well-posed in the homogeneous setting, but admits finite time singularities for inhomogeneous data.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05964v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Michael Winkler"
    ],
    "title": "Global solvability and stabilization in multi-dimensional small-strain nonlinear thermoviscoelasticity",
    "abstract": "Despite considerable developments in the literature of the past decades, a standing open problem in the analysis of continuum mechanics appears to consist of determining how far the prototypical model for small-strain thermoviscoelastic evolution in Kelvin-Voigt materials with inertia, as given by \\[\n  u_{tt} = μΔu_t + (λ+μ)\\nabla\\nabla\\cdot u_t\n  + \\hatμ Δu + (\\hatλ+\\hatμ) \\nabla\\nabla\\cdot u\n  - B\\nablaΘ,\n  \\qquad \\qquad\n  κΘ_t = DΔΘ+ μ|\\nabla u_t|^2 + (λ+μ) |{\\rm div} \\, u_t|^2 - BΘ{\\rm div} \\, u_t,\n  \\qquad \\qquad \\qquad (\\star) \\] is globally solvable in multi-dimensional settings and for initial data of arbitrary size.\n  The present manuscript addresses this in the context of an initial value problem in smoothly bounded $n$-dimensional domains with $n\\ge 2$, posed under homogeneous boundary conditions of Dirichlet type for the displacement variable $u$, and of Neumann type for the temperature $Θ$. Within suitably generalized concepts of solvability, global existence of solutions is shown without any size restrictions on the data, and for a system actually more general than ($\\star$) by, inter alia, allowing the heat capacity $κ$ to depend on $Θ$. Apart from that, results on large time behavior are derived which particularly assert stabilization of $Θ$ toward a spatially homogeneous limit.\n  Besides on standard features related to energy conservation and entropy production, in its core parts the analysis relies on an evolution property of certain logarithmic refinements of classical entropy functionals, to the best of our knowledge undiscovered in precedent literature and possibly of independent interest.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05960v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ramin Javadi",
      "Yoshiharu Kohayakawa",
      "Meysam Miralaei"
    ],
    "title": "The Multicolor Induced Size-Ramsey Number of Long Subdivisions",
    "abstract": "For a positive integer $k$ and a graph $H$, the $k$-color induced size-Ramsey number \\linebreak $\\widehat{R}_{\\mathrm{ind}}(H, k)$ is the minimum integer $m$ for which there exists a graph $G$ with $m$ edges such that for every $k$-edge coloring of $G$, the graph $G$ contains a monochromatic copy of $H$ as an induced subgraph. For a graph $H$ with the edge set $E(H)$ and a function $σ:E(H)\\to \\mathbb{N}$, the subdivision $H^σ$ is obtained by replacing each $e \\in E(H)$ with a path of length $σ(e)$. We prove that for all integers $k,\\, D\\geq 2 $, there exists a constant $c=c(k, D)$ such that the following holds. Let $ H $ be any graph with maximum degree~$D$ and let~$H^σ$ be a subdivision of $H$ with $σ(e) > c \\log_D n $ for every $e \\in E(H)$, where~$n$ is the order of~$H^σ$. Then, $\\hat{R}_{\\mathrm{ind}}(H^σ,k)=e^{O(k\\log k)} D^{9}\\log (D)\\, n$. If each $σ(e)$ is even and larger than $c \\log_D n$, this bound improves to $\\hat{R}_{\\mathrm{ind}}(H^σ,k)=O(k^{342} \\log^{9} (k) D^{9} \\log D )n$. We also find improved bounds for the non-induced size-Ramsey number of long subdivisions.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05952v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Marco Pilotto",
      "Luca Bergamaschi",
      "Angeles Martinez"
    ],
    "title": "Spectral Analysis of Block Diagonally Preconditioned Multiple Saddle-Point Matrices with Inexact Schur Complements",
    "abstract": "We derive eigenvalue bounds for symmetric block-tridiagonal multiple saddle-point systems preconditioned with block-diagonal Schur complement matrices. This analysis applies to an arbitrary number of blocks and accounts for the case where the Schur complements are approximated, generalizing the findings in [Bergamaschi et al., Linear Algebra and its Applications, 2026]. Numerical experiments are carried out to validate the proposed estimates.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05860v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Farukh Mashurov"
    ],
    "title": "Simple n-Lie Poisson Algebras",
    "abstract": "Let $(A,\\cdot,ω)$ be a simple $n$-Lie Poisson algebra over a field of zero characteristic, $ 1 \\in A.$ Then we prove that the $n$-Lie algebra $A^{[1]}/(A^{[1]}\\cap Z)$ is simple, where $A^{[1]}$ denotes the derived $n$-Lie ideal and $Z$ is the center of $n$-Lie algebra $(A,ω)$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05844v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Gwenaël Joret",
      "Piotr Micek"
    ],
    "title": "Note on the treewidth of graphs excluding a disjoint union of cycles as a minor",
    "abstract": "For a planar graph $H$, let $f(H)$ denote the minimum integer such that all graphs excluding $H$ as a minor have treewidth at most $f(H)$. We show that if $H$ is a disjoint union of $k$ cycles then $f(H)=O(|V(H)| + k \\log k)$, which is best possible.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05831v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Víctor Franco-Sánchez",
      "Mercè Mora",
      "María Luz Puertas"
    ],
    "title": "Metric representations by minimal graphs",
    "abstract": "A resolving set in a graph $G$ is a vertex subset $W= \\{ω^1, \\dots, ω^n\\} \\subseteq V(G)$ such that each $u \\in V(G)$ can be uniquely identified by the vector $r(u \\vert W) = (d(u,ω^1), \\dots, d(u,ω^n))$ of metric coordinates of $u$ with respect to $W$. The reverse problem of identifying the vector sets that are a set of coordinates of some graph provides the concept of realizable vector set $S \\subset \\mathbb{Z}^n$ by a pair $(G, W)$ meaning that $S=\\{ r(u\\vert W)\\colon u\\in V(G)\\}$ with $W$ a resolving set of the graph $G$. Here we focus on the minimality of the realizations of vector sets with respect to their edge sets. On the one hand, we study conditions under which it is possible to remove an edge from the graph and keep the realizability condition. This provides a method for finding minimal realizations, as well as allowing us to characterize uniquely realizable vector sets. On the other hand, we prove that the decision problem of realizing a vector set by a graph with a given number of edges is an NP-complete problem. Finally, we characterize the vector sets that are realizable by a tree and, furthermore, we study the case in which such a realization is the only one.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05799v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Nele H. Amiri",
      "Sean R. Sinclair",
      "Maximiliano Udenio"
    ],
    "title": "Non-Stationary Inventory Control with Lead Times",
    "abstract": "We study non-stationary single-item, periodic-review inventory control problems in which the demand distribution is unknown and may change over time. We analyze how demand non-stationarity affects learning performance across inventory models, including systems with demand backlogging or lost-sales, both with and without lead times. For each setting, we propose an adaptive online algorithm that optimizes over the class of base-stock policies and establish performance guarantees in terms of dynamic regret relative to the optimal base-stock policy at each time step. Our results reveal a sharp separation across inventory models. In backlogging systems and lost-sales models with zero lead time, we show that it is possible to adapt to demand changes without incurring additional performance loss in stationary environments, even without prior knowledge of the demand distributions or the number of demand shifts. In contrast, for lost-sales systems with positive lead times, we establish weaker guarantees that reflect fundamental limitations imposed by delayed replenishment in combination with censored feedback. Our algorithms leverage the convexity and one-sided feedback structure of inventory costs to enable counterfactual policy evaluation despite demand censoring. We complement the theoretical analysis with simulation results showing that our methods significantly outperform existing benchmarks.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05764v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Lucas Gerth"
    ],
    "title": "A Dieudonné theory for analytic p-divisible groups and applications to Shimura varieties",
    "abstract": "We study families of analytic $p$-divisible groups over adic spaces $S$ defined over $\\mathbb{Q}_p$. We prove an equivalence between such families and Hodge-Tate triples, generalizing a theorem of Fargues. For a perfectoid space $S$, we construct a functor associating to an analytic $p$-divisible group $\\mathcal{G} \\rightarrow S$ a coherent sheaf $\\mathcal{E}(\\mathcal{G})$ on the relative Fargues--Fontaine curve $X_S$. Restricting to analytic $p$-divisible groups admitting a Cartier dual, we obtain an equivalence of categories with local shtukas satisfying a minuscule condition, compatible with the prismatic Dieudonné theory of Anschütz--Le Bras. We conclude with applications to moduli spaces: we show that the local Shimura varieties of EL and PEL types of Scholze--Weinstein are moduli spaces of analytic $p$-divisible groups with extra structure, and we give a reinterpretation of the Hodge--Tate period map of Scholze in terms of topologically $p$-torsion subgroups of abelian varieties.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05699v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Daniel Dadush",
      "Stefan Kober",
      "Zhuan Khye Koh"
    ],
    "title": "On Circuit Diameter and Straight Line Complexity",
    "abstract": "The circuit diameter of a polyhedron is the maximum length (number of steps) of a shortest circuit walk between any two vertices of the polyhedron. Introduced by Borgwardt, Finhold and Hemmecke (SIDMA 2015), it is a relaxation of the combinatorial diameter of a polyhedron. These two notions of diameter lower bound the number of iterations taken by circuit augmentation algorithms and the simplex method respectively for solving linear programs.\n  Recently, an analogous lower bound for path-following interior point methods was introduced by Allamigeon, Dadush, Loho, Natura and Végh (SICOMP 2025). Termed straight line complexity, it refers to the minimum number of pieces of any piecewise linear curve that traverses a specified neighborhood of the central path.\n  In this paper, we study the relationship between circuit diameter and straight line complexity. For a polyhedron $P:=\\{x\\in \\mathbb{R}^n: Ax = b, x\\geq \\mathbf{0}\\}$, we show that its circuit diameter is up to a $\\mathrm{poly}(n)$ factor upper bounded by the straight line complexity of linear programs defined over $P$. This yields a strongly polynomial circuit diameter bound for polyhedra with at most 2 variables per inequality. We also give a circuit augmentation algorithm with matching iteration complexity.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05698v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Raphaël Bulle",
      "Michel Duprez",
      "Vanessa Lleras",
      "Killian Vuillemot"
    ],
    "title": "A penalized φ-FEM scheme for the Poisson Dirichlet problem",
    "abstract": "In this work, we analyze a penalized variant of the φ-FEM scheme for the Poisson equation with Dirichlet boundary conditions. The φ-FEM is a recently introduced unfitted finite element method based on a level-set description of the geometry, which avoids the need for boundary-fitted meshes. Unlike the original φ-FEM formulation, the method proposed here enforces boundary conditions through a penalization term. This approach has the advantage that the level-set function is required only on the cells adjacent to the boundary in the variational formulation. The scheme is stabilized using a ghost penalty technique. We derive a priori error estimates, showing optimal convergence in the H1 semi-norm and quasi-optimal convergence in the L2 norm under suitable regularity assumptions. Numerical experiments are presented to validate the theoretical results and to compare the proposed method with both the original φ-FEM and the standard fitted finite element method.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05696v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Yangyang Shi",
      "Dong Su",
      "Hui Liu"
    ],
    "title": "Weak and strong averaging principle for 2D Boussinesq equations with non-Lipschitz Poisson jump noise",
    "abstract": "In this paper, we study the averaging principle for 2D Boussinesq equations with non-Lipschitz Poisson jump noise. Precisely, we will first explore the well-posedness, regularity estimates and tightness of the vorticity variable. Then, we prove the ergodicity of the temperature variable. Next, we prove that the vorticity variable converge to the solution of the averaged equation in probability and $2p$th-mean, under different conditions, as time scale parameter $\\varepsilon$ goes to zero. Finally, we present a specific case study and conduct numerical simulations to substantiate the main conclusions of this paper.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.06011v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Tomás Alcalde López",
      "Avelio Sepúlveda"
    ],
    "title": "Excursion decomposition of the XOR-Ising model",
    "abstract": "We study the excursion decomposition of the two-dimensional critical XOR-Ising model with either $+$ or free boundary conditions. In the first part, we construct the decomposition directly in the continuum. This construction relies on the identification of the XOR-Ising field with the cosine or sine of a Gaussian free field (GFF) $φ$ multiplied by $α= 1/\\sqrt{2}$, and is obtained by an appropriate exploration of two-valued level sets of the GFF. More generally, the same construction applies to the fields $:\\! \\cos(αφ) \\!:$ and $:\\! \\sin(αφ) \\!:$ for any $α\\in (0,1)$.\n  In the second part, we show that the continuum excursion decomposition arises as the scaling limit of the double random current decomposition of the critical XOR-Ising model on the square lattice. To this end, we exploit the rich Markovian structure of the discrete decomposition and strengthen the convergence of the double random current height function to the continuum GFF by establishing joint convergence with its cosine and sine. We conjecture that for $α\\in [1/2,\\sqrt{3}/2)$ the continuum excursion decompositions arise as the scaling limit of those of the Ashkin-Teller polarisation field along its critical line.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05957v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "João Gouveia",
      "Amy Wiebe"
    ],
    "title": "Matrices of nonnegative integer rank two",
    "abstract": "The nonnegative integer rank of a matrix is a variant of the classical nonnegative rank, introduced in the 1980s, where factorizations are required to have integer entries. While computing nonnegative integer rank is generally very hard, we focus on a fundamental special case: determining when a rank 2 nonnegative integer matrix has nonnegative integer rank equal to 2 (the \"rank2 problem\"). Although this problem is trivial in the continuous case, in this context it is surprisingly rich.\n  We provide a geometric reformulation in terms of affine semigroups and rational cones in the plane, which yields new structural insights. We show that any rank 2 integer matrix can be reduced to a $3\\times 3$ matrix which has nonnegative integer rank $2$ if and only if the original one also has nonnegative integer rank $2$, with the reduction computable in polynomial time. This reduction reveals that the difficulty of the rank2 problem is already captured by small matrices. Building on this geometric framework, we also develop an algorithm that solves the rank2 problem by strategically searching for integer generators within bounded regions of the associated cone. Although the theoretical worst-case complexity remains high, numerical experiments demonstrate that the algorithm performs efficiently in practice.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05919v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Joachim Jelisiejew",
      "Agata Smoktunowicz"
    ],
    "title": "On a conjecture by Michael Wemyss regarding the calculation of GV invariants",
    "abstract": "Contraction algebras are noncommutative algebras introduced by Donovan and Wemyss to classify of 3-dimensional flops. Wemyss conjectures that contraction algebras can be deformed to a single semisimple algebra. This gives an intrinsic method of calculating Gopakumar-Vafa invariants of the flop.\n  The main result is a proof of Wemyss' conjecture for types A and D. In the course of the proof, we recall and introduce new techniques for constructing flat deformations of associative algebras and compare various notions of deformations. We also put forward two conjectures which hint towards a deeper theory.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05886v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Tomás Alcalde López",
      "Lorca Heeney",
      "Marcin Lis"
    ],
    "title": "The Ising magnetisation field and the Gaussian free field",
    "abstract": "We construct a natural coupling between the continuum Gaussian free field (GFF) and the critical Ising magnetisation field (IMF) in a planar domain. In fact, we show that two independent IMFs with $+$ boundary conditions and two independent IMFs with free boundary conditions are a deterministic function of a single instance of the GFF together with a sequence of independent coin flips. This construction should be seen as an extension of the bosonisation phenomenon, and to the best of our knowledge its existence has not been predicted before.\n  We arrive at our main result in the continuum by studying novel discrete structures. Our starting point is a coupling resembling the Edwards-Sokal coupling between the Ising model and the Fortuin-Kasteleyn random cluster model, though with role of the latter played by a different percolation model obtained from the double random current model. By taking a scaling limit of the coupling at criticality, we obtain a continuum Edwards-Sokal-like representation of the IMFs in terms of certain two-valued sets of the GFF introduced by Aru, Sepúlveda and Werner.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05790v1",
    "categories": [
      "cs.IT",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Alina Harbuzova",
      "Or Ordentlich",
      "Yury Polyanskiy"
    ],
    "title": "Price of universality in vector quantization is at most 0.11 bit",
    "abstract": "Fast computation of a matrix product $W^\\top X$ is a workhorse of modern LLMs. To make their deployment more efficient, a popular approach is that of using a low-precision approximation $\\widehat W$ in place of true $W$ (\"weight-only quantization''). Information theory demonstrates that an optimal algorithm for reducing precision of $W$ depends on the (second order) statistics of $X$ and requires a careful alignment of vector quantization codebook with PCA directions of $X$ (a process known as \"waterfilling allocation''). Dependence of the codebook on statistics of $X$, however, is highly impractical. This paper proves that there exist a universal codebook that is simultaneously near-optimal for all possible statistics of $X$, in the sense of being at least as good as an $X$-adapted waterfilling codebook with rate reduced by 0.11 bit per dimension. Such universal codebook would be an ideal candidate for the low-precision storage format, a topic of active modern research, but alas the existence proof is non-constructive.\n  Equivalently, our result shows existence of a net in $\\mathbb{R}^n$ that is a nearly-optimal covering of a sphere simultaneously with respect to all Hilbert norms.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05756v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "María Isabel Cortez",
      "Till Hauser"
    ],
    "title": "Minimal Equicontinuous Actions on Stone Spaces",
    "abstract": "In this article we study minimal equicontinuous actions on Stone spaces, which we call \\emph{subodometers}, and do neither assume that the space is metrizable, nor any assumptions on the acting group. We show that the set of eigenvalues is a complete invariant for subodometers. Furthermore, we characterize minimal rotations on Stone spaces, which we call \\emph{odometers}, via the intersection stability of their sets of eigenvalues. We show that any non-empty family of odometers allows for a minimal common extension and a maximal common factor, that both are odometers and that they are unique up to conjugacy. We provide examples that a similar statement does not hold for subodometers.\n  We show that subodometers are given as inverse limits of minimal finite actions, that odometers are given as inverse limits of minimal finite rotations, and present how the minimal common extension and the maximal common factor of a non-empty family of odometers can be represented as an inverse limit.\n  We establish that a minimal action $X$ is a subodometer if and only if its Ellis semigroup $E(X)$ is an odometer, and present how an inverse limit representation of $E(X)$ can be derived from the representation of $X$. Furthermore, we establish the existence of a universal odometer that has all subodometers as factors; as well as the existence of a maximal subodometer factor, and a maximal odometer factor of a given minimal action.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05751v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ravi Sharan Bhagavathula",
      "Pavan Koteshwar Srinath",
      "Alvaro Valcarce Rial",
      "Baltasar-Beferull Lozano"
    ],
    "title": "MU-MIMO Uplink Timely Throughput Maximization for Extended Reality Applications",
    "abstract": "In this work, we study the cross-layer timely throughput maximization for extended reality (XR) applications through uplink multi-user MIMO (MU-MIMO) scheduling. Timely scheduling opportunities are characterized by the peak age of information (PAoI)-metric and are incorporated into a network-side optimization problem as constraints modeling user satisfaction. The problem being NP-hard, we resort to a signaling-free, weighted proportional fair-based iterative heuristic algorithm, where the weights are derived with respect to the PAoI metric. Extensive numerical simulation results demonstrate that the proposed algorithm consistently outperforms existing baselines in terms of XR capacity without sacrificing the overall system throughput.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05705v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Stephanie Chan",
      "Daniel Loughran",
      "Nick Rome"
    ],
    "title": "Thin sets in weighted projective stacks",
    "abstract": "We prove an upper bound for the number of rational points of bounded height in a weighted projective stack which lie in a given thin subset. As a consequence, we show that $100\\%$ of hyperelliptic curves do not admit a prescribed on-trivial level structure.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05701v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Lander Besabe",
      "Hyesuk Lee"
    ],
    "title": "Finite element approximation for a reformulation of a 3D fluid-2D plate interaction system",
    "abstract": "We study a finite element approximation of a coupled fluid-structure interaction consisting of a three-dimensional incompressible viscous fluid governed by the unsteady Stokes equations and a two-dimensional elastic plate. To avoid the use of $H^2-$conforming or nonconforming $\\mathbb{P}_2$-Morley plate elements, the fourth-order plate equation is reformulated into a system of coupled second-order equations using an auxiliary variable. The coupling condition is enforced using a Lagrange multiplier representing the trace of the mean-zero fluid pressure on the interface.\n  We establish well-posedness and stability results for the time-discrete and fully-discrete problems, and derive a priori error estimates. A partitioned domain decomposition algorithm based on a fixed-point iteration is employed for the numerical solution. Numerical experiments verify the theoretical rates of convergence in space and time using manufactured solutions, and demonstrate the applicability of the method to a physical problem.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05689v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Joseph Hua",
      "Yiming Xu"
    ],
    "title": "Polynomial functors in π-clans for the semantics of type theory",
    "abstract": "The category of contexts underlying a model of Martin-Löf type theory with Unit-, $Σ$-, and $Π$-types need not be locally Cartesian closed, but is necessarily a $π$-clan. We exploit this $π$-clan structure to build the theory of polynomial functors. This paper presents two equivalent notions of strict semantics for MLTT in this weaker setting, respectively \"elementary models\" - reformulating categories with families - and \"algebraic models\" - reformulating natural models. These components fit into a practical sequence of steps for constructing models of MLTT: building an elementary model, extracting a $π$-clan from the elementary model, and then using polynomial functors built on the $π$-clan structure to convert the elementary model into an algebraic one.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05682v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Kazumichi Nakamura"
    ],
    "title": "Delta-Unknotting Number for Pretzel Knots",
    "abstract": "The $Δ$-unknotting number for a knot is defined as the minimum number of $Δ$-moves needed to deform the knot into the trivial knot. It is known that, for positive pretzel knots, the $Δ$-unknotting number coincides with the second coefficient of their Conway polynomial. In this paper, we compute the $Δ$-unknotting number for positive pretzel knots. Furthermore, we determine the $Δ$-unknotting number for pretzel knots of type $P(-1, p_2, ..., p_n)$, where $p_i$ is a positive odd integer for $2 \\leq i \\leq n$ and $n$ is odd.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.06006v1",
    "categories": [
      "math.DG",
      "math.AT"
    ],
    "authors": [
      "Iolo Jones",
      "David Lanners"
    ],
    "title": "Computing Diffusion Geometry",
    "abstract": "Calculus and geometry are ubiquitous in the theoretical modelling of scientific phenomena, but have historically been very challenging to apply directly to real data as statistics. Diffusion geometry is a new theory that reformulates classical calculus and geometry in terms of a diffusion process, allowing these theories to generalise beyond manifolds and be computed from data. This work introduces a new computational framework for diffusion geometry that substantially broadens its practical scope and improves its precision, robustness to noise, and computational complexity. We present a range of new computational methods, including all the standard objects from vector calculus and Riemannian geometry, and apply them to solve spatial PDEs and vector field flows, find geodesic (intrinsic) distances, curvature, and several new topological tools like de Rham cohomology, circular coordinates, and Morse theory. These methods are data-driven, scalable, and can exploit highly optimised numerical tools for linear algebra.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.06004v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Andrew Sack"
    ],
    "title": "Lattices from Pointed Building Sets: Generalized Ornamentation Lattices",
    "abstract": "We introduce a novel combinatorial structure called pointed building sets, which can be viewed as families of lattices equipped with compatibility relations. To each pointed building set $\\mathsf{B}$, we associate a complete lattice $\\mathcal{O}(\\mathsf{B})$, called the ornamentation lattice of $\\mathsf{B}$.\n  Special cases of this construction have already proven useful in understanding the structure of three families of posets: operahedron lattices, the affine Tamari lattice, and hypergraphic posets of subhypergraphs of the path hypergraph of an increasing tree.\n  The goal of this paper is to establish the theory of these generalized ornamentations. We examine several natural classes of pointed building sets which recover classical lattices such as the Tamari lattice, the lattice of topologies ordered by coarsening, and the lattice of naturally labeled partial orders. Furthermore, several theoretical directions are explored, including inverse limits and group actions. Notably, this leads to a straightforward construction of inverse limits of Tamari lattices, yielding infinite analogs of the Tamari lattice.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05976v1",
    "categories": [
      "math.OC",
      "math.PR"
    ],
    "authors": [
      "Matt Jacobs",
      "Bohan Zhou"
    ],
    "title": "The Signed Wasserstein Barycenter Problem",
    "abstract": "Barycenter problems encode important geometric information about a metric space. While these problems are typically studied with positive weight coefficients associated to each distance term, more general signed Wasserstein barycenter problems have recently drawn a great deal of interest. These mixed sign problems have appeared in statistical inference setting as a way to generalize least squares regression to measure valued outputs and have appeared in numerical methods to improve the accuracy of Wasserstein gradient flow solvers. Unfortunately, the presence of negatively weighted distance terms destroys the Euclidean convexity of the unsigned problem, resulting in a much more challenging optimization task. The main focus of this work is to study properties of the signed barycenter problem for a general transport cost with a focus on establishing uniqueness of solutions. In particular, when there is only one positive weight, we extend the uniqueness result of Tornabene et al. (2025) to any cost satisfying a certain convexity property. In the case of arbitrary weights, we introduce the dual problem in terms of Kantorovich potentials and provide a sufficient condition for a stationary solution of the dual problem to induce an optimal signed barycenter.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05968v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Nurgissa Yessirkegenov",
      "Amir Zhangirbayev"
    ],
    "title": "Stability of the $L^{p}$-Poincaré inequality for the Lebesgue and Gaussian probability measures with explicit geometric dependency",
    "abstract": "In this paper, we obtain stability results for the $L^{p}$-Poincaré inequality for both Lebesgue and Gaussian probability measures (Theorem 3.3 and Theorem 3.6). Our approach relies on properties of the first eigenfunction of the (Gaussian) $p$-Laplacian operator and weighted Poincaré inequalities for log-concave measures on convex domains.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05878v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Gennaro Ciampa",
      "Donatella Donatelli",
      "Giada Pellecchia"
    ],
    "title": "Large bulk viscosity limit for compressible MHD equations in critical Besov spaces",
    "abstract": "We study the large bulk viscosity limit for the compressible magnetohydrodynamics (MHD) equations in two and three dimensions. For arbitrarily large initial data in critical Besov spaces, we prove the global well-posedness of strong solutions and establish their convergence, with explicit quantitative rates, to solutions of the incompressible MHD system, as the bulk viscosity parameter tends to infinity. As an application of this singular-limit analysis, we construct global smooth solutions to the compressible MHD equations whose magnetic field undergoes reconnection, thereby extending to the compressible regime the reconnection scenarios previously identified for incompressible flows.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05834v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Ludovic Felder"
    ],
    "title": "Descent properties for an abelian variety with extended Galois representation",
    "abstract": "Let $K$ be a field, $L$ a finite Galois extension of $K$, and $X$ an abelian variety defined over $L$. If $X$ is isogenous over $L$ to an abelian variety defined over $K$, then the $\\ell$-adic Galois representations associated to $X$ extend to representations $\\barρ_{\\ell,X}:\\mathrm{Gal}(\\bar{L}/K)\\to\\mathrm{Aut}(V_\\ell X)$ for every prime $\\ell$. This paper aims to show that the converse is true for abelian varieties of Type I, with some supplementary conditions needed on the endomorphisms of $X$, when $L$ is either a number field or a function field of prime characteristic different from $2$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05732v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "David Barina",
      "W. C. Maat"
    ],
    "title": "$3n + 3^k$ Problem",
    "abstract": "The Collatz problem is generalized into $3n + 3^k$ problem. It is shown that as long as the Collatz function iterates converge to the cycle passing through the number 1, the $3n + 3^k$ sequence converges to the cycle passing through the number $3^k$ for arbitrary positive integers $n$ and $k$. The proof shows that the sequence of $3n + 3^k$ function iterates for a number $3^k n$ is exactly the sequence of the Collatz function iterates for $n$ multiplied by $3^k$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05731v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yuri Matiyasevich"
    ],
    "title": "An approach to the Lindelöf Hypothesis for Dirichlet $L$-functions",
    "abstract": "The suggested approach is based on a known representation of Dirichlet $L$-functions via the incomplete gamma functions. Some properties of the Taylor coefficients of the lower incomplete gamma function at infinity seem to be new. Specifically, these coefficients can be expressed in terms of Touchard polynomials. Furthermore, these same coefficients can be used to reformulate the functional equation for Dirichlet $L$-functions. This relationship \"explains\"' why $\\vert L_χ(1/2+i t)\\vert $ should be small. To present the new ideas in a nutshell, we start by giving (in Section 1) a \"formula proof\" of the Lindelöf hypothesis. This is not a genuine proof, as we are not concerned with the convergence of our series nor do we justify changing the order of summation. In Section 2, we suggest some hypothetical ways of transforming the \"proof\" from Section 1 into a rigorous mathematical proof. Sections 3-5 contain some technical details and bibliographical references.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05697v1",
    "categories": [
      "math.NT",
      "math.AP"
    ],
    "authors": [
      "Jiaqi Hou",
      "Xiaoqi Huang"
    ],
    "title": "$L^q$-norm bounds for arithmetic eigenfunctions via microlocal Kakeya-Nikodym estimate",
    "abstract": "Let $X$ be a compact arithmetic hyperbolic surface, and let $ψ$ be an $L^2$-normalized Hecke-Maass form on $X$ with sufficiently large spectral parameter $λ$. We give a new proof to obtain some power saving for the global $L^6$-norm $\\|ψ\\|_{L^6(X)}\\lesssim_ελ^{\\frac{1}{6}-\\frac{1}{144}+ε}$ over the local bound $\\|ψ\\|_{L^6(X)}\\lesssimλ^{\\frac16}$ of Sogge. Using the $L^\\infty$-norm bound $\\|ψ\\|_{L^\\infty(X)}\\lesssim_ελ^{\\frac{5}{12}+ε}$ of Iwaniec and Sarnak and harmonic analysis tools, we reduce the $L^6$-norm problem to a microlocal $L^6$ Kakeya-Nikodym estimate for $ψ$. Finally, we establish an improved microlocal $L^6$ Kakeya-Nikodym estimate via arithmetic amplification developed by Iwaniec and Sarnak.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05680v1",
    "categories": [
      "math.DS",
      "nlin.PS"
    ],
    "authors": [
      "Thomas J. Bridges",
      "David J. B. Lloyd",
      "Daniel J. Ratliff",
      "Patrick Sprenger"
    ],
    "title": "Heteroclinic connections between finite-amplitude periodic orbits emerging from a codimension two singularity",
    "abstract": "Heteroclinic connections between two distinct hyperbolic periodic orbits in conservative systems are important in a wide range of applications. On the other hand, it is theoretically challenging to find large amplitude connections from scratch and compute them numerically. In this paper, we use a codimension two singularity, in a family of periodic orbits, as an organizing center for the emergence of heteroclinic connections. A normal form is derived whose unfolding produces two distinct finite amplitude periodic orbits with an explicit heteroclinic connection. We also construct heteroclinic connections far from the singularity by numerical continuation, using two numerical strategies: shooting and the core-farfield decomposition. A key geometric tool in the numerics is cylindrical foliations for the stable and unstable manifolds and their intersection. We introduce a new property of heteroclinic connections - the action - and show it is an invariant along foliations, it has a jump at a surface of section, and it appears in a central way in the normal form theory. We find that the difference in asymptotic phase between minus and plus infinity is also a key property. The theory is applied to the Swift-Hohenberg equation, the nonlinear Schrodinger with fourth order dispersion, and coupled Boussinesq equations from water waves, all of which have an energy and action conservation law.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05990v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Jonathan Davies"
    ],
    "title": "Categories graded by group homomorphisms",
    "abstract": "We generalise to a group homomorphism $τ$ the $χ$-graded categories of Sözer and Virelizier. These are categories in which both morphisms and objects have compatible degrees. We give a 'half-enriched' Yoneda lemma, a structure theorem for semisimple $τ$-graded categories, and an alternative picture of $τ$-graded categories in terms of pseudofunctors into $\\mathbf{Cat}$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05974v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Akul Bansal",
      "Simge Küçükyavuz"
    ],
    "title": "Normalization of ReLU Dual for Cut Generation in Stochastic Mixed-Integer Programs",
    "abstract": "We study the Rectified Linear Unit (ReLU) dual, an existing dual formulation for stochastic programs that reformulates non-anticipativity constraints using ReLU functions to generate tight, non-convex, and mixed-integer representable cuts. While this dual reformulation guarantees convergence with mixed-integer state variables, it admits multiple optimal solutions that can yield weak cuts. To address this issue, we propose normalizing the dual in the extended space to identify solutions that yield stronger cuts. We prove that the resulting normalized cuts are tight and Pareto-optimal in the original state space. We further compare normalization with existing regularization-based approaches for handling dual degeneracy and explain why normalization offers key advantages. In particular, we show that normalization can recover any cut obtained via regularization, whereas the converse does not hold. Computational experiments demonstrate that the proposed approach outperforms existing methods by consistently yielding stronger cuts and reducing solution times on harder instances.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05963v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Michael Winkler"
    ],
    "title": "A simple model for one-dimensional nonlinear thermoelasticity: Well-posedness in rough-data frameworks",
    "abstract": "In an open bounded interval $Ω$, the problem \\[\n  u_{tt} = u_{xx} - \\big(f(Θ)\\big)_x,\n  Θ_t = Θ_{xx} - f(Θ) u_{xt}, \\] is considered under the boundary conditions $u|_{\\partialΩ}=Θ_x|_{\\partialΩ}=0$, and for $f\\in C^2([0,\\infty))$ satisfying $f(0)=0$, $f'>0$ on $[0,\\infty)$ and $f'\\in W^{1,\\infty}((0,\\infty))$.\n  In the sense of unconditional global existence, uniqueness and continuous dependence, this problem is shown to be well-posed within ranges of initial data merely satisfying \\[\n  u_0\\in W_0^{1,2}(Ω),\n  \\quad\n  u_{0t} \\in L^2(Ω)\n  \\quad \\mbox{and} \\quad\n  Θ_0 \\in L^2(Ω)\n  \\mbox{ with $Θ\\ge 0$ a.e.~in $Ω$,} \\] and in classes of solutions fulfilling \\[\n  u\\in C^0([0,\\infty);W_0^{1,2}(Ω)),\n  \\qquad\n  u_t \\in C^0([0,\\infty);L^2(Ω))\n  \\qquad \\mbox{and} \\qquad\n  Θ\\in C^0([0,\\infty);L^2(Ω)) \\cap L^2_{loc}([0,\\infty);W^{1,2}(Ω)). \\]",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05962v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Michael Winkler"
    ],
    "title": "Large time stabilization of rough-data solutions in one-dimensional nonlinear thermoelasticity",
    "abstract": "In an open bounded real interval $Ω$, the model for one-dimensional thermoelasticity given by \\[\n  u_{tt} = u_{xx} - \\big(f(Θ)\\big)_x,\n  \\qquad\n  Θ_t = Θ_{xx} - f(Θ) u_{xt}, \\] is considered along with homogeneous boundary conditions of Dirichlet type for $u$ and of Neumann type for $Θ$, under the assumption that $f\\in C^1([0,\\infty))$ satisfies $f(0)=0$, $f'\\in L^\\infty((0,\\infty))$ and $f'>0$ on $[0,\\infty)$. The focus is on initial data which are merely required to be consistent with the fundamental principles of energy conservation and entropy nondecrease, by satisfying \\[\n  u_0\\in W_0^{1,2}(Ω),\n  u_{0t} \\in L^2(Ω),\n  0 \\le Θ_0\\in L^1(Ω), Θ_0 \\not\\equiv 0. \\] Despite an apparent lack of favorable compactness properties that have underlain previous related studies on more regular settings, it is shown that corresponding weak solutions stabilize in the sense that \\[\n  \\lim_{t\\to\\infty} \\|u(\\cdot,t)\\|_{L^\\infty(Ω)}=0 \\] and \\[\n  {\\rm ess} \\lim_{\\!\\!\\!\\! t\\to\\infty} \\|Θ(\\cdot,t)-Θ_\\infty\\|_{L^\\infty(Ω)}=0 \\] with some $Θ_\\infty>0$.",
    "date": "02-06"
  },
  {
    "link": "https://arxiv.org/pdf/2602.05914v1",
    "categories": [
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Sven Bachmann",
      "Mahsa Rahnama",
      "Gabrielle Tournaire"
    ],
    "title": "Local measurements and the entanglement transition in quantum spin chains",
    "abstract": "We consider the transition between short-range entangled (SRE) and long-range ordered (and therefore long-range entangled) states of infinite quantum spin chains, which is induced by local measurements. Specifically, we assume that the initial state is in a non-trivial symmetry-protected topological phase with local symmetry group $\\mathcal{G} = G \\times H$, where $G$ is an Abelian subgroup. We show that the on-site measurements of the local $G$-charge on intervals of increasing lengths transform the initial SRE state into a family of states with increasingly long-range correlations. In particular, the post-measurement states cannot be uniformly short-range entangled. In the case where the initial state is obtained from a product state using a quantum cellular automaton, we construct the infinite-volume post-measurement state and exhibit almost local observables that are maximally correlated.",
    "date": "02-06"
  }
]