[
  {
    "link": "https://arxiv.org/pdf/2602.20313v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Wojciech Michałowski"
    ],
    "title": "On the Pólya Frequency Order of the de Bruijn Newman Kernel. Certified Failure at Order Five and the Toeplitz Threshold Phenomenon",
    "abstract": "We study the classical de Bruijn--Newman kernel K(u)=Phi(|u|) arising in the heat-flow deformation of the Riemann xi-function. We prove that K is not a Polya frequency function of order five (PF_5). The proof is computational and fully rigorous: we exhibit an explicit 5x5 Toeplitz minor whose determinant is strictly negative, certified by interval arithmetic at high precision with explicit control of truncation and rounding errors. At the same configuration we certify positivity of all Toeplitz minors of orders 2, 3, and 4, demonstrating a sharp Toeplitz PF threshold at order 5 for this two-parameter family. To explain the mechanism, we develop a Toeplitz reduction and an asymptotic expansion as the grid spacing h -> 0, leading to a leading coefficient C_r(u0) whose sign governs the small-h behavior of the Toeplitz determinant. Numerically, we find C_r(u0) > 0 for r <= 4 on the tested range, while C_5(u0) < 0 for u0 in (0, u0*) with a critical transition near u0* ~= 0.03113976; in contrast, C_6 and C_7 are positive at representative points, indicating a localized failure specific to order five. We also investigate the Gaussian deformation K_t(u)=exp(t u^2)*Phi(|u|) and compute, for each counterexample configuration, the minimal t >= 0 that restores Toeplitz PF_5 positivity, emphasizing that this configuration-dependent threshold is distinct from the de Bruijn--Newman constant.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20310v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Ke Xu",
      "John Gunnar Carlsson"
    ],
    "title": "A unified solution framework for truck-and-drone routing problems",
    "abstract": "Coordinated truck-and-drone routing integrates the high capacity and range of ground vehicles with the flexible routing and speed of drones, enabling simultaneous service. Increasingly applied in last-mile delivery, this synchronization helps reduce completion time and operational costs. To improve its efficiency, various coordination modes between trucks and drones have been proposed. Each mode accommodates diverse operational constraints tailored to particular delivery requirements. In existing work, a slight change in the structural framework or operational characteristics could generate a totally different problem variant, which often requires the design of specialized algorithms. Consequently, under the requirement of maintaining structural validation and adapting to multiple operational features, this paper presents a unified three-phase solution framework based on the Lin-Kernighan-Helsgaun algorithm to solve a wide family of truck-and-drone routing problems. To validate its flexibility and effectiveness, we carry out numerical experiments on three problem variants: the Flying Sidekick Traveling Salesman Problem (FSTSP), the Traveling Salesman Problem with Multiple Drones (TSP-mD), and the Vehicle Routing Problem with Drones (VRP-D), benchmarking each against an effective algorithm. Computational results show that the framework can closely match optimal solutions on small-size instances and even improve the best-known solutions for several medium-size instances. Moreover, additional extensions are discussed to further highlight its versatility.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20305v1",
    "categories": [
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "Luca Haardt"
    ],
    "title": "A coherent theory of tent spaces and homogeneous Triebel-Lizorkin spaces",
    "abstract": "We introduce and systematically investigate a scale of tent spaces that characterizes homogeneous Triebel-Lizorkin spaces $\\mathrm{\\dot F}^β_{p,q}$. These spaces generalize the classical spaces of Coifman, Meyer, and Stein, and are shown to be equivalent to the weighted tent spaces with Whitney averages developed by Huang. We show that these tent spaces follow a functional analytic theory that mirrors that of Triebel-Lizorkin spaces, including duality, embeddings, discrete characterizations, John-Nirenberg-type properties, as well as real and complex interpolation. Furthermore, we provide a novel characterization of the endpoint spaces $\\mathrm{\\dot F}^β_{\\infty,q}$, completing earlier work by Auscher, Bechtel, and the author.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20280v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Kristin DeVleming"
    ],
    "title": "On moduli of Fano varieties: an introduction to K-stability and K-moduli",
    "abstract": "This survey article is an accompaniment to the 2025 Summer Research Institute in Algebraic Geometry Bootcamp on K-stability and K-moduli. It is aimed at graduate students and intended to provide the necessary background to begin research on explicit K-moduli problems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20263v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Raymond Cheng",
      "Noah Olander"
    ],
    "title": "Derived categories of quadric bundles and moduli stacks of spinor sheaves",
    "abstract": "We prove that the Kuznetsov component of a flat family of even-dimensional quadrics of corank at most 2 is equivalent to the twisted derived category of an algebraic space whenever: (i) the open subset of the base over which the quadrics has corank at most 1 is scheme-theoretically dense; and (ii) a certain étale double cover of the closed complement admits a section. This provides the first general geometricity result for Kuznetsov components of higher dimensional quadrics, thereby generalizing works of Kapranov, Bondal, Orlov, Kuznetsov, Moschetti, Xie, and others. Our main tool is the moduli stack of spinor sheaves on a family of quadrics, which we define and study in detail. In the situation of our main result, we produce an open substack which is a $\\mathbf{G}_m$-gerbe, and show that the associated twisted derived category is equivalent to the Kuznetsov component of the family of quadrics, thereby providing a geometric interpretation of the Brauer classes appearing in previous works.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20211v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Takao Inoué"
    ],
    "title": "A Formal Group Perspective on the Riemann Zeta Function",
    "abstract": "We develop a formal group--theoretic framework for the Riemann zeta function by treating its Euler product as an element of the multiplicative formal group $\\widehat{\\mathbb{G}}_m$ and its logarithm as the associated formal group logarithm. This provides a purely algebraic linearization of the multiplicative prime-wise structure of the Euler product.\n  Starting from a finite cutoff model, we introduce a formal completion via evenization and a natural normalization procedure. The resulting logarithmic expansion exhibits a Gaussian leading term, while higher-order terms form a hierarchy of cumulants. We show that this Gaussian structure is not probabilistic in origin, but arises from the infinitesimal quadratic geometry of the multiplicative formal group after linearization. The higher cumulants encode arithmetic deviations and admit a decomposition governed by weighted integrals of the Chebyshev error function $θ(x)-x$.\n  A systematic formal group axiomatization is then provided, placing the cutoff model and cumulant hierarchy within a coherent algebraic framework. The approach is deliberately non-spectral, focusing on a structural reorganization of the Euler product rather than on operator-theoretic realizations of zeros. We briefly indicate possible connections with absolute arithmetic and geometry over $\\mathbb{F}_1$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20201v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Passimzouwé Dagou",
      "Pagdame Tiebekabe",
      "Kouèssi Norbert Adédji",
      "Kokou Tchariè"
    ],
    "title": "Sums of three Fibonacci numbers as concatenations of three repdigits in base $b$",
    "abstract": "In this paper, we investigate sums of three Fibonacci numbers that can be expressed as concatenations of three repdigits in base $b$, where $b\\ge 2$ is an integer. We prove that for bases $2\\le b\\le 10$, only finitely many such sums exist, and we determine all of them explicitly. Among these solutions, the largest occurs for $b=4$ and is given by $$ F_{42}+F_{29}+F_{20}=268435290=\\overline{33333333331122}_4. $$",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20192v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Luc Ramsès Talla Waffo"
    ],
    "title": "Asymptotic zero distribution of the polynomials $\\widetildeΞ_n$",
    "abstract": "We consider the polynomials $Ξ_n$ introduced in~\\cite{TallaWaffo2025arxiv2511.02843} and studied in further details in\\cite{TallaWaffo2026arxiv2602.16761}, which are expressed in terms of Eulerian polynomials of type~B, and study the zero distribution of the rescaled family \\[\n  \\widetildeΞ_n(x) := Ξ_n(\\sqrt{x}), \\qquad n\\ge 2. \\] Writing the zeros of $\\widetildeΞ_n$ in the interval $(0,1)$ as $0< x_{n,1} \\le \\cdots \\le x_{n,n-1} < 1$ and forming the empirical measures \\[\n  μ_n := \\frac1{n-1}\\sum_{k=1}^{n-1}δ_{x_{n,k}}, \\] we prove that $(μ_n)_{n\\ge2}$ converges weakly to a deterministic probability measure $μ$ supported on $(0,1)$. We give an explicit formula for the limiting density and the limiting distribution function of~$μ$. The proof is based on a representation of $Ξ_n$ in terms of type~B Eulerian polynomials, a ratio asymptotic for these polynomials derived from a classical series identity, and the Stieltjes transform method. We also provide numerical experiments illustrating the convergence of the empirical zero distributions to~$μ$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20185v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Justin Grieshop"
    ],
    "title": "On the Failure of Step-Response Tests to Certify Admissibility of Spectral Averaging Operators",
    "abstract": "We study translation-invariant smoothing operators on finite cyclic groups Z/NZ, expressed as periodic convolutions and analyzed via the discrete Fourier transform on Z/NZ. Step responses are widely used as a practical diagnostic for whether a smoothing operator preserves bounded ranges, for example whether it maps signals in [0,1]^N back into [0,1]^N. We show step-based diagnostics can be fundamentally misleading for periodic convolution operators. First, we give a sharp characterization: a constant-preserving periodic convolution maps [0,1]^N into [0,1]^N if and only if its convolution kernel is componentwise nonnegative, equivalently each row of the associated matrix is a probability vector. The proof is constructive and yields worst-case witnesses in {0,1}^N together with certified lower bounds on the magnitude of boundedness violation. We then analyze three standard Fourier-domain averaging constructions, Fejer (Cesàro) averaging, sharp spectral truncation, and a signed spectral control, and demonstrate a Nyquist-adjacent blind spot: at cutoff K = Nyquist - 1, the canonical step can exhibit essentially zero overshoot while the operator remains strongly non-admissible, with explicit binary inputs yielding outputs below 0 and above 1. Reproducible artifacts and a self-contained demo are provided.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20183v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Jan Schneider",
      "Kaja Bilińska",
      "Paul Schneider",
      "Tomasz Szandała"
    ],
    "title": "Quantile-Based Skewness for Fuzzy Numbers with Probabilistic Foundations: With an Application in Portfolio Optimization",
    "abstract": "This paper introduces a novel parameter free skewness coefficient for fuzzy numbers, addressing a critical gap in quantifying asymmetry under imprecision. Existing fuzzy literature substitutes membership functions for probability density functions in moment-based skewness, lacking rigorous theoretical grounding. Our coefficient, however, rigorously establishes a probabilistic foundation, making it both probabilistically meaningful and fully compliant with the semantics of fuzzy set theory. Our approach interprets a fuzzy number's left and right membership function components as cumulative and survival probability functions of associated random variables. This provides a robust probabilistic foundation for its $α$-cuts as generalized quantiles representing values that are \"at least $α$-probable\", thereby instantiating the well-grounded dualism between probability and possibility theory. As a quantile-based measure, the proposed coefficient offers invariance under scale and location transformations. Crucially, its superior computational efficiency, empirically demonstrating an almost logarithmic reduction in portfolio optimization processing time with increasing assets, enables significant scalability for real-world applications. The coefficient comprises two complementary constituents: an \"inner\" measure quantifying the intrinsic skewness of the underlying probabilistic distributions, and an \"outer\" measure capturing the fuzzy number's overall profile asymmetry. This dual structure offers nuanced insights into a fuzzy number's asymmetry. We demonstrate its practical utility and computational advantages within a fuzzy mean-variance-skewness portfolio optimization framework, comparing its performance with two of the most highly cited original moment-based fuzzy skewness coefficients from the literature.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20765v1",
    "categories": [
      "math.CO",
      "math.AG"
    ],
    "authors": [
      "Vadym Kurylenko",
      "Benjamin Nill"
    ],
    "title": "Preserving Hodge Vectors of Lattice Polytopes",
    "abstract": "Given lattice polytopes $P_1, \\ldots, P_k$ contained in a $k$-dimensional subspace $U \\subseteq \\mathbb{R}^d$ and a $d$-dimensional lattice polytope $Q \\subset \\mathbb{R}^d$, we compute the Hodge vector of the Cayley polytope $P_1 * \\cdots * P_k * Q$, and show that it equals the mixed volume of $P_1, \\ldots, P_k$ times the Hodge vector of the projection of $Q$ along $U$. Here, the Hodge vector of a lattice polytope is its local $h^*$-vector with leading and trailing zeroes removed. This result allows finding infinitely many high-dimensional lattice polytopes with the same Hodge vector that are not free joins. The proof relies on a closed formula for the Hodge-Deligne polynomial of generic complete intersections in the torus in terms of the bivariate/mixed $h^*$-polynomial. A special case of our construction is what we call Lawrence twists: extending the Gale transform by centrally-symmetric pairs of vectors. As applications, we can produce many new thin polytopes answering a question by Borger, Kretschmer and the second author, and we provide an alternative explanation of the thinness of $B_k$-polytopes answering a question of Selyanin.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20753v1",
    "categories": [
      "math.FA",
      "math.RA"
    ],
    "authors": [
      "Kennett L. Dela Rosa",
      "Aedan Jarrod A. Potot"
    ],
    "title": "Schur-Horn theorem and Ky Fan's minimum principle for symplectic eigenvalues",
    "abstract": "The symplectic analogues of Schur's theorem and Ky Fan's minimum principle are shown to be equivalent. Moreover, the symplectic Schur's and Horn's theorems are extended to generalized means.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20675v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Esmaeal Ghavanloo",
      "Pierre Fritsch",
      "Patrizio Neff"
    ],
    "title": "Analytical solutions for long cylindrical shells under radial deformations based on the isotropic relaxed micromorphic continuum",
    "abstract": "This study presents a closed-form analytical solution for the elastostatic response of long cylindrical shells composed of microstructured materials within the framework of the isotropic relaxed micromorphic continuum. The formulation accounts for microstructural effects by introducing an independent micro-distortion tensor field in addition to the classical displacement field. Under the assumptions of axisymmetric deformation and plane strain conditions, the governing equilibrium equations reduce to a coupled system of ordinary differential equations in the radial coordinate. By introducing suitable auxiliary variables, the system is reformulated into a non-homogeneous modified Bessel equation, which admits an exact analytical solution. Explicit expressions are derived for the radial displacement field and the non-zero components of the micro-distortion tensor. Numerical examples are presented to illustrate the influence of material parameters and the characteristic length on the displacement. The results demonstrate that the relaxed micromorphic model predicts deviations from classical elasticity where microstructural effects are more pronounced. The obtained solution provides valuable physical insight into the mechanics of cylindrical shells and serves as a benchmark for validating numerical implementations of relaxed micromorphic models.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20660v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "N. D. Dizon",
      "Q. Y. Huang",
      "T. D. Chuong",
      "G. Li",
      "V. Jeyakumar"
    ],
    "title": "Convergent Lifted Lasserre Hierarchy of SDPs for Minimizing Expectation of Piecewise Polynomial Loss over Wasserstein Balls",
    "abstract": "This paper investigates the minimization of the expectation of piecewise polynomial loss functions over Wasserstein balls. This optimization problem often appears as a key sub-problem of distributionally robust optimization problems. We establish the asymptotic convergence of a hierarchy of semi-definite programming (SDP) relaxations, providing a framework for approximating the optimal values of these inherently infinite-dimensional optimization problems. A central foundational contribution is the development of a new lifted positivity certificate: we demonstrate that piecewise polynomials positive over Archimedean basic semi-algebraic sets admit a structured system of sum-of-squares (SOS) representations. Furthermore, we prove that the proposed hierarchy achieves finite convergence under suitable conditions when the defining polynomials are convex. The practical utility and versatility of this approach are demonstrated via numerical experiments in revenue estimation and portfolio optimization.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20626v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Moreno Invitti"
    ],
    "title": "Almost cohomology of finite-dimensional Lie rings",
    "abstract": "We introduce almost cohomology groups for Lie rings definable in finite-dimensional theory. In particular, we define the 0th and 1st almost cohomology groups of a Lie ring module. Moreover, we prove that the 1st almost cohomology group of a finite-dimensional definable Lie ring module is finite if the 0th almost cohomology group is finite.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20617v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Yuancheng Ning",
      "Xiaoyan Yang"
    ],
    "title": "Grade and Cohen-Macaulayness for DG-modules",
    "abstract": "We establish an inequality relating the projective dimension of a DG-module in $\\mathrm{D}^\\mathrm{b}_\\mathrm{f}(A)$ to its grade and introduce the concept of perfect DG-modules as a natural generalization of perfect modules. It is proved that a DG-module $M$ over a local Cohen-Macaulay DG-ring with constant amplitude is Cohen-Macaulay if and only if $M$ is perfect and $\\mathrm{amp}M \\leq \\mathrm{amp}\\mathrm{R}Γ_{\\bar{\\mathfrak{m}}}(M)$. An affirmative answer is provided to Conjecture 2.11 of Yoshida [J. Pure Appl. Algebra 123 (1998) 313--326]. We also study the grade of DG-modules with finite injective dimension and examine the preservation of Cohen-Macaulayness under tensor products.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20552v1",
    "categories": [
      "math.OC",
      "q-fin.MF"
    ],
    "authors": [
      "Xinman Cheng",
      "Guanxing Fu",
      "Xiaonyu Xia"
    ],
    "title": "Stochastic Control Problems with Infinite Horizon and Regime Switching Arising in Optimal Liquidation with Semimartingale Strategies",
    "abstract": "We study an optimal control problem on infinite time horizon with semimartingale strategies, random coefficients and regime switching. The value function and the optimal strategy can be characterized in terms of three systems of backward stochastic differential equations (BSDEs) with infinite horizon. One of them is a system of linear BSDEs with unbounded coefficients and infinite horizon, which seems to be new in literature. We establish the existence of the solutions to these BSDEs by BMO analysis and comparison theorem for multi-dimensional BSDEs. Next, we establish that the optimal control problem is well posed, in the sense that the value function is finite and the optimal strategy-when it exists-is unique. This is achieved by reformulating the cost functional as the sum of a quadratic functional and the candidate value function. The reformulation crucially relies on the well-established well-posedness results for systems of BSDEs. Finally, under additional assumptions, we obtain the unique optimal strategy.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20506v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Lili Du",
      "Chunlei Yang"
    ],
    "title": "The singularity at degenerate points in steady axisymmetric compressible free surface flows with gravity",
    "abstract": "In this paper, we analyze the singular shape of the free boundary at degenerate points in a three dimensional axisymmetric compressible gravity flow. For all possible degenerate points on the free surface, we prove that the only nontrivial asymptotic behavior of the free surface at the stagnation points away from the axis of symmetry is the Stokes corner flow. The possible geometries for free boundaries at the non-stagnation axis points are downward pointing or upward pointing cusps. At the origin, there are only two nontrivial asymptotics possible: the Garabedian's pointed bubble or a horizontal flat surface.\n  The problem is associated with the analysis of the degenerate points of a quasilinear free boundary problem of the Bernoulli type, and the main obstacles are the absence of a Weiss-type monotonicity formula. To achieve our goal, we establish for the first time monotonicity formulas for quasilinear Bernoulli type free boundary problems. Our formula works both when the equation becomes singular and when the free boundary condition is degenerate.\n  Moreover, we establish a new nonlinear frequency formula at the horizontal flat points at the origin and integrate it with the compensated compactness theory for Euler equations, ensuring the strong convergence of variational solutions.\n  Our results resolve the Stokes conjecture [Mathematical and Physical Papers, Vol. I., 1880] in a generalized compressible, three dimensional axisymmetric framework. In addition, it can also be realized as a compressible counterpart to Vǎrvǎrucǎ and Weiss [Comm. Pure Appl. Math., (67), 2014]. Our approach is completely new and gives a systematic approach for studying singularities of a singular Bernoulli type quasilinear free boundary problem.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20481v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Fei Xu",
      "Bo Zhang"
    ],
    "title": "Single conjugacy classes of isometries in orthogonal groups over local fields",
    "abstract": "All isometries $σ$ in a quadratic space over a non-archimedean local field of characteristic not 2 satisfying that any isometry $τ$ which is conjugate to $σ$ in the general linear group is conjugate to $σ$ in the orthogonal group are determined. This extends \\cite[Theorem 2.1]{Mil} to arbitary cases.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20441v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Geunyoung Kim"
    ],
    "title": "An algorithm for Seifert surfaces in 3-manifolds via surgery presentations",
    "abstract": "The classical Seifert algorithm provides an explicit construction of a Seifert surface for any link in $S^3$. Alegria and Menasco extended this construction to integral homology $3$-spheres using Heegaard splittings. In this paper, we extend the Seifert algorithm to null-homologous links in arbitrary $3$-manifolds via surgery on framed links in $S^3$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20416v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Gane Samb Lo",
      "El Hadji Babou"
    ],
    "title": "Independence of the indicator functions of record values for Multivariate independent data",
    "abstract": "We consider a sequence of random vectors on \\(\\mathbb{R}^d, \\ d\\geq 1\\). We consider the record values based on the simultaneous strict inequality of the coordinates. The indicator record variable (irv) of the j-th observation is the function that assigns the value 1 (one) if that observation is a record value and the null value otherwise. Here, we give a detailed and a thorough proof that the indicator functions are independent, whenever the data are themselves independent, not necessarily <i>iid</i>, in \\(\\mathbb{R}^d, \\ d\\geq 1\\). We compare that proof with available proofs in dimension one. Indeed, in seminal works on records, in particular in Ahsanullah(2024), Nevzorov(2001), Resnick (1987), Ahsanullah and Nevzorov (2015), etc., the independence of record indicator functions is usually validated based on logical reasoning, and so, is not rigorously proved. This allows us to undertake a detailed and thorough proof for independent data, not necessity <i>iid</i>, in \\(\\mathbb{R}^d, \\ d\\geq 1\\). The proof includes leads for not even independent data.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20395v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Tristan Goodwill",
      "Jeremy Hoskins",
      "Zydrunas Gimbutas",
      "Bowei Wu"
    ],
    "title": "A parametrix for the surface Stokes equation",
    "abstract": "We introduce an integral equation formulation of the surface Stokes equations, constructed using two-dimensional Stokeslets. The resulting integral equations are Fredholm integral equations of the second kind and can be discretized to high order using standard tools. Since the resulting discrete linear systems are dense, we describe and analyze a proxy shell method to construct fast direct solvers for these systems. The properties of our integral equation, and the performance of the resulting numerical scheme, are illustrated with several representative numerical examples.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20390v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "James Chen",
      "Alan Edelman",
      "John Urschel"
    ],
    "title": "The largest 5th pivot may be the root of a 61st degree polynomial",
    "abstract": "This paper introduces a number of new techniques in the study of the famous question from numerical linear algebra: what is the largest possible growth factor when performing Gaussian elimination with complete pivoting? This question is highly complex, due to a complicated set of polynomial inequalities that need to be simultaneously satisfied. This paper introduces the JuMP + Groebner basis + discriminant polynomial approach as well as the use of interval arithmetic computations. Thus, we are introducing a marriage of numerical and exact mathematical computations.\n  In 1988, Day and Peterson performed numerical optimization on $n=5$ with NPSOL and obtained a largest seen value of $4.1325...$. This same best value was reproduced by Gould with LANCELOT in 1991. We ran extensive comparable experiments with the modern software tool JuMP and also saw the same value $4.1325...$. While the combinatorial explosion of possibilities prevents us from knowing there may not be a larger maximum, we succeed in obtaining the exact mathematical value: the number $4.1325...$ is exactly the root of a 61st degree polynomial provided in this work, and is a maximum given the equality constraints seen by JuMP. In light of the numerics, we pose the conjecture that this lower bound is indeed the maximum. We also apply this technique to $n = 6$, $7$, and $8$.\n  Furthermore, in 1969, an upper bound of $4\\frac{17}{18}\\approx 4.94$ was produced for the maximum possible growth for $n = 5$. We slightly lower this upper bound to $4.84$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20366v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ron M. Roth",
      "Ziyuan Zhu",
      "Changcheng Yuan",
      "Paul H. Siegel",
      "Anxiao Jiang"
    ],
    "title": "On the Height Profile of Analog Error-Correcting Codes",
    "abstract": "In recent work, it has been shown that maintaining reliability in analog vector--matrix multipliers can be modeled as the following coding problem. Vectors in $\\mathbb{R}^k$ are encoded into codewords of a linear $[n,k,d]$ code $C$ over $\\mathbb{R}$. For prescribed positive reals $δ< Δ$, additive errors of magnitude at most $δ$ are tolerable and need no handling, yet outlying errors of magnitude greater than $Δ$ are to be located or detected. The trade-off between the ratio $Δ/δ$ and the number of outlying errors that can be handled is determined by the height profile of $C$; as such, the height profile provides a finer description of the error handling capability of $C$, compared to the minimum distance $d$, which only determines the number of correctable errors. This work contains a further study of the notion of the height profile. Several characterizations of the height profile are presented, thereby yielding methods for computing it. The starting point is formulating this computation as an optimization problem that is solved by a set of linear programs. This, in turn, leads to a combinatorial characterization of the height profile as a maximum (or max--min) over a certain finite set of codewords of $C$. Moreover, this characterization is shown to have a simple geometric interpretation when the columns of the generator matrix of $C$ all have the same $L_2$ norm. Through examples of several code families, it is demonstrated how the results herein can be used to compute the height profile explicitly.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20365v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Moein Khalighi",
      "Chandler Ross",
      "Ville Laitinen",
      "Guilhem Sommeria-Klein",
      "Leo Lahti"
    ],
    "title": "Memory reshapes stability landscapes: resilience-resistance tradeoffs and critical transitions",
    "abstract": "Regime shifts in biology, ecology, and other complex systems are often interpreted through stability landscapes and early warning signals that implicitly assume dynamics without memory effects. Yet many real systems exhibit these effects, thus present dynamics depend on past states and past forcing. Here, we study how memory reshapes bistable stability landscapes and regime shifts using a minimal bistable model with a fractional derivative that controls memory strength. We connect landscape geometry to classical notions of resilience and resistance by quantifying basin curvature and the perturbation magnitude required to cross the unstable threshold, and we track how these quantities evolve in time after perturbations. Memory typically flattens basin floors, slowing recovery, while often increasing the perturbation threshold for stability transitions, revealing a tradeoff between resilience and resistance. Because the landscape becomes history-dependent and time-evolving, memory generates qualitative behaviors that do not appear in memory-free models, including delayed collapse or recovery after stress ends, rebound after apparently successful transition, and broadened hysteresis under gradual parameter change. Finally, we show that fitting a memory-free model to memory-driven data can reproduce trajectories while systematically shifting equilibrium branches and tipping locations, risking incorrect diagnosis and management of regime shifts. These results motivate a moving landscape view and provide practical guidance for interpreting observed anomalies and distinguishing memory-driven effects from noise.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20364v1",
    "categories": [
      "math.FA",
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "Max Carter",
      "Jared T. White"
    ],
    "title": "Non-Wiener groups with a Gelfand pair",
    "abstract": "Let $G$ be a non-amenable locally compact group and $K$ a compact subgroup of $G$ such that $(G,K)$ is a Gelfand pair. We show that if $G$ admits a suitable boundary representation which is topologically irreducible and not unitarizable, then $G$ is not a Wiener group in the sense that its Fourier transform does not satisfy the analogue of Wiener's Tauberian theorem. As an application, we show that if $G$ is a closed non-compact boundary transitive group of automorphisms of a connected locally finite graph with infinitely many ends, or a split reductive algebraic group over a non-archimedean local field, then $G$ is not Wiener.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20357v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Muhammad Khan",
      "Yangyang Xu"
    ],
    "title": "A variance reduced framework for (non)smooth nonconvex-nonconcave stochastic minimax problems with extended Kurdyka-Lojasiewicz property",
    "abstract": "In this paper, we study stochastic constrained minimax optimization problems with nonconvex-nonconcave structure, a central problem in modern machine learning, for which reliable and efficient algorithms remain largely unexplored due to its inherent challenges. Prior approaches for nonconvex minimax optimization often require (strong) concavity on the maximization part, or certain restrictive geometric assumptions on the joint objective to have guaranteed convergence. In contrast, our method only assumes weak convexity in the primal variable and the extended Kurdyka-Lojasiewicz (KL) property, with exponent $θ\\in [0,1]$, in the dual variable, significantly broadening the class of tractable problems. To this end, we propose a variance reduced algorithm that provably handles this general setting and achieves an $\\varepsilon$-stationary solution with state-of-the-art sample complexity: in the smooth finite-sum setting, the sample complexity is $\\mathcal{O}\\left(\\sqrt{N}\\,\\varepsilon^{-\\max\\{4θ,2\\}}\\right)$, where $N$ is the number of total samples, and in the online smooth setting, it is $\\mathcal{O}\\Big(\\varepsilon^{-\\max\\{6θ,3\\}}\\Big)$. For the structured nonsmooth problem, the sample complexity is $\\mathcal{O}\\left(\\sqrt{N}\\,\\max\\Big\\{\\varepsilon^{-3}, \\varepsilon^{-5θ}, \\varepsilon^{-\\frac{11θ-3}{2θ}}\\Big\\}\\right)$ and $\\mathcal{O}\\left(\\max\\left\\{\\varepsilon^{-4}, \\varepsilon^{-\\frac{15θ-1}{2}}, \\varepsilon^{-\\frac{31θ-9}{4θ}}\\right\\}\\right)$ respectively for the two settings. To the best of our knowledge, this is the first unified framework that jointly accommodates weak convexity, the extended KL property, and variance-reduced stochastic updates, making it highly suitable for large-scale applications.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20591v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Ping Wong Ng",
      "Cangyuan Wang"
    ],
    "title": "A note on purely infinite corona algebras and extensions",
    "abstract": "Let $\\mathcal{A}$ be a separable nuclear C*-algebra, and $\\mathcal{B}$ be a nonunital separable simple $\\mathcal{Z}$-stable C*-algebra. Continuing the work from Gabe-Lin-Ng, we classify all essential extensions, with large complement, of the form $$0 \\rightarrow \\mathcal{B} \\rightarrow \\mathcal{E} \\rightarrow \\mathcal{A} \\rightarrow 0,$$ for the following cases: i. $\\mathcal{C}(\\mathcal{B})$ is properly infinite, and the extension is full. ii. $\\mathcal{C}(\\mathcal{B})$ is purely infinite (though not necessarily simple). We also have some more general results.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20504v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "J. Castro",
      "J. Leaños",
      "O. Rosario"
    ],
    "title": "Corrections to classical results on Independence and Covering numbers of the Splitting graph",
    "abstract": "The splitting graph $S(G)$ of a finite simple graph $G$ was introduced by Sampathkumar and Walikar in 1980~\\cite{SW1980} and has been extensively studied in relation to graph invariants of $G$. In their original work, several formulas relating the independence number and the vertex cover number of $S(G)$ to the corresponding parameters of $G$ were stated and subsequently cited in the literature. In this paper, we show that some of these classical equalities do not hold in general. We present explicit counterexamples disproving the published results concerning independence and vertex cover numbers of splitting graphs. Moreover, we establish the correct formulas and precisely characterize the cases in which the original statements are valid and those in which they fail. These results correct an error that has remained unnoticed for more than four decades and provide a clearer understanding of splitting graphs from the perspective of independence and vertex cover number.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20455v1",
    "categories": [
      "cs.IT",
      "math.AC"
    ],
    "authors": [
      "Monica Lichtenwalner",
      "Hiram H. López",
      "Gretchen L. Matthews",
      "Padmapani Seneviratne"
    ],
    "title": "Permutation decoding of algebraic geometry codes from Hermitian and norm-trace curves",
    "abstract": "Permutation decoding is a process that utilizes the permutation automorphism group of a linear code to correct errors in received words. Given a received word, a set of automorphisms, called a PD set, moves errors out of the information positions so that the original message can be determined. In this paper, we investigate permutation decoding for certain families of algebraic geometry codes. Automorphisms of the underlying curve are used to specify permutation automorphisms of the code. Specifically, we describe permutation decoding sets that correct specific burst errors for one-point codes on Hermitian and norm-trace curves.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20434v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Dmitry Beliaev",
      "Akshay Hegde"
    ],
    "title": "High local maxima of stationary smooth Gaussian fields",
    "abstract": "Consider the point process (in $\\mathbb{R}^d$) of local maxima of smooth Gaussian fields, with sufficient decay of correlation at infinity, above a level $u$. We show that this point process, rescaled appropriately, converges weakly to a Poisson point process in the limit $u \\to \\infty$. Our proof relies on the classical observation that simple point processes are characterised by avoidance probabilities (i.e. $\\mathbb{P}(η(B)=0)$ for a point process $η$ and Borel set $B$). Then we approximate avoidance probability with the excursion probability, where the latter is well studied. Second main result is a quantified version of the Poisson convergence of high local maxima of the Bargmann-Fock field in $\\mathbb{R}^2$. We prove that, for Bargmann-Fock field in two dimensions, the total variation distance between a Poisson random variable and the number of local maxima of the field above a threshold $u$ in an $R \\times R$ box in $\\mathbb{R}^2$ decays like $\\exp(- βu^2)$, for some fixed $β>0$. As an immediate consequence, when the level $u$ is a function of $R$ such that $u(R) \\to \\infty$ and $u(R)/ \\sqrt{\\log R} \\to 0$ as $R \\to \\infty$, we have a quantitative central limit theorem for the number of high local maxima. The proof is based on the Chen-Stein method for quantitative Poisson approximation. We produce a close coupling of a stationary smooth field and its Palm version, which might be of independent interest.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20302v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Xia Xiao"
    ],
    "title": "On Weighted Twisted K-Energy and Its Applications",
    "abstract": "We establish the convexity of the weighted twisted Mabuchi K-energy functional along geodesics in the finite energy space $\\mathcal{E}^{1,T}(X,ω)$, covering the case of divisors with mixed cusp and conic singularities. We then prove that coercivity (relative to the complex torus) of this functional is an open condition under cone angle perturbations. This is obtained from a general result of independent interest, which shows the stability of the coercivity under perturbations by certain twist currents. In particular, this yields the openness for the existence for cscK cone metrics and proves that coercivity at the cusp limit implies existence of cscK cone metrics for small cone angles.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20286v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Kristin DeVleming"
    ],
    "title": "A guide to wall crossing for moduli of varieties",
    "abstract": "There have been major developments in the theory of moduli of varieties in the past decade, essentially settling the construction of moduli spaces of log canonically polarized slc pairs and moduli spaces of K-polystable log Fano pairs. Given the construction of these moduli spaces of pairs $(X, D)$, it is natural to ask how the moduli spaces vary as the coefficients of $D$ are perturbed. This phenomenon is known as wall crossing, the theory of which has been developed in several important cases in the past five years. This semi-expository article is an introduction to moduli of varieties and wall crossing, capturing a portion of the theory developed in the past several years. It also introduces tools and techniques used in explicit computations and examples, applying them in new examples.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20274v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Tatyana Barron",
      "Sarah Lanthier"
    ],
    "title": "Geometry and biological processes",
    "abstract": "We suggest a geometric approach to modeling biochemical processes, aiming at those processes that occur in humans with food sensitivities or chemical sensitivities.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20228v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Byung Hee An",
      "Gabriel C. Drummond-Cole",
      "Ben Knudsen"
    ],
    "title": "Corrigendum to \"Asymptotic homology of graph braid groups\"",
    "abstract": "We correct an error in the paper referred to in the title. Part of the argument is organized as a general method for establishing when (derived) functors factor through a fixed Serre subcategory, which may be of some more general interest.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20184v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Runji Li",
      "Yuxuan Li"
    ],
    "title": "The Adams differentials on the $e$-family",
    "abstract": "The New Doomsday Conjecture (Minami, Amer. J. Math., 1995) states that, for any nonzero $\\mathrm{Sq}^0$-family, only finitely many terms in this family survive to the $E_\\infty$-page. On the Adams $1$ and $2$-line, the conjecture, which corresponds to the Hopf invariant problem and the Kervaire invariant problem, were solved by Adams (Ann. of Math., 1960) and Hill-Hopkins-Ravenel (arXiv:0908.3724), respectively. On the Adams $3$-line, Burklund and Xu (arXiv:2302.11869) established a family of nontrivial differentials on the $h_j^3$ family, and in particular developed the Burklund-Xu Spectral Sequence, to study the non-triviality of its target on the Adams $E_2$-page.\n  In this paper, we use the Burklund-Xu Spectral Sequence to establish the non-triviality of a product on the Adams $6$-line. Combining this with Bruner's formula by Bruner et al. (LNM 1176, 1986), we prove the New Doomsday Conjecture for the $e$-family on the Adams $4$-line.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20766v1",
    "categories": [
      "math.CO",
      "math.AG",
      "math.MG"
    ],
    "authors": [
      "Sean Dewar",
      "Anthony Nixon",
      "Ben Smith"
    ],
    "title": "The $d$-dimensional realisation number of a rigid graph",
    "abstract": "Determining the number of (complex) realisations of a rigid graph for a specific choice of edge lengths is a fundamental problem in discrete geometry. In this article we provide two new tools for determining realisation numbers in arbitrary dimensions: (i) we prove that subgraph inclusion translates to realisation number divisibility; and (ii) we provide lower bounds on realisation numbers under specific graph operations in all dimensions. We use these methods to prove that every triangulated sphere with $n$ vertices has at least $2^{n-4}$ edge-length equivalent realisations in 3-dimensions, extending a 2-dimensional result of Jackson and Owen in the case of planar graphs. Additionally, our tools solve a family of conjectures set by Grasegger regarding how 1-extensions, X-replacements, and V-replacements affect realisation numbers.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20755v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Stefano Ambra",
      "Andrea Montoli",
      "Diana Rodelo"
    ],
    "title": "The direction functor for Schreier extensions of monoids",
    "abstract": "We observe that the process of associating an action to any Schreier extension of monoids with commutative and cancellative kernel is functorial. We show that this functor is a generalisation of the direction functor, used to give a categorical description of non-abelian cohomology in terms of extensions. We further prove that our functor is a conservative, product preserving cofibration and from this we conclude that its fibres are endowed with a canonical symmetric monoidal structure. The commutative monoids obtained as connected components of these symmetric monoidal categories are isomorphic to Patchkoria second cohomology monoids of a monoid with coefficients in semimodules.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20741v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "M R Turner",
      "D J B Lloyd"
    ],
    "title": "Dynamic interactions and equilibrium configurations of pulses in the two-dimensional complex quintic Ginzburg-Landau equation",
    "abstract": "This paper constructs a fast and effective novel numerical scheme which accurately calculates the dynamics of weakly-interacting pulses in the two-dimensional quintic-complex Ginzburg-Landau equation (QCGLE). The numerical scheme uses a global centre-manifold reduction, where the solution to the QCGLE is constructed as the sum of the individual pulses plus a remainder function, which is chosen to be orthogonal to the zero adjoint eigenmodes of the QCGLE linear operator. Projecting this constructed solution onto the stable centre-manifold leads to a fast-slow system of equations consisting of {\\it slow} ordinary differential equations for the position and phases of the individual pulses and a {\\it fast} partial differential equation for the remainder function. By considering the pulses to be well-separated, the system can be expanded asymptotically in terms of the small parameter $ε=e^{-λ_r d}\\ll1$, where $λ_r$ is the spatial decay rate of the pulse, and $d>0$ is the minimum pulse separation distance. Here the remainder function is determined via a stationary partial differential equation that can be readily solved in an efficient manner using GMRES. Results for $N=2,3,4$ and $5$ pulses are considered, and it is found that different equilibrium solutions are possible such as stable fixed points and limit cycles. The interaction of two stable $N=3$ coherent structures is also considered, where the common tendency found is for the structure to degenerate into pairs of pulses which propagate away from the initial configuration of pulses.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20736v1",
    "categories": [
      "math.LO",
      "math.NT"
    ],
    "authors": [
      "Philip Dittmann"
    ],
    "title": "Existential theories of henselian valued fields under a formal smoothness assumption",
    "abstract": "We study existential theories of henselian valued fields of positive characteristic with parameters from a trivially valued subfield. Compared to previous work, we relax perfectness and separability assumptions, and instead work with the weaker algebraic hypothesis of formal smoothness over the parameter field, which we discuss in detail in our setting. Assuming a weak consequence of resolution of singularities, which was already used in previous work, we obtain an axiomatisation of the existential theory of such a valued field in terms of the existential theory of the residue field, both over the same parameter field. This result has natural applications to asymptotic theories of completions of function fields of curves. We work these out in detail for the case of function fields over fairly general pseudo-algebraically closed fields, where we obtain decidability of the sets of universal/existential sentences holding in all completions or all but finitely many completions, respectively.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20703v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Yutaro Hiroi"
    ],
    "title": "Quotients by $(p-1)/p$-klt Foliations on Surfaces",
    "abstract": "We study the relation between birational singularities of 1-foliations and those of their quotients. We prove that the quotient $X/\\mathcal{F}$ is log canonical (resp. klt) if and only if $\\mathcal{F}$ is $\\frac{p-1}{p}$-log canonical (resp. $\\frac{p-1}{p}$-klt). Moreover, we obtain the classification of klt quotients by $1$-foliations on regular surfaces in the cases $p=2,3$ and $5$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20699v1",
    "categories": [
      "math.AP",
      "math.DS"
    ],
    "authors": [
      "Razvan Gabriel Iagar",
      "Ariel Sánchez",
      "Erik Sarrion-Pedralva"
    ],
    "title": "Global self-similar solutions for Hardy-Hénon equations with linear and quasilinear diffusion",
    "abstract": "Global self-similar solutions to the parabolic Hardy-Hénon equation $$ u_t=Δu^m+|x|^σu^p, \\quad (x,t)\\in\\mathbb{R}^N\\times(0,\\infty), $$ are classified in the range of exponents $m\\geq1$, $p>m$ and $σ>\\max\\{-2,-N\\}$. The classification varies strongly with respect to the celebrated \\emph{Fujita} and \\emph{Sobolev critical exponents} $$ p_F(σ)=m+\\frac{σ+2}{N}, \\quad p_S(σ)=\n  \\begin{cases}\n  \\frac{m(N+2σ+2)}{N-2}, & \\mbox{if } N\\geq3, \\\\[1mm]\n  \\infty, & \\mbox{if } N\\in\\{1,2\\}.\n  \\end{cases} $$ Indeed, if $p\\in(p_F(σ),p_S(σ))$, both equations admit self-similar solutions with either compact support (if $m>1$) or Gaussian-like tail as $|x|\\to\\infty$ (if $m=1$), as well as a one-parameter family satisfying $$ u(x,t)\\sim C|x|^{-(σ+2)/(p-m)}, \\quad {\\rm as} \\ |x|\\to\\infty. $$ If $p\\geq p_S(σ)$, there are only self-similar solutions with the latter algebraic tail, while for $m<p\\leq p_F(σ)$ no global solutions exist. The results open the way for a deeper study of the role of these solutions in the dynamics of the Hardy-Hénon equations.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20697v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Vladimír Lukeš",
      "Eduard Rohan"
    ],
    "title": "Reduced-order computational homogenization for hyperelastic media using gradient based sensitivity analysis of microstructures",
    "abstract": "We propose an algorithm for the computational homogenization of locally periodic hyperelastic structures undergoing large deformations due to external quasi-static loading. The algorithm performs clustering of macroscopic deformations into subsets called \"centroids\", and, as a new ingredient, approximates the homogenized coefficients using sensitivity analysis of micro-configurations with respect to the macroscopic deformation. The novel \"model-order reduction\" approach significantly reduces the number of microscopic problems that must be solved in nonlinear simulations, thereby accelerating the overall computational process. The degree of reduction can be controlled by a user-defined error tolerance parameter. The algorithm is implemented in the finite element framework SfePy, and its performance effectiveness is demonstrated using two-dimensional test examples, when compared with solutions obtained by the proper orthogonal decomposition method, and by the full \"FE-square\" simulations. Extensions beyond the present implementations and the scope of tractable problems are discussed.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20613v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Xueqin Hu",
      "Kun Zhang",
      "Yuanyang Zhou"
    ],
    "title": "Hyperfocal subalgebras of hyperfocal abelian Frobenius blocks",
    "abstract": "In this paper, we introduce a class of blocks which is called hyperfocal abelian Frobenius blocks.This class of blocks is an analogous version of the block with abelian defect group and Frobenius inertial quotient at hyperfocal level and includes the blocks with Klein four hyperfocal subgroups and cyclic hyperfocal subgroups. We show that there is a stable equivalence of Morita type between the hyperfocal subalgebras of the hyperfocal abelian Frobenius blocks and a group algebra of a Frobenius group associated with the hyperfocal subgroup of the block. As applications, we can partially describe some structures of the blocks with Klein four hyperfocal subgroups and cyclic hyperfocal subgroups,such as the structures of their hyperfocal subalgebras in terms of derived categories and the structures of their characters. As a consequence, we show that Broue's abelian defect group conjecture holds for blocks with Klein four hyperfocal subgroups.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20606v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Michael Reilly"
    ],
    "title": "Uniform Weighted Averages and a Conjecture of Bergelson, Moreira, and Richter",
    "abstract": "We confirm a conjecture posed by Bergelson, Moreira, and Richter (arXiv:1711.05729), and in particular show that for every probability measure preserving system $(X,\\mathscr{B},μ,T)$, every $k\\in \\mathbb{N}$, every set $A\\in \\mathscr{B}$ with $μ(A)>0$, and every tempered function $f$, \\[\n  \\lim_{N\\to\\infty}\\frac{1}{N}\\sum_{n=1}^Nμ(A\\cap T^{-\\lfloor{f(n)\\rfloor}}A\\cap T^{-\\lfloor{f(n+1)\\rfloor}}A\\cap \\cdots \\cap T^{-\\lfloor{f(n+k)\\rfloor}}A)>0. \\] This is achieved by establishing conditions on an increasing function $W:\\mathbb{N}\\rightarrow (0,\\infty)$ such that if $(x_n)_{n\\in \\mathbb{N}}$ is a bounded sequence in a Banach space with \\[ \\lim_{W(N)-W(M)\\to\\infty}\\frac{1}{W(N)-W(M)}\\sum_{n=M}^N (W(n)-W(n-1))x_n =L \\] then the limit of Cesàro averages of $(x_n)_{n\\in \\mathbb{N}}$, $\\lim_{N\\to\\infty}\\frac{1}{N}\\sum_{n=1}^Nx_n$ is also equal to $L$.\n  Furthermore, the methods we develop can be used to sharpen some of the combinatorial results obtained by Bergelson, Moreira, and Richter. For example, if $E$ is a set of positive upper density, then for any $k\\in \\mathbb{N}$, any $ε>0$, and all sufficiently large $N\\in \\mathbb{N}$ there is an $n\\in [N-N^{1/2+ε},N]$ such that\n  \\[\\{a,a+\\lfloor{n^{3/2}\\rfloor},a+\\lfloor{(n+1)^{3/2}\\rfloor},\\dots ,a +\\lfloor{(n+k)^{3/2}\\rfloor}\\}\\subseteq E.\n  \\]",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20599v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Geonhee Lee",
      "Kwonyeol Park",
      "Hyeongjun Park",
      "Jinwoo An",
      "Junil Choi"
    ],
    "title": "Efficient Solvers for Coupling-Aware Beamforming in Continuous Aperture Arrays",
    "abstract": "In continuous aperture arrays (CAPAs), careful consideration of the underlying physics is essential, among which electromagnetic (EM) mutual coupling plays a critical role in beamforming performance. Building on a physically consistent mutual coupling model, the beamforming design is formulated as a functional optimization whose optimality condition leads to a Fredholm integral equation. The incorporation of the coupling model, however, substantially increases computational complexity, necessitating efficient and accurate integral equation solvers. In this letter, we propose two efficient solvers: 1) a coordinate-transformation-based kernel approximation that preserves the operator structure while alleviating discretization demands, and 2) a direct lower-upper (LU)-based solver that stably handles the Nyström-discretized system. Numerical results demonstrate improved accuracy and reduced computational overhead compared to conventional methods, with the LU-based solver emerging as an efficient and scalable solution for large-scale CAPA optimization via offline factorization.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20681v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Sirui Lin",
      "Zijun Gao",
      "Jose Blanchet",
      "Peter Glynn"
    ],
    "title": "Statistical Inference in Causal Partial Identification with Smooth Densities",
    "abstract": "Many causal quantities are only partially identifiable due to the inherent missingness of potential outcomes, and the associated partial identification (PI) sets can be obtained by solving an optimal transport (OT) problem. Covariates often provide additional information about the potential outcomes and thus yield tighter PI sets, which can be obtained via conditional optimal transport (COT). However, COT-based PI set estimators are susceptible to the curse of dimensionality in the covariates and outcomes, which precludes the asymptotic normality and hinders statistical inference. In this paper, we exploit smoothness in the marginal densities of covariates and potential outcomes and develop a wavelet-based primal method for COT with multivariate outcomes and covariates. Moreover, for quadratic cost functions, we establish a stability result for COT and prove asymptotic normality of the proposed estimator. This characterization of the asymptotic distribution enables valid statistical inference for the partial identification set. Empirically, we validate the estimation and inference performance of our approach through numerical experiments in comparison with existing benchmarks.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20335v1",
    "categories": [
      "math.AG",
      "math-ph",
      "math.CT"
    ],
    "authors": [
      "Dongjian Wu",
      "Nantao Zhang"
    ],
    "title": "The $G$-Noncommutative Minimal Model Program",
    "abstract": "In this paper, we study the $G$-equivariant noncommutative minimal model program ($G$-NMMP), as an equivariant generalization of the framework introduced in arXiv:2301.13168. The aim of this program is to construct quasi-convergent paths in the spaces of Bridgeland stability conditions on derived categories of $G$-equivariant coherent sheaves. For finite groups, we employ induction techniques to construct such paths from the non-equivariant setting. In the setting of algebraic group actions, we introduce the notion of $\\mathbb T$-stability conditions to reformulate the proposal, and then we construct quasi-convergent paths for equivariant projective spaces from small quantum cohomology.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20190v1",
    "categories": [
      "math.NT",
      "math.MG"
    ],
    "authors": [
      "Takashi Hirotsu"
    ],
    "title": "Algebraic Characterization of Angle Multisections over Rings",
    "abstract": "Let $m,$ $n \\geq 2$ be integers, and let $R$ be a subring of $\\mathbb R$ with field of fractions $F.$ In this article, we generalize the rational angle bisection problem previously proposed by the author as follows: characterize the pairs of linearly independent vectors $\\vec{a},$ $\\vec{b} \\in R^n$ that form angles with sequences of $m$-sector vectors lying in $R^n.$ When $\\vec{a}$ and $\\vec{b}$ are nonorthogonal, we prove that this condition is equivalent to the existence of a root in $F$ of a certain $m$-th degree polynomial over $R.$ In particular, when $R = \\mathbb Z,$ the condition holds if and only if the polynomial has a root among the divisors of its constant term. When $m = 2^e$ with integer $e \\geq 1,$ we also prove that the condition is equivalent to $\\cos (θ/2^{e-1}) \\in F,$ where $θ$ is the angle between $\\vec{a}$ and $\\vec{b}.$",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20182v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Tomoro Okubo",
      "Yuzuri Kashiwagi",
      "Nobumitsu Niida"
    ],
    "title": "Recursive Patterns in the Chocolate Game",
    "abstract": "We study the recursive structure of P-positions in the chocolate game $C_{m,m}$, an impartial game played on an $m \\times m$ chocolate bar. We show that the set of P-positions exhibits self-similar patterns that can be described and enumerated recursively. We further establish a correspondence between these patterns and the cross-sections of a three-dimensional Sierpiński octahedron. Finally, we show that the P-positions can be generated by a second-order cellular automaton, analogous to the onedimensional Rule-60 automaton. Our results reveal deep connections between combinatorial games, fractal geometry, and discrete dynamical systems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20529v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Junren Qin",
      "Fan Jiang",
      "Tao Yang",
      "Shanxiang Lyu",
      "Rongke Liu",
      "Shi Jin"
    ],
    "title": "On the Optimal Integer-Forcing Precoding: A Geometric Perspective and a Polynomial-Time Algorithm",
    "abstract": "The joint optimization of the integer matrix $\\mathbf{A}$ and the power scaling matrix $\\mathbf{D}$ is central to achieving the capacity-approaching performance of Integer-Forcing (IF) precoding. This problem, however, is known to be NP-hard, presenting a fundamental computational bottleneck. In this paper, we reveal that the solution space of this problem admits a intrinsic geometric structure: it can be partitioned into a finite number of conical regions, each associated with a distinct full-rank integer matrix $\\mathbf{A}$. Leveraging this decomposition, we transform the NP-hard problem into a search over these regions and propose the Multi-Cone Nested Stochastic Pattern Search (MCN-SPS) algorithm. Our main theoretical result is that MCN-SPS finds a near-optimal solution with a computational complexity of $\\mathcal{O}\\left(K^4\\log K\\log_2(r_0)\\right)$, which is polynomial in the number of users $K$. Numerical simulations corroborate the theoretical analysis and demonstrate the algorithm's efficacy.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20488v1",
    "categories": [
      "math.DG",
      "math.AG"
    ],
    "authors": [
      "Naoto Yotsutani"
    ],
    "title": "Projective bundles that admit coupled Kähler-Einstein metrics but no Kähler-Einstein metrics",
    "abstract": "Using Hultgren's polytope formulation of the existence of coupled Kähler-Einstein (cKE) metrics on toric Fano manifolds, we construct explicit higher-dimensional toric Fano manifolds that admit two coupled Kähler-Einstein metrics but no ordinary Kähler-Einstein metrics. In particular, we exhibit such examples among certain projective bundles over products of projective spaces. Motivated by these constructions, we conjecture that examples of this type exist in all dimensions $n\\geq 4$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20469v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Sung-Soo Byun",
      "Joo Young Park"
    ],
    "title": "Numerical ranges of non-normal random matrices: elliptic Ginibre and non-Hermitian Wishart ensembles",
    "abstract": "The numerical range of a non-normal matrix plays a central role as a descriptor of non-normal effects beyond spectral information. We study a class of fundamental non-Hermitian random matrix ensembles that interpolate between the Hermitian and non-Hermitian regimes. Our analysis focuses on the elliptic Ginibre ensemble and its chiral counterpart, as well as on non-Hermitian Wishart matrices. For each of these models, we explicitly characterise the geometry of the numerical range in the large-system limit. In particular, we show that for the elliptic Ginibre ensemble and its chiral version, the limiting numerical range is an ellipse, whereas for the non-Hermitian Wishart ensemble it is described by a non-elliptic envelope.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20462v1",
    "categories": [
      "math.CA",
      "cs.IT",
      "math.CO"
    ],
    "authors": [
      "Polona Durcik",
      "Paata Ivanisvili",
      "Joris Roos",
      "Xinyuan Xie"
    ],
    "title": "Sharp isoperimetric inequalities on the Hamming cube II: The critical exponent",
    "abstract": "A sharp isoperimetric inequality for the Hamming cube is proved at the critical exponent $β=\\frac12$. This follows up on previous work, where such bounds were established for $β$ near $\\frac12$. As a consequence, this result settles a conjecture of Kahn and Park on cube partitions and yields a sharp $L^1$ Poincaré inequality for Boolean-valued functions. It also confirms a low-noise limit for balanced functions predicted by the Hellinger conjecture on noisy Boolean channels in information theory.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20425v1",
    "categories": [
      "math.CO",
      "cs.CG"
    ],
    "authors": [
      "Mikael Vejdemo-Johansson"
    ],
    "title": "Incomplete Open Platonic Solids",
    "abstract": "Sol LeWitt famously enumerated all the incomplete open cubes, finding 122 of these connected, non-planar subsets of the edges of the cube.\n  Since then, while several projects have revisited the cube enumeration, no such enumeration has been published for any other interesting solid.\n  In this paper we present work on enumerating all the incomplete open platonic solids, finding 6 tetrahedra, 122 cubes (just like LeWitt), 185 octahedra, 2\\,423\\,206 dodecahedra and 16\\,096\\,166 icosahedra.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20392v1",
    "categories": [
      "math.SP",
      "math.AP"
    ],
    "authors": [
      "Travis Cunningham"
    ],
    "title": "Improved fractal Weyl bounds matching improved spectral gaps for hyperbolic surfaces and open quantum maps",
    "abstract": "We prove a new fractal Weyl upper bound for the high-energy distribution of resonances of convex co-compact hyperbolic surfaces which matches the improved spectral gap given by Fourier decay. This improves upon the fractal Weyl bound of Dyatlov which matches the Patterson-Sullivan spectral gap. We also give a new resolvent estimate improving the ones given by Dyatlov-Zahl and Dyatlov. Analogous results are obtained for quantum open baker's maps, improving an estimate of Dyatlov-Jin, where we also give an improved fractal Weyl bound matching a spectral gap given by additive energy estimates. We refine known methods for proving fractal Weyl bounds which reduce the problem to an estimate of a certain determinant function; however, we use a different determinant function which allows us to make sharper estimates by applying the methods of proof of the fractal uncertainty principle in each setting.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20384v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Gabriela Hinojosa",
      "Ulises Morales-Fuentes",
      "Rogelio Valdez",
      "Alberto Verjovsky"
    ],
    "title": "Wild knots embedded in the Menger Sponge",
    "abstract": "In this paper, we prove that there exist infinitely many non-equivalent wild knots embedded in the Menger sponge, each with its set of wild points being a subset of a tame Cantor set. Even more, any wild knot of dynamically defined type obtained as the inverse limit of a sequence of nested pearl chain necklaces constructed via the action of a Kleinian group is isotopic to a wild knot contained in the Menger sponge. As a consequence, there are infinitely many wild knots contained in the Sierpiński 2-dimensional carpet.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20381v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Camille Labourie"
    ],
    "title": "Uniform rectifiability of brittle fractures in linear elasticity",
    "abstract": "We prove the uniform rectifiability of brittle fractures in arbitrary dimension. The existing approach for the Mumford-Shah functional, which relies on separation-type properties of the singular set, faces serious obstacles in the Griffith setting due to the lack of coarea formula for the symmetric gradient. We present an alternative route to uniform rectifiability for free-discontinuity problems by proving that cracks have ``plenty of big projections''.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20368v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Mays S. Abdul Ameer",
      "Abdul Rahman S. Juma",
      "Raheam A. Al-Saphory"
    ],
    "title": "On Harmonic Univalent Functions Defined by Dziok-Srivastava Operator",
    "abstract": "The purpose of this work is to present a class of harmonic univalent functions defined by the Dziok-Srivastava operator. Some geometric properties like coefficients conditions, distortion theorem, convolution (Hadamard product), convex combination and extreme points are investigated.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20361v1",
    "categories": [
      "cs.IT",
      "cs.AI",
      "cs.LG"
    ],
    "authors": [
      "Mohanad Obeed",
      "Ming Jian"
    ],
    "title": "Learning During Detection: Continual Learning for Neural OFDM Receivers via DMRS",
    "abstract": "Deep neural networks (DNNs) have been increasingly explored for receiver design because they can handle complex environments without relying on explicit channel models. Nevertheless, because communication channels change rapidly, their distributions can shift over time, often making periodic retraining necessary. This paper proposes a zero-overhead online and continual learning framework for orthogonal frequency-division multiplexing (OFDM) neural receivers that directly detect the soft bits of received signals. Unlike conventional fine-tuning methods that rely on dedicated training intervals or full resource grids, our approach leverages existing demodulation reference signals (DMRS) to simultaneously enable signal demodulation and model adaptation. We introduce three pilot designs: fully randomized, hybrid, and additional pilots that flexibly support joint demodulation and learning. To accommodate these pilot designs, we develop two receiver architectures: (i) a parallel design that separates inference and fine-tuning for uninterrupted operation, and (ii) a forward-pass reusing design that reduces computational complexity. Simulation results show that the proposed method effectively tracks both slow and fast channel distribution variations without additional overhead, service interruption, or catastrophic performance degradation under distribution shift.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20719v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Peiyao Zhao",
      "Rui Wang",
      "Tingting Wu",
      "Yuesheng Xu"
    ],
    "title": "The Adaptive Solution of High-Frequency Helmholtz Equations via Multi-Grade Deep Learning",
    "abstract": "The Helmholtz equation is fundamental to wave modeling in acoustics, electromagnetics, and seismic imaging, yet high-frequency regimes remain challenging due to the ``pollution effect''. We propose FD-MGDL, an adaptive framework integrating finite difference schemes with Multi-Grade Deep Learning to efficiently resolve high-frequency solutions. While traditional PINNs struggle with spectral bias and automatic differentiation overhead, FD-MGDL employs a progressive training strategy, incrementally adding hidden layers to refine the solution and maintain stability. Crucially, when using ReLU activation, our algorithm recasts the highly non-convex training problem into a sequence of convex subproblems. Numerical experiments in 2D and 3D with wavenumbers up to $κ=200$ show that FD-MGDL significantly outperforms single-grade and conventional neural solvers in accuracy and speed. Applied to an inhomogeneous concave velocity model, the framework accurately resolves wave focusing and caustics, surpassing the 5-point finite difference method in capturing sharp phase transitions and amplitude spikes. These results establish FD-MGDL as a robust, scalable solver for high-frequency wave equations in complex domains.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20679v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Andreu Martorell",
      "Pep Mulet",
      "Dionisio F. Yáñez"
    ],
    "title": "Implicit-explicit all-speed schemes for compressible Cahn-Hilliard-Navier-Stokes equations",
    "abstract": "We propose a second-order implicit-explicit (IMEX) time-stepping scheme for the isentropic, compressible Cahn-Hilliard-Navier-Stokes equations in the low Mach number regime.\n  The method is based on finite differences on staggered grids and is specifically designed to handle the challenges posed by the low Mach number limit, where the system approaches to an incompressible behavior.\n  In this regime, standard explicit schemes suffer from severe time-step restrictions due to fourth-order diffusion terms and the stiffness induced by fast acoustic waves.\n  To overcome this, we employ an IMEX strategy which splits the governing equations into stiff and non-stiff components.\n  The stiff terms, arising from pressure, viscous forces and fourth-order Cahn-Hilliard contributions, are treated implicitly, while the remaining are dealt explicitly.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20649v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Arnaud Bodin",
      "Christian Drouin"
    ],
    "title": "Solutions of polynomial equations in several variables modulo a prime power",
    "abstract": "We explain how to obtain the set of solutions of a multivariate polynomial equation modulo a power of a prime number. These solutions are determined by a tree, called the trunk, which makes it possible to reconstruct all solutions. We apply these methods to determine the number of solutions, without having to enumerate them. We also illustrate these techniques by proving a simple case of Igusa's theorem: the Poincaré series associated with a polynomial in two separated variables is rational.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20635v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ken Nakamura",
      "Takayuki Nozaki"
    ],
    "title": "Insertion Correcting Capability for Quantum Deletion-Correcting Codes",
    "abstract": "This paper proves that any quantum t-deletion-correcting codes also correct a total of t insertion and deletion errors under a certain condition. Here, this condition is that a set of quantum states is defined as a quantum error-correcting code if the error spheres of its states are disjoint, as classical coding theory. In addition, this paper proposes the quantum indel distance and describes insertion and deletion errors correcting capability of quantum codes by this distance.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20607v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Aleksandar Mijatović",
      "Andrey Pilipenko",
      "Isao Sauzedde"
    ],
    "title": "Functional central limit theorem for superdiffusive SDEs with stable noise",
    "abstract": "This paper establishes a functional stable central limit theorem for a class of superdiffusive solutions to stochastic differential equations driven by an $α$-stable process.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20737v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Shaunak V. Deo",
      "Bharathwaj Palvannan"
    ],
    "title": "On local characterizations of Hida families of Siegel modular forms",
    "abstract": "We provide new local characterizations of Hida families of Siegel modular forms with genus two arising from automorphic inductions (stable Yoshida lifts), analogous to the characterizations of Hida families of CM modular forms provided by Ghate--Vatsal. Our characterizations involve (i) density of de Rham at $p$ specializations at the singular weights $(k,2)$ and (ii) local decomposability at $p$ of the associated $Λ$-adic Galois representation. Our approach is similar to that of Castella--Wang-Erickson who provided an alternate strategy to reproving the main results of Ghate--Vatsal by applying Ribet's method when an anti-cyclotomic class group is assumed to be pseudo-null and cyclic as a $Λ$-module. Along these lines, one key input to our methods involves an assumption of pseudo-nullity of Selmer groups that are defined by imposing stricter conditions at $p$ than those imposed for the usual Greenberg Selmer groups appearing in the Asai main conjectures over real quadratic fields. Following Genestier--Tilouine and Pilloni, we also prove a minimal $R=\\mathbb{T}$ theorem that is essential to establishing our results at various stages.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20646v1",
    "categories": [
      "math.OC",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Boao Kong",
      "Hengrui Zhang",
      "Kun Yuan"
    ],
    "title": "On the Convergence of Stochastic Gradient Descent with Perturbed Forward-Backward Passes",
    "abstract": "We study stochastic gradient descent (SGD) for composite optimization problems with $N$ sequential operators subject to perturbations in both the forward and backward passes. Unlike classical analyses that treat gradient noise as additive and localized, perturbations to intermediate outputs and gradients cascade through the computational graph, compounding geometrically with the number of operators. We present the first comprehensive theoretical analysis of this setting. Specifically, we characterize how forward and backward perturbations propagate and amplify within a single gradient step, derive convergence guarantees for both general non-convex objectives and functions satisfying the Polyak--Łojasiewicz condition, and identify conditions under which perturbations do not deteriorate the asymptotic convergence order. As a byproduct, our analysis furnishes a theoretical explanation for the gradient spiking phenomenon widely observed in deep learning, precisely characterizing the conditions under which training recovers from spikes or diverges. Experiments on logistic regression with convex and non-convex regularization validate our theories, illustrating the predicted spike behavior and the asymmetric sensitivity to forward versus backward perturbations.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20642v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Mo Chen",
      "Chongzhi Huang",
      "Hao Wu"
    ],
    "title": "Multi-time Loewner energy: rate function for large deviation",
    "abstract": "The classification of probability measures that satisfy both conformal invariance and domain Markov property is equivalent to characterizing solutions to the Belavin--Polyakov--Zamolodchikov (BPZ) equations, as established by Dubédat~[Dub07]. In this context, the partition functions for half-watermelon SLE and for multi-radial SLE serve as fundamental solutions to the BPZ equations. In this article, we investigate the large deviation principle for both half-watermelon SLE and multi-radial SLE. The associated rate function is given by the multi-time Loewner energy, introduced in~[CHPW26]. As applications, we provide an alternative proof of the large deviation principle for Dyson Brownian motion, as well as a new derivation of the boundary perturbation property of the multi-time Loewner energy.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20631v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Chan Zhao",
      "Haiying Li",
      "Tianshui Ma"
    ],
    "title": "Symmetric Rota-Baxter systems and applications",
    "abstract": "Rota-Baxter operators and bialgebras are closely connected in several applications, such as the Connes-Kreimer renormalization framework and the operator approach to the classical Yang-Baxter equation. The concept of a Rota-Baxter system was introduced in 2016 as a generalization of a Rota-Baxter operator. In this work, we introduce a bialgebra structure compatible with a symmetric Rota-Baxter system, called a symmetric Rota-Baxter antisymmetric infinitesimal (ASI) bisystem. This bialgebra is characterized by generalizations of matched pairs of algebras and double constructions of Frobenius algebras to the setting of symmetric Rota-Baxter systems. Investigating the coboundary case leads to an enriched version of the associative Yang-Baxter equation (aYBe) adapted to symmetric Rota-Baxter systems. Antisymmetric solutions of this equation are used to construct symmetric Rota-Baxter ASI bisystems. We also introduce the notion of an $\\mathcal{O}$-operator on a symmetric Rota-Baxter system, which produces solutions of the admissible aYBe in such systems and thereby gives rise to symmetric Rota-Baxter ASI bisystems. A symmetric Rota-Baxter bisystem generalizes several known structures, including Rota-Baxter Lie bisystems, Rota-Baxter ASI bialgebras, Rota-Baxter Lie bialgebras, averaging ASI bialgebras, averaging Lie bialgebras, and special apre-perm bialgebras.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20623v1",
    "categories": [
      "math.DS",
      "math.GR"
    ],
    "authors": [
      "Jade Angela Hope Audouard",
      "Guillaume Theyssier"
    ],
    "title": "On K{\\r u}rka's dichotomy for cellular automata on groups",
    "abstract": "This paper is about topological dynamics of cellular automata on finitely generated groups. We tackle the problem of determining for which group sensitivity to initial conditions is equivalent to the absence of equicontinuity points (so-called K{\\r u}rka's dichotomy). We show that the dichotomy holds on any virtually-Z group but not on free groups with 2 or more generators. We also show that if it holds on some group, it must hold on any of its subgroups.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20326v1",
    "categories": [
      "math.OC",
      "math-ph"
    ],
    "authors": [
      "Ghorbanali Haghighatdoost"
    ],
    "title": "Poisson Hamiltonian Pontryagin Dynamics and Optimal Control of Mechanical Systems on Lie Groupoids",
    "abstract": "We develop a Poisson Hamiltonian formulation of Pontryagin dynamics for optimal control of mechanical systems on Lie groupoids. The reduced dynamics is formulated intrinsically on the dual Lie algebroid endowed with its canonical linear Poisson structure and evolves on its symplectic leaves. The main result of this work shows that symplectic leaves, rather than coadjoint orbits, provide the natural reduced phase spaces for Pontryagin dynamics on Lie groupoids. Under suitable regularity assumptions, we prove the equivalence between the variational formulation of the optimal control problem and the associated Poisson Hamiltonian Pontryagin system, and we show that groupoid invariant Lagrangians lead to reduced optimality conditions of Euler Poincare type. Several mechanical examples, including systems with configuration dependent inertia and local symmetries, are presented to illustrate the theory.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20290v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Egor Bakaev",
      "Amir Yehudayoff"
    ],
    "title": "A note on the affine plank conjecture",
    "abstract": "In 1951, Bang posed the affine plank conjecture, which remains open: If a convex body in $\\mathbb{R}^d$ is covered by planks, then the total relative width of the planks is at least one. We prove a lower bound of $2/(1+\\sqrt{d})$ for this total relative width. The best previously known lower bound was $2/(1+d)$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20282v1",
    "categories": [
      "math.NA",
      "cs.DM"
    ],
    "authors": [
      "Egor P. Berezin",
      "Robert T. Zaks",
      "German Z. Alekhin",
      "Stanislav V. Morozov",
      "Sergey A. Matveev"
    ],
    "title": "Two approaches to low-parametric SimRank computation",
    "abstract": "In this work, we discuss low-parametric approaches for approximating SimRank matrices, which estimate the similarity between pairs of nodes in a graph. Although SimRank matrices and their computation require a significant amount of memory, common approaches mostly address the problem of algorithmic complexity. We propose two major formats for the economical embedding of target data. The first approach adopts a non-symmetric form that can be computed using a specialized alternating optimization algorithm. The second is based on a symmetric representation and Newton-type iterations. We propose numerical implementations for both methodologies that avoid working with dense matrices and maintain low memory consumption. Furthermore, we study both types of embeddings numerically using real data from publicly available datasets. The results show that our algorithms yield a good approximation of the SimRank matrices, both in terms of the error norm (particularly the Chebyshev norm) and in preserving the average number of the most similar elements for each given node.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20278v1",
    "categories": [
      "cs.IT",
      "cs.CC"
    ],
    "authors": [
      "Alexander R. Block",
      "Jeremiah Blocki",
      "Kuan Cheng",
      "Elena Grigorescu",
      "Xin Li",
      "Yu Zheng",
      "Minshen Zhu"
    ],
    "title": "Exponential Lower Bounds for 2-query Relaxed Locally Decodable Codes",
    "abstract": "Locally Decodable Codes (LDCs) are error-correcting codes $C\\colonΣ^n\\rightarrow Σ^m,$ encoding \\emph{messages} in $Σ^n$ to \\emph{codewords} in $Σ^m$, with super-fast decoding algorithms. They are important mathematical objects in many areas of theoretical computer science, yet the best constructions so far have codeword length $m$ that is super-polynomial in $n$, for codes with constant query complexity and constant alphabet size.\n  In a very surprising result, Ben-Sasson, Goldreich, Harsha, Sudan, and Vadhan (SICOMP 2006) show how to construct a relaxed version of LDCs (RLDCs) with constant query complexity and almost linear codeword length over the binary alphabet, and used them to obtain significantly-improved constructions of Probabilistically Checkable Proofs.\n  In this work, we study RLDCs in the standard Hamming-error setting. We prove an exponential lower bound on the length of Hamming RLDCs making $2$ queries (even adaptively) over the binary alphabet. This answers a question explicitly raised by Gur and Lachish (SICOMP 2021) and is the first exponential lower bound for RLDCs. Combined with the results of Ben-Sasson et al., our result exhibits a ``phase-transition''-type behavior on the codeword length for some constant-query complexity. We achieve these lower bounds via a transformation of RLDCs to standard Hamming LDCs, using a careful analysis of restrictions of message bits that fix codeword bits.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20266v1",
    "categories": [
      "math.PR",
      "math.ST",
      "q-bio.PE"
    ],
    "authors": [
      "Cristina Costantini",
      "Matteo Ruggiero"
    ],
    "title": "Multiple Poisson-Dirichlet diffusions on generalized Kingman simplices",
    "abstract": "We construct a new class of infinite-dimensional diffusions taking values in a generalized Kingman simplex. Our model describes the temporal evolution of the relative frequencies of infinitely-many types which are \"labeled\" by an arbitrary finite number of marks or colors, but \"unlabeled\" within each mark. We start with a finite-dimensional construction which extends to Wright-Fisher diffusions a self-similarity property known for Dirichlet distributions, and corresponds to a multiple skew-product representation of the Wright-Fisher diffusion relative to the marks in the population. After ranking decreasingly the frequencies within each mark, we identify the limit in distribution of the resulting diffusion when the number of types for each mark goes to infinity, and describe its infinitesimal operator. The limiting process reduces to a diffusion in the Thoma simplex in the special case of only two marks, whereas the infinitely-many-neutral-alleles model is recovered when all frequencies have the same mark. The stationary measure of the limit diffusion is shown to be the recently introduced multiple Poisson-Dirichlet distribution, which extends Kingman's Poisson-Dirichlet distribution and is the de Finetti representing measure for a family of random partitions whose elements are marked.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20188v1",
    "categories": [
      "math.NT",
      "hep-th",
      "math.AG"
    ],
    "authors": [
      "Neil Dummigan"
    ],
    "title": "Modularity of a certain \"rank-2 attractor\" Calabi-Yau threefold",
    "abstract": "We prove that the 4-dimensional Galois representations associated with a certain Calabi-Yau threefold are reducible, with 2-dimensional composition factors coming from specific modular forms of weights 2 and 4, both level 14. This was essentially conjectured by Meyer and Verrill. It was revisited in its present form by Candelas, de la Ossa, Elmi and van Straten, whose computations of Euler factors in a whole pencil of Calabi-Yau threefolds highlighted this fibre as one of three overwhelmingly likely to be ``rank-2 attractors''.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20545v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Ravindra Singh"
    ],
    "title": "Optimal inequalities involving Casorati curvatures along Riemannian maps and Riemannian submersions for quaternionic space form",
    "abstract": "In this paper, we establish Casorati inequalities for Riemannian maps and Riemannian submersions involving quaternionic space forms, and we provide geometric characterisations of their equality cases. First, we derive Casorati inequalities for Riemannian maps to quaternionic space forms and describe the corresponding equality cases, showing that the leaves of the range space are invariantly quasi-umbilical, and that the associated shape operator matrix commutes. Next, we obtain Casorati inequalities involving the fundamental tensor fields $T$ and $A$ for Riemannian submersions from quaternionic space forms onto Riemannian manifolds, together with their geometric interpretations. In particular, we prove that the equality case corresponding to the tensor field $A$ along the horizontal distribution is equivalent to the integrability of the horizontal distribution. Moreover, the equality case associated with the tensor field $T$ along the vertical distribution characterises fibres that are invariantly quasi-umbilical with a commuting shape operator matrix. Finally, the simultaneous equality cases involving both tensor fields $T$ and $A$ along the horizontal and vertical distributions imply the integrability of the horizontal distribution together with the invariantly quasi-umbilical nature of the fibres and the commutativity of the corresponding shape operators.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20536v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Hugo Mathevet",
      "Sophie Morier-Genoud",
      "Valentin Ovsienko"
    ],
    "title": "Quantizing Pythagorean triples",
    "abstract": "We introduce a $q$-deformation of the Pythagoras equation $a^2 + b^2 = c^2$, which is a polynomial version of it different from the standard one. We construct a polynomial analogue, or ``$q$-analogue'', of every primitive Pythagorean triple. We also construct such analogue for a larger class of Pythagorean triples called standard. Our approach is based on the notion of $q$-deformed rational numbers and the modular group $\\mathrm{PSL}(2,\\mathbb{Z})$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20533v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Koichi Nagano"
    ],
    "title": "Asymptotic geometric regularity of CAT(0) spaces",
    "abstract": "We prove that if an n-dimensional geodesically complete CAT(0) space has Tits boundary sufficiently close to the (n-1)-dimensional standard unit sphere, then it is bi-Lipschiz homeomorphic to the n-dimensional Euclidean space. As an application, we conclude that if an (n-1)-dimensional geodesically complete CAT(1) space is sufficiently close to the (n-1)-dimensional standard unit sphere, then they are bi-Lipschiz homeomorphic to each other.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20482v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Marcel Dang"
    ],
    "title": "A super Version of a Theorem of Fricke and Klein",
    "abstract": "We start studying the character variety of the algebraic supergroup OSp(1|2) from the algebraic perspective. We do this by first investigating the specific case of the character variety of the free group on two letters and try to describe the ring of invariants with respect to the conjugation action. The explicit description of the corresponding character variety for SL(2) was done by Fricke and Klein, so this can be seen as a variant of this theorem for its supergeometric counterpart OSp(1|2).",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20473v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ruijing Wang"
    ],
    "title": "Global Existence for Reaction-diffusion Equations with State-Dependent Delay and Fast-growing Nonlinearities",
    "abstract": "This work aims to study the initial-boundary value problem of the reaction-diffusion equation with state-dependent delay $\\pa_{t}u-Δu=f(u)+g(u,u(t-τ(t,u_t)))+h(t,x)$ in a bounded domain. We establish the global existence of the problem under suitable dissipative-type structural conditions, allowing both nonlinear terms $f$ and $g$ to have arbitrary polynomial growth rates. Another highlight in this work is that, we significantly relax the continuity assumptions imposed on the delay functions.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20413v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Kevin Slote",
      "Jeremie Fish",
      "Erik Bollt"
    ],
    "title": "KANDy: Kolmogorov-Arnold Networks and Dynamical System Discovery",
    "abstract": "We introduce the Kolmogorov-Arnold Network for Dynamics (KANDy) as a zero-depth, wide neural architecture capable of discovering governing equations in chaotic and complex dynamical systems. Building on the foundation of Kolmogorov-Arnold Networks (KANs), KANDy explicitly learns governing equations by replacing sparse regression with a KAN. The synthesis of KANs and sparse regression addresses the limitations of equation discovery for KANs applied to dynamical systems and overcomes cases where sparse regression is hindered by sparsity constraints. Additionally, we show that our model, applied to the Hopf Fibration, recovers topological structure, thereby improving coherence with attractor properties. We apply our model to discrete and continuous dynamical systems, as well as to chaotic partial differential equations (PDEs). These results position KANDy as an interpretable and effective alternative for data-driven modeling of nonlinear dynamical systems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20388v1",
    "categories": [
      "math.SG",
      "math.DG"
    ],
    "authors": [
      "Robert Cardona",
      "Fabio Gironella"
    ],
    "title": "$C^0$-Poisson geometry, coisotropic submanifolds, and clean intersection points",
    "abstract": "In this work, we initiate the study of rigidity and non-rigidity phenomena for Poisson homeomorphisms, defined as uniform $C^0$-limits of Poisson diffeomorphisms. First, we prove that Poisson homeomorphisms preserve the singular symplectic foliation: they map symplectic leaves to symplectic leaves by symplectic homeomorphisms. Second, we establish the $C^0$-rigidity of coisotropic submanifolds in Poisson manifolds. A key ingredient is the notion of ''clean intersection point'' between a submanifold and the leaves of a singular foliation, whose study is of independent interest for singular foliation theory and Poisson geometry. In contrast with the symplectic case, characteristic foliations of coisotropic submanifolds are not rigid under Poisson homeomorphisms, exhibiting flexibility phenomena specific to the Poisson setting. We discuss partial rigidity results, introduce a topological invariant of coisotropic submanifolds, the $C^0$-characteristic partition, and show that $C^0$-coisotropic submanifolds are non-smooth objects whose vanishing ideal defines a Lie subalgebra of the Poisson algebra. Finally, we consider Poisson homeomorphisms that lift to symplectic homeomorphisms of a symplectic realization and show that nearly all Poisson manifolds admit non-liftable Poisson homeomorphisms. Our main results answer three questions posed by Joksimović and Mărcuţ.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20387v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Herbert Batte"
    ],
    "title": "On Wagstaff primes in the $k$-Lucas number sequence",
    "abstract": "A Wagstaff prime is a prime number of the form $(2^{\\mathfrak{p}}+1)/3$, where $\\mathfrak{p}$ is an odd prime. Let $(L_n^{(k)})_{n\\geq 2-k}$ be the $k$-Lucas number sequence defined by the recurrence relation\n  $ L_n^{(k)} = L_{n-1}^{(k)} + \\cdots + L_{n-k}^{(k)}$, for all $n \\ge 2$, with initial terms \\( L_0^{(k)} = 2 \\) and \\( L_1^{(k)} = 1 \\) for all \\( k \\ge 2 \\), and \\( L_{2-k}^{(k)} = \\cdots = L_{-1}^{(k)} = 0 \\) for \\( k \\ge 3 \\). In this paper, we show that the only solutions to the Diophantine equation $L_n^{(k)} = (2^{\\mathfrak{p}}+1)/3$ are $(n,k,\\mathfrak{p})\\in\\{(5,2,5),(6,4,7)\\}\\cup \\{(2,k,3):k\\ge 2\\}$. We use linear forms in logarithms and the LLL reduction method to prove our result.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20371v1",
    "categories": [
      "math.ST",
      "stat.ME"
    ],
    "authors": [
      "Magid Sabbagh",
      "David A. Stephens"
    ],
    "title": "Semi-parametric Bayesian inference under Neyman orthogonality",
    "abstract": "The validity of two-step or plug-in inference methods is questioned in the Bayesian framework. We study semi-parametric models where the plug-in of a non-parametrically modelled nuisance component is used. We show that when the nuisance and targeted parameters satisfy a Neyman orthogonal score property, the approach of cutting feedback through a two-step procedure is a valid way of conducting Bayesian inference. Our method relies on a non-parametric Bayesian formulation based on the Dirichlet process and the Bayesian bootstrap. We show that the marginal posterior of the targeted parameter exhibits good frequentist properties despite not accounting for the inferential uncertainty of the nuisance parameter. We adopt this approach in Bayesian causal inference problems where the nuisance propensity score model is estimated to obtain marginal inference for the treatment effect parameter, and demonstrate that a plug-in of the propensity score has a negligible effect on marginal posterior inference for the causal contrast. We investigate the absence of Neyman orthogonality and exploit our findings to show that in conventional two-step procedures, the posterior distribution converges under weaker restrictions than those needed in the frequentist sequel. For a simple family of useful scores, we demonstrate that even in the absence of Neyman orthogonality, the posterior distribution is asymptotically unchanged by the estimation of the nuisance parameter, merely provided the latter estimator is consistent.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20325v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Károly J. Böröczky",
      "Konstantinos Patsalos",
      "Christos Saroglou"
    ],
    "title": "On Ball's conjectured Santaló type inequality",
    "abstract": "We prove that if $K$ is a symmetric and isotropic convex body in $\\mathbb{R}^n$, then $$\\int_K\\langle x,u\\rangle^2\\,dx\\int_{K^\\circ}\\langle x,u\\rangle^2\\,dx\\leq \\left(\\int_{B_2^n}\\langle x,u\\rangle^2\\,dx\\right)^2,\\qquad\\forall u\\in\\mathbb{R}^n,$$with equality for some $u\\neq o$, if and only if $K$ is a Euclidean ball. This confirms a conjecture by Keith Ball (1986), stating that for any symmetric convex body $K$ in $\\mathbb{R}^n$, it holds $$\\int_K\\int_{K^\\circ}\\langle x,y\\rangle^2\\,dx\\,dy\\leq \\int_{B_2^n}\\int_{B_2^n}\\langle x,y\\rangle^2\\,dx\\,dy,$$with equality if and only if $K$ is an ellipsoid.\n  Fortunately, our method for proving Ball's conjectured inequality admits a quantitative stability refinement, which in turn yields an asymptotically optimal stability version of the Blaschke-Santaló inequality for origin symmetric convex bodies in terms of the symmetric difference metric. This resolves another well known open problem.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20287v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Alfredo Roque Freire",
      "Manuel António Martins"
    ],
    "title": "Regular non-normal modal classicalities",
    "abstract": "We present a novel investigation into the consistency operator ($\\circ$), traditionally associated with paraconsistent logics, as a means of capturing non-normal modal classicalities within the Kripke framework. By semantically reinterpreting $\\circ$ as an operator that distinguishes top and bottom values from other values in the algebra, we extend its applicability beyond paraconsistency into classical and modal logics. We introduce the logic $\\mathcal{B}_4^\\circ$, a four-valued Boolean logic augmented with the consistency operator, and provide a sound and complete axiomatization. Building on this foundation, we extend the semantics to the modal domain using the many-logics modal logic (MLML) framework. Specifically, we construct Kripke frames based on an eight-valued Boolean algebra that contains three distinct four-valued subalgebras, each representing a different world type. Our analysis reveals that the resulting modal logic exhibits a normal local consequence relation alongside a non-normal global consequence relation. Consequently, the characterization of frame properties --such as transitivity, reflexivity, and Euclideanness --deviates from modal logic $K$, requiring novel semantic tools. We further identify new modal formulas in an extended language that capture previously unavailable kinds of accessibility, leading to frame characterizations unattainable in traditional modal frameworks.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20189v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Krasimir Yordzhev",
      "Hristina Kostadinova"
    ],
    "title": "Mathematical Modeling in the Textile Industry",
    "abstract": "A mathematical model, describing some different weaving structures, is made in this article. The terms self-mirror and rotation-stable weaving structure are initiated here. There are used the properties and operations in the set of the binary matrices and an equivalence relation in this set. Some combinatorial problems about finding the cardinal number and the elements of the factor set according to this relation is discussed. We propose an algorithm, which solves these problems. The presentation of an arbitrary binary matrix using sequence of nonnegative integers is discussed. It is shown that the presentation of binary matrices using ordered n-tuples of natural numbers makes the algorithms faster and saves a lot of memory. Implementing these ideas a computer program, which receives all of the examined objects, is created. In the paper we use object-oriented programming using the syntax and the semantic of C++ programming language. Some advantages in the use of bitwise operations are shown. The results we have received are used to describe the topology of the different weaving structures.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20588v1",
    "categories": [
      "math.DS",
      "math.CV"
    ],
    "authors": [
      "Xiaoguang Wang"
    ],
    "title": "Continuity of Julia sets and invariant rays",
    "abstract": "For certain typical perturbations $(f_n)_n$ of a rational map $f$ with parabolic cycles, we investigate the relations between the Hausdorff convergence of Julia sets and invariant rays, and the horocyclic convergence of multipliers of periodic points. We establish several equivalent characterizations by means of parabolic implosion theory. This builds upon an analysis of the edge dynamics on the tree for the gate structure induced by the perturbation. The edge dynamics which are driven by Oudkerk's algorithm, are used to trace the orbits for the near parabolic perturbations.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20554v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Lipeng Duan",
      "Suting Wei",
      "Jun Yang"
    ],
    "title": "Solutions with one dimensional concentration for a two dimensional Gross-Pitaevskii model with general potential",
    "abstract": "We concern standing wave solutions with frequency $λ$ to a two dimensional Gross-Pitaevskii equation with a trap potential under the unit mass constraint, which is used to describe Bose-Einstein condensates with attractive interaction. First, we investigate the necessary conditions for existence of the solutions with concentration phenomena directed along closed smooth curves. Next, not only imposing stationary and non-degeneracy conditions on the curves with respect to an auxiliary weighted length involving the trap potential, but also adding some other technical assumptions, we select a sequence $\\{λ_j\\}$ of the frequency $λ$ with $-λ_j\\rightarrow +\\infty$ and construct solutions with concentration directed along the curves. Our result partially answers the conjecture raised in [A. Ambrosetti, A. Malchiodi, W.-M. Ni, Comm. Math. Phys. 2003] about necessary condition for solution concentrating at submanifolds. The solutions constructed in this paper are concentrating on curves whose length are non-uniformly bounded, and hence the situation is quite different from that in [M. del Pino, M. Kowalczyk, J. Wei, Comm. Pure Appl. Math. 2007].",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20451v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Evan Huang"
    ],
    "title": "Equivalent genus-2 factorizations of type (4, 3)",
    "abstract": "The genus-2 fibrations of type (4, 3) found by Baykur-Korkmaz, Hamada, and Xiao are supported on the same total space. In this short note, we show that the Lefschetz fibration structures are the same.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20414v1",
    "categories": [
      "math.DG",
      "math.SG"
    ],
    "authors": [
      "Andrés I. Rodríguez"
    ],
    "title": "Morita equivalence of Nijenhuis structures",
    "abstract": "We introduce Morita equivalence for Nijenhuis groupoids and for their infinitesimal counterparts, establishing a global-to-infinitesimal correspondence under the Lie functor. A special case is that of holomorphic Lie groupoids and algebroids. We use our framework to enhance the known Morita equivalences for quasi-symplectic groupoids and Dirac structures with compatible Nijenhuis structures.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20380v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Rodrigo Nicolau Almeida",
      "Nick Bezhanishvili",
      "Simon Lemal"
    ],
    "title": "Superamalgamation for modal lattices via non-distributive dualities",
    "abstract": "We show that the variety of modal lattices has the superamalgamation property. As a consequence, we obtain that the weak positive modal logic has the Craig interpolation property. Our proof employs the recent duality for modal lattices based on modal L-spaces. Moreover, we extend this result to a number of other weak positive modal logics axiomatized by modal axioms corresponding to universal Horn sentences.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20367v1",
    "categories": [
      "math.AT",
      "math.AG"
    ],
    "authors": [
      "Lorenzo Mantovani",
      "Ákos K. Matszangosz",
      "Matthias Wendt"
    ],
    "title": "Equivariant real cycle class map and Witt-sheaf cohomology of classifying spaces",
    "abstract": "In this paper, we study equivariant real cycle class maps for group actions on real schemes, with a view toward Witt-sheaf characteristic classes. The cycle class maps take values in singular cohomology of the real points of the quotient stack, which are identified with the homotopy fixed-points of complex conjugation on the complex points. This provides a strong relation between Witt-sheaf cohomology of the geometric classifying space of a real algebraic group and the singular cohomology of the classifying spaces of its strong real forms, which we discuss in a number of examples. As a sample application, we compute the number of Witt-sheaf cohomological invariants of spin groups over the reals.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20742v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Pat Lank"
    ],
    "title": "Dualizing complexes for algebraic stacks",
    "abstract": "We study dualizing complexes on algebraic stacks. In particular, we establish their existence in broad generality for Deligne--Mumford stacks of characteristic zero.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20707v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Yong Luo",
      "Linlin Sun",
      "Guofang Wang"
    ],
    "title": "A flow approach to the Toda system",
    "abstract": "In this paper we introduce a flow to study the Toda system, which we call {\\it Toda flow.} More generally, we introduce a flow of the Liouville systems, formulated as a coupled parabolic system with nonlocal interactions. Finite-time singularities are characterized and both necessary and sufficient conditions for convergence are provided in this general setting, even when the prescribed functions are allowed to change sign.\n  As an application, we prove a global existence for the Toda flow in the critical case without restricting the sign of the prescribed functions. We provide a detailed description of blow-up behavior at infinity and obtain a sharp lower bound for the functional in cases where global convergence fails. By constructing appropriate test functions, we further establish a sufficient condition for the global convergence of the flow. These results are not affected by the sign-changing nature of the prescribed functions, and extend the theorem of Jost, Lin and Wang (Comm. Pure Appl. Math. 59, 526-558, 2006) to systems of multiple equations under this more general and physically relevant condition.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20695v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Andreia Chapouto",
      "Benjamin Harrop-Griffiths",
      "Guopeng Li",
      "Tadahiro Oh"
    ],
    "title": "On the singular nature of shallow-water convergence of the intermediate long wave equation on the real line",
    "abstract": "We investigate regularity properties of the solution map for the intermediate long wave equation (ILW) on the real line. More precisely, we study the scaled ILW which was shown to converge to the Korteweg-de Vries equation (KdV) in $L^2(\\mathbb R)$ in the shallow-water limit in a recent work by the first, third, and fourth authors with T. Zhao (2025). By decomposing the dynamics into the low frequency part and the residual part, we show that, when the depth parameter is sufficiently small, the solution map for the low frequency part is analytic in $L^2(\\mathbb R)$, while the solution map for the residual part fails to be $C^2$. Moreover, we establish shallow-water convergence in $L^2(\\mathbb R)$ of the low frequency dynamics to KdV. This explains the mechanism of the regularity gain of the solution map in the shallow-water limit.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20667v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Hirotaka Kikyo",
      "Koitaro Nakaura",
      "Akito Tsuboi"
    ],
    "title": "On chromatic number of countable graphs",
    "abstract": "This paper investigates when countable graphs have a finite or an infinite chromatic number through model theoretic methods. For Fraïssé limits, we show that instability forces the chromatic number to be infinite, yielding a complete classification of homogeneous graphs with a finite chromatic number. In contrast, Hrushovski construction always produces graphs of finite chromatic number, though the value can be made arbitrarily large. In tame settings -- such as stable graphs of $U$-rank one and graphs definable in o-minimal structures -- an infinite chromatic number necessarily yields arbitrarily large cliques. These results provide a unified framework connecting structural model theoretic properties with chromatic behavior.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20640v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "Razak Christophe Sabi Gninkou",
      "Andrés F. López-Lopera",
      "Franck Massa",
      "Rodolphe Le Riche"
    ],
    "title": "Scalable multitask Gaussian processes for complex mechanical systems with functional covariates",
    "abstract": "Functional covariates arise in many scientific and engineering applications when model inputs take the form of time-dependent or spatially distributed profiles, such as varying boundary conditions or changing material behaviours. In addition, new practices in digital simulation require predictions accompanied by confidence intervals. Models based on Gaussian processes (GPs) provide principled uncertainty quantification. However, GPs capable of jointly handling functional covariates and multiple correlated functional tasks remain largely under-explored. In this work, we extend the framework of GPs with functional covariates to multitask problems by introducing a fully separable kernel structure that captures dependencies across tasks and functional inputs. By taking advantage of the Kronecker structure of the covariance matrix, the model is made scalable. The proposed model is validated on a synthetic benchmark and applied to a realistic structure, a riveted assembly with functional descriptions of the material behaviour and response forces. The proposed functional multitask GP significantly improves over single task GPs. For the riveted assembly, it requires less than 100 samples to produce an accurate mean and confidence interval prediction. Despite its larger number of parameters, the multitask GP is computationally easier to learn than its single task pendant.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20625v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Mahdi Koutchoukali"
    ],
    "title": "Generating functions for compositions with constrained even parts",
    "abstract": "We study compositions of a positive integer n in which the occurrence of even parts larger than a fixed threshold k is controlled. More precisely, for each composition m = (m 1 , . . . , m r ) we consider the number of even parts strictly larger than k, and we introduce a two-variable generating function that encodes this statistic.  We show that this generating function is rational and obtain explicit closed forms, depending on the parity of k. As a consequence, we derive exact counting formulas and linear recurrence relations for the number of compositions of n with a prescribed number of even parts greater than k. We also obtain explicit formulas for related refined quantities, such as the number of compositions with an even or odd number of such parts, the total number of their occurrences among all compositions of n, and positional statistics describing how late the first such part appears in a composition.  This combinatorial problem is motivated by questions arising from combinatorial expansions related to zeta functions of algebraic curves over finite fields, although the results of this paper are entirely combinatorial.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20797v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Nayanthara",
      "Noufal Asharaf"
    ],
    "title": "Non-negative persymmetric realizability of certain classes of spectra",
    "abstract": "Identifying the collection of scalars that represent a non-negative matrix's eigenvalues is known as the non-negative inverse eigenvalue problem (NIEP). Conditions for the existence of a non-negative matrix with a certain spectrum are examined in this work. The classical NIEP restricted to non-negative matrices having a persymmetric structure is the persymmetric non-negative inverse eigenvalue problem (PNIEP). We resolve the open problem stated in \\cite{Ana}, and furthermore, equivalence of the PNIEP and NIEP is established for trace-zero spectra of five complex numbers. Also we obtain new sufficient conditions for the realizability of certain classes of spectra with non-negative persymmetric matrix realization. Based on generic structural features of persymmetric matrices and their characteristic polynomials, our method is constructive in nature. The effects of perturbations on imaginary part of complex eigenvalues are also analyzed and some perturbation results are derived.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20793v1",
    "categories": [
      "math.OC",
      "cs.DS"
    ],
    "authors": [
      "Isaac Rudich",
      "Louis-Martin Rousseau"
    ],
    "title": "Implicit Decision Diagrams",
    "abstract": "Decision Diagrams (DDs) have emerged as a powerful tool for discrete optimization, with rapidly growing adoption. DDs are directed acyclic layered graphs; restricted DDs are a generalized greedy heuristic for finding feasible solutions, and relaxed DDs compute combinatorial relaxed bounds. There is substantial theory that leverages DD-based bounding, yet the complexity of constructing the DDs themselves has received little attention. Standard restricted DD construction requires $O(w \\log(w))$ per layer; standard relaxed DD construction requires $O(w^2)$, where $w$ is the width of the DD. Increasing $w$ improves bound quality at the cost of more time and memory.\n  We introduce implicit Decision Diagrams, storing arcs implicitly rather than explicitly, and reducing per-layer complexity to $O(w)$ for restricted and relaxed DDs. We prove this is optimal: any framework treating state-update and merge operations as black boxes cannot do better.\n  Optimal complexity shifts the challenge from algorithmic overhead to low-level engineering. We show how implicit DDs can drive a MIP solver, and release ImplicitDDs.jl, an open-source Julia solver exploiting the implementation refinements our theory enables. Experiments demonstrate the solver outperforms Gurobi on Subset Sum.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21083v1",
    "categories": [
      "math.CT",
      "math.AT"
    ],
    "authors": [
      "El Mehdi Cherradi"
    ],
    "title": "Semi-cubical tribes",
    "abstract": "We introduce a general notion of $J$-tribe, and construct the $J$-tribe of $J$-frames in a given tribe $\\mathcal{T}$, where $J$ a suitable generalized direct category. This construction applies to semi-cubical diagrams for a category of semi-cubes with symmetries and reversals.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21075v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Maria Andrade"
    ],
    "title": "Integral Inequalities and Rigidity for $V$-Static-Type Equations on Manifolds with Boundary",
    "abstract": "In this work, we study compact Riemannian manifolds with boundary satisfying V-static-type equations. By combining a generalized Reilly formula with Steklov-type boundary value problems, we derive integral inequalities for geometric quantities associated with the boundary. These inequalities lead to rigidity results, including characterizations of geodesic balls in space forms. In particular, our results offer new insights into several known rigidity theorems in the literature.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21063v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yiqin He"
    ],
    "title": "Toward the $p$-adic Hodge parameters in the potentially crystalline representations of $\\mathrm{GL}_n$",
    "abstract": "Let $p$ be a prime number, $n$ an integer $\\geq 2$, and $L$ a finite extension of $\\mathrm{Q}_p$. Let $ρ_L$ be an $n$-dimensional (non-critical but not necessary generic) potentially crystalline $p$-adic Galois representation of the absolute Galois groups of $L$ of regular Hodge-Tate weights. By generalizing the previous results and strategy for the crystabelline case of Ding and the recent work of Breuil-Ding, we construct an explicit locally analytic representation $π_{1}(ρ_L)$, and describe explicitly the information of Hodge filtration of $ρ_L$ it determines. When $ρ_L$ comes from a patched $p$-adic automorphic representation, we show that $π_{1}(ρ_L)$ is a subrepresentation of the $\\mathrm{GL}_n(L)$-representation globally associated to $ρ_L$, under some mild hypothesis.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21051v1",
    "categories": [
      "math.CV",
      "math.AG"
    ],
    "authors": [
      "Greg Knese",
      "James Eldred Pascoe",
      "Alan Sola"
    ],
    "title": "Stable polynomials and bounded rational functions in the unit ball",
    "abstract": "We study polynomials with no zeros on the unit ball in complex Euclidean space with a view toward characterizing when a rational function is bounded on the ball. We give a complete local description of such polynomials in two variables near a boundary zero. In higher dimensions, we give a partial characterization of a simple boundary zero. Several applications are given including boundedness of rational functions with boundary singularities and constructions of examples with prescribed local properties.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21024v1",
    "categories": [
      "math.AG",
      "math.CV"
    ],
    "authors": [
      "Olivier Benoist",
      "James Hotchkiss"
    ],
    "title": "The Brauer group of a Stein algebra",
    "abstract": "We investigate the Brauer group of the ring $\\mathcal{O}(S)$ of holomorphic functions on a finite-dimensional Stein space S. We provide a purely topological computation of this group and deduce a comparison theorem between the étale cohomology of $\\textrm{Spec}(\\mathcal{O}(S))$ and the singular cohomology of S in degree 2. Furthermore, we prove a purity theorem when S is nonsingular and study the index of classes in the Brauer group of $\\mathcal{O}(S)$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21023v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Francisco Arrepol",
      "Mauricio Soto-Gomez",
      "Christopher Thraves Caro"
    ],
    "title": "Robinson spaces and their representation in low-dimensional metric spaces",
    "abstract": "Robinson spaces are structures equipped with a total order that encodes comparative dissimilarity relationships.\n  We study the problem of representing Robinson dissimilarity spaces into low-dimensional metric spaces. These representations aim to preserve the relative dissimilarity relationships between elements rather than their exact values. While low dimensional Euclidean spaces such as $\\mathbb{R}^1$ and $\\mathbb{R}^2$ are natural candidates for such embeddings, previous work has shown that not all Robinson spaces admit a valid embedding in the real line that respects their structural constraints. Motivated by this limitation, we explore the broader class of real trees, which retain low-dimensional interpretability while allowing greater flexibility.\n  To address the embedding problem, we develop two key tools: a combinatorial representation of Robinson spaces and a topological characterization of caterpillars, a restricted class of real trees. These tools enable a formulation of the embedding problem as a linear program, providing both computational and theoretical insights. We prove that some subclasses of Robinson spaces always admit embeddings in a caterpillar, and we establish the existence of Robinson spaces that cannot be embedded in any real tree. These results clarify the geometric limitations of representing ordered dissimilarity structures and open new directions for studying the interaction between dissimilarity, order, and metric geometry.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20977v1",
    "categories": [
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "Sara C. Debón"
    ],
    "title": "A generalization of a result of Hegedüs",
    "abstract": "A famous result of P. Hegedüs describes the structure of finite rational $\\{2,5\\}$-groups. In this paper, we show how Hegedüs' proof can be used to obtain a similar result for the more general situation of a finite rational $2$-group acting faithfully and with the eigenvector property on a f.d $\\mathbb{F}_p$-vector space with $p\\geq 5$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20968v1",
    "categories": [
      "math-ph",
      "hep-th"
    ],
    "authors": [
      "Maxim Gritskov",
      "Andrey Losev",
      "Saveliy Timchenko"
    ],
    "title": "Perturbative anomalies in quantum mechanics",
    "abstract": "In this work, we propose a cohomological approach to studying perturbative anomalies in quantum mechanics. The Hamiltonian $\\hat{H}$ together with the symmetry generator $\\hat{S}$ forms a unitary representation of the two-dimensional Abelian Lie algebra $g\\cong \\mathbb{R}^{2}$ on the Hilbert space $V$. We show that perturbations of such a system are related to the first Chevalley-Eilenberg cohomology group $H^{1}_{CE}(\\mathbb{R}^{2},\\mathfrak{u}(V))$. In turn, the perturbative anomalies of the symmetry $\\hat{S}$ are related to the second cohomology group $H^{2}_{CE}(\\mathbb{R}^{2},\\mathfrak{u}(V))$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20948v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Angelo A. Casulli",
      "Daniel Kressner",
      "Nian Shao"
    ],
    "title": "Lanczos with compression for symmetric eigenvalue problems",
    "abstract": "The Lanczos method with implicit restarting is one of the most popular methods for finding a few exterior eigenpairs of a large symmetric matrix $A$. Usually based on polynomial filtering, restarting is crucial to limit memory and the cost of orthogonalization. In this work, we propose a novel strategy for the same purpose, called Lanczos with compression. Unlike polynomial filtering, our approach compresses the Krylov subspace using rational approximation and, in doing so, it sacrifices the structure of the associated Krylov decomposition. Nevertheless, it remains compatible with subsequent Lanczos steps and the overall algorithm is still solely based on matrix-vector products with $A$. On the theoretical side, we show that compression introduces only a small error compared to standard (unrestarted) Lanczos and therefore has only a negligible impact on convergence. Comparable guarantees are not available for commonly used implicit restarting strategies, including the Krylov--Schur method. On the practical side, our numerical experiments demonstrate that compression often outperforms the Krylov--Schur method in terms of matrix-vector products.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20931v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "O. P. Ferreira",
      "D. S. Gonçalves",
      "M. S. Louzeiro",
      "S. Z. Németh",
      "J. Zhu"
    ],
    "title": "A subdifferential characterization via Busemann functions and applications to DC optimization on Hadamard manifolds",
    "abstract": "This paper investigates the properties of Busemann functions on Hadamard manifolds and their use in optimization algorithms in Riemannian settings. We present a new Busemann-based characterization of the subdifferential, which is particularly well suited to Riemannian optimization. In the classical Hadamard manifold framework, a subgradient provides a global lower model of a convex function expressed through the inverse exponential map. However, this model may fail to exhibit a useful convexity or concavity structure. By contrast, our characterization yields a concave bounding function by exploiting key properties of Busemann functions. We use this concavity to design and analyze difference-of-convex (DC) optimization methods on Hadamard manifolds. In particular, we reformulate the classical DC algorithm (DCA) for Riemannian contexts and study its convergence properties. We also report preliminary numerical experiments comparing the proposed Busemann DCA, which leads to geodesically convex subproblems, with the classical Riemannian DCA.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20847v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Franziska Jahnke",
      "Ferréol Lavaud"
    ],
    "title": "Perfectoid fields in the language of rings",
    "abstract": "Building on work of the first author and Kartas, we identify the elementary class generated by all perfectoid fields of fixed residue characteristic $p$ in the language of rings.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21146v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Wenlong Wang",
      "Tianyang Zhang",
      "Tailun Dong",
      "Lei Zhang"
    ],
    "title": "TCDA: Robust 2D-DOA Estimation for Defective L-Shaped Arrays",
    "abstract": "While tensor-based methods excel at Direction-of-Arrival (DOA) estimation, their performance degrades severely with faulty or sparse arrays that violate the required manifold structure. To address this challenge, we propose Tensor Completion for Defective Arrays (TCDA), a robust algorithm that reformulates the physical imperfection problem as a data recovery task within a virtual tensor space. We present a detailed derivation for constructing an incomplete third-order Parallel Factor Analysis (PARAFAC) tensor from the faulty array signals via subarray partitioning, cross-correlation, and dimensional reshaping. Leveraging the tensor's inherent low-rank structure, an Alternating Least Squares (ALS)-based algorithm directly recovers the factor matrices embedding the DOA parameters from the incomplete observations. This approach provides a software-defined 'self-healing' capability, demonstrating exceptional robustness against random element failures without requiring additional processing steps for DOA estimation.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21118v1",
    "categories": [
      "math.AP",
      "math.SP"
    ],
    "authors": [
      "Lorenzo Brasco",
      "Luca Briani",
      "Francesca Prinari"
    ],
    "title": "Low eigenvalues of the $p-$Laplacian in general open sets",
    "abstract": "We consider the minmax Ljusternik-Schnirelmann levels of the constrained $p-$Dirichlet integral, on a general open set of the Euclidean space. We show that, whenever one of these levels lies below the threshold given by the $L^p$ Poincaré constant ``at infinity'', it actually defines an eigenvalue of the Dirichlet $p-$Laplacian. We also prove an exponential decay at infinity for the relevant eigenfunctions: this can be seen as a Šnol-Simon--type estimate for the nonlinear case. Finally, we exhibit some peculiar examples of unbounded open sets to which our main result applies.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21109v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "John A. Baldwin",
      "Jonathan Hanselman",
      "Steven Sivek"
    ],
    "title": "Ribbon concordance and fibered predecessors, II: the general case",
    "abstract": "The first and third authors recently proved that for each knot $K\\subset S^3$ there are only finitely many hyperbolic fibered knots which are ribbon concordant to $K$. In this paper, we remove the hyperbolic constraint, proving that every knot in $S^3$ has only finitely many fibered predecessors under ribbon concordance. The key new input is an inequality relating the knot Floer homology of a generalized satellite knot with that of its companion, proved via the immersed curves formulation of bordered Heegaard Floer homology, which should be of independent interest. Our work, together with results of Kojima--McShane, also leads to an explicit upper bound on the Gromov norm of the complement of any fibered predecessor of a knot $K \\subset S^3$, in terms of the arc index and genus of $K$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21090v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Alexander J Gallo",
      "Massimiliano Zoggia",
      "Alessandro Falsone",
      "Maria Prandini",
      "Simone Garatti"
    ],
    "title": "Robustness certificates in data-driven non-convex optimization with additively-uncertain constraints",
    "abstract": "We consider decision-making problems that are formulated as non-convex optimization programs where uncertainty enters the constraints through an additive term, independent of the decision variables, and robustness is imposed using a finite data-set, according to the scenario robust optimization paradigm. By exploiting the structure of the constraints, we show that both a priori and a posteriori distribution-free probabilistic robustness certificates for a possibly sub-optimal solution to the resulting data-driven optimization problem can be obtained with minimal computational effort. Building on these results, we also discuss a one-shot and an incremental procedure to determine the size of the data-set so as to guarantee a user-chosen robustness level. Notably, both the a posteriori robustness assessment and incremental data-set sizing do not require to solve the non-convex scenario program. A comparative analysis performed on the unit commitment problem using real data reveals a limited increase in conservativeness with a significant computational saving with respect to the application of scenario theory results for general, non necessarily structured, non-convex problems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20820v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Wei Liu",
      "Tingfeng Wang",
      "Xiaofei Zhao"
    ],
    "title": "Convergence analysis of $L^{p+1}$-normalized gradient flow for action ground state of nonlinear Schrödinger equation",
    "abstract": "This paper presents a rigorous convergence analysis of the $L^{p+1}$-normalized gradient flow with asymptotic Lagrange multiplier (GFALM) method for computing the action ground state of the nonlinear Schrödinger equation in the focusing case. First, a general global convergence theory is established for the semi-discrete GFALM scheme, guaranteeing the existence of an accumulation point and a convergent subsequence. Then, under additional non-degeneracy assumptions, a local exponential convergence rate is rigorously proven. This result is further extended to the fully discrete case using a Fourier pseudo-spectral discretization. The analysis is achieved by characterizing the local geometry of the $L^{p+1}$-constrained manifold near the ground state, establishing a quadratic growth property of the energy functional, and deriving a Łojasiewicz-type gradient inequality. Finally, the paper also investigates the exponential convergence of the associated continuous-time gradient flow, providing a theoretical foundation for future numerical discretizations. This work extends existing convergence analyses for energy ground states, addressing the challenges posed by the $L^{p+1}$ constraint, especially the absence of an inner-product structure.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20817v1",
    "categories": [
      "math.RT",
      "math.NT",
      "math.QA"
    ],
    "authors": [
      "Valentin Buciumas",
      "Chun-Ju Lai"
    ],
    "title": "Quantum wreath products and $p$-adic general linear group",
    "abstract": "We study the pro-$p$ Iwahori-Hecke algebra and its Gelfand-Graev modules for the $p$-adic general linear group and its metaplectic covers. We develop the theory of quantum wreath products of skew polynomial type and use it to provide transparent descriptions of these Hecke algebras and their modules that were previously inaccessible through standard $p$-adic methods. We introduce the notion of (anti)spherical and Kashiwara-Miwa-Stern modules for these quantum wreath products for the first time and interpret the $p$-adic Gelfand-Graev modules in terms of these new modules. As an application, we study the structure theory for the corresponding $p$-adic pro-$p$ Schur algebras and obtain an explicit basis and multiplication rules. Moreover, we give algebraic (re)proofs of several results of $p$-adic interest including the existence of PBW basis for the pro-$p$ metaplectic and Iwahori-Hecke algebras, identification of the Iwahori-Schur algebra with the quantum affine Schur algebra, and failure of the local Shimura correspondence at the pro-$p$ level.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20801v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "S. I. Dimitrov"
    ],
    "title": "A Diophantine inequality with five squares of Piatetski-Shapiro primes",
    "abstract": "Let $[\\,\\cdot\\,]$ denote the floor function. Assume that $λ_1, λ_2, λ_3, λ_4, λ_5$ are nonzero real numbers, not all of the same sign, that $λ_1/λ_2$ is irrational, and that $η$ is a real number. Let $\\frac{71}{72}<γ<1$ and $θ>0$. We prove that there exist infinitely many quintuples of primes $p_1,\\, p_2,\\, p_3,\\, p_4,\\, p_5$ satisfying the Diophantine inequality \\begin{equation*} \\big|λ_1p^2_1 + λ_2p^2_2 + λ_3p^2_3+ λ_4p^2_4 + λ_5p^2_5+η\\big|<\\big(\\max p_j\\big)^{\\frac{71-72γ}{29}+θ}\\,, \\end{equation*} where $p_i=[n_i^{1/γ}]$, $i=1,\\,2,\\,3,\\,4,\\,5$. We also prove analogous theorems by raising the last variable in the inequality to the third and fourth powers.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21055v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "Keith Levin"
    ],
    "title": "Adjacency Spectral Embeddings of Correlation Networks",
    "abstract": "In many applications, weighted networks are constructed based on time series data: each time series is associated to a vertex and edge weights are given by pairwise correlations. The result is a network whose edge dependency structure violates the assumptions of most common network models. Nonetheless, it is common to analyze these \"correlation networks\" using embedding methods derived from edge-independent network models, based on a belief that the edges are approximately independent. In this work, we put this modeling choice on firm theoretical ground. We show that when the time series are expressible in terms of a small number of Fourier basis elements (or in some other suitably-chosen basis), correlation networks correspond to latent space networks with dependent edge noise in which the vertex-level latent variables encode the basis coefficients. Further, we show that when time series are observed subject to noise, spectral embedding of the resulting noisy correlation network still recovers these true vertex-level latent representations under suitable assumptions. This characterization of embeddings as learning Fourier coefficients appears to be folklore in the signal processing community in the context of principal component analysis, but is, to the best of our knowledge, new to the statistical network analysis literature.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21005v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Sebastian Bischof"
    ],
    "title": "(Non-)Linearizable RGD systems",
    "abstract": "An RGD system $\\mathcal{D}$ is called \\emph{linear w.r.t. a root basis $\\mathcal{B}$} if the commutation relations between the root groups of $\\mathcal{D}$ are `linear' in a certain sense. Moreover, $\\mathcal{D}$ is called \\emph{linearizable}, if there exists a root basis $\\mathcal{B}$ such that $\\mathcal{D}$ is linear w.r.t. $\\mathcal{B}$. For many examples of RGD systems it is easy to see that they are linear w.r.t. a concrete root basis. To the best of our knowledge, it was unclear whether RGD systems exist which are not linearizable.\n  In this article we show that there exist uncountably many RGD systems which are not linearizable. In particular, we provide the first explicit example of such an RGD system. This expands the quote from Rémy that axiom (RGD$1$)$_{\\mathrm{lin}}$ is not only a strengthening of axiom (RGD$1$), but is in fact stronger than it. We show that non-linearizability appears in examples of universal type, and also in examples of $2$-spherical type. For the examples of universal type we construct an uncountable family of non-linearizable RGD systems, and for the examples of $2$-spherical type we show that the RGD systems of type $(4, 4, 4)$ recently constructed by the author provide uncountably many non-linearizable RGD systems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20992v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Naghme Shahami",
      "Behrooz Mashayekhy"
    ],
    "title": "Comparison of Topologies on Homotopy Groups with Subgroup Topology Viewpoint",
    "abstract": "By introducing various topologies on the homotopy groups of a topological space, some researchers make these well known notions in algebraic topology more useful and powerful. In this paper, first we recall and review some known topologies on homotopy groups. Then by reviewing some famous subgroups of homotopy groups and using the concept of subgroup topology, we intend to compare these topologies in order to present some results on topologized homotopy groups.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20955v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Woula Themistoclakis",
      "Marc Van Barel"
    ],
    "title": "Orthonormal polynomial wavelets associated with de la Vallée Poussin-type interpolation on $[-1,1]$",
    "abstract": "Starting from de la Vallée Poussin type (VP) interpolation, the authors have recently introduced a family of interpolating polynomial scaling and wavelet bases generating the approximation and detail spaces of a non-standard multiresolution analysis. Motivated by the fact that, in many applications, orthonormal rather than interpolating bases are preferable, the present study develops a new family of scaling and wavelet polynomials that provide well-localized and orthonormal bases for the same approximation and detail spaces.\n  We show that the proposed new bases have a behavior very similar to the interpolating bases already introduced, presenting similar features although they are not interpolating but orthonormal. In particular, we study the Fourier projection corresponding to the proposed orthonormal scaling basis, and introduce a discrete version of it by approximating the Fourier--like coefficients. For both continuous and discrete orthogonal projections, we prove the uniform boundedness of the Lebesgue constants and the uniform convergence with an asymptotic rate comparable with the best uniform polynomial approximation.\n  Numerical experiments confirm the theoretical results and compare the new orthonormal VP scaling and wavelet bases with the interpolating case previously treated by the authors.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20922v1",
    "categories": [
      "math.AG",
      "math.AC"
    ],
    "authors": [
      "Daniel Bath",
      "Willem Veys"
    ],
    "title": "The Strong Monodromy Conjecture for a class of homogeneous polynomials in three variables",
    "abstract": "We consider the class of all homogeneous, possibly non-reduced, polynomials $f$ whose associated reduced projective divisor $D_{\\text{red}} \\subset \\mathbb{P}^{n-1}$ has (at worst) quasi-homogeneous isolated singularities. In an arbitrary number of variables $n$ and with $d$ denoting the degree of $f$, we characterize when $-n/d$ is a root of the Bernstein--Sato polynomial of $f$ in terms of elementary data involving logarithmic derivations. When we restrict to three variables, we prove the resulting class of polynomials satisfies the Strong Monodromy Conjecture, in the motivic sense.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20908v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Han Yu",
      "Jiajun He",
      "Xinping Yi",
      "Feng Yin",
      "Hing Cheung So",
      "Giuseppe Caire"
    ],
    "title": "Topology-Aware Integrated Communication, Sensing, and Power Transfer for SAGIN",
    "abstract": "The space-air-ground integrated network (SAGIN) has garnered significant attention in recent years due to its capability to extend communication networks from terrestrial environments to near-ground and space contexts. The application of SAGIN enables to achieve a high-quality, multi-functional, and complex communication requirements, which are essential for sixth-generation communication systems. This paper presents a topology aware (TA) framework to leverage the topological structure in SAGIN to address the multi-functional communication challenge, particularly the integrated sensing, communication, and power transfer (ISCPT) problem. To take advantage of the topological structure, we initially establish the topology according to the criteria of visibility and channel strength. The ISCPT problem can be reformulated into a topological structure as a mixed integer linear program, providing valuable insights from the objectives and constraints. Results demonstrate the superior performance of our solution compared to the benchmarks.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20896v1",
    "categories": [
      "math.ST",
      "stat.ME"
    ],
    "authors": [
      "Paul Axmann",
      "Bruno Ebner",
      "Eduardo García-Portugués"
    ],
    "title": "On Stein's test of uniformity on the hypersphere",
    "abstract": "We propose a new test of uniformity on the hypersphere based on a Stein characterization associated with the Laplace--Beltrami operator. We identify a sufficient class of test functions for this characterization, linked to the moment generating function. Exploiting the operator's eigenfunctions to obtain a harmonic decomposition in terms of Gegenbauer polynomials, we show that the proposed procedure belongs to the class of Sobolev tests. We derive closed-form expressions for the distribution of the test statistic under the null hypothesis and under fixed alternatives. To enhance power against a range of alternatives, we introduce a tuning parameter into the characterization and study its impact on rejection probabilities. We discuss data-driven strategies for selecting this parameter to maximize rejection rates for a given alternative and compare the resulting performance with that of related parametric tests. Additional numerical experiments compare the proposed test with competing Sobolev-class procedures, highlighting settings in which it offers clear advantages.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20872v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Takumi Okamoto"
    ],
    "title": "The Limit Sets of Linear and Nonlinear Infinite IFSs Related to Complex Continued Fractions",
    "abstract": "We introduce two families of infinite iterated function systems (IFSs) $\\mathcal{F}(\\mathbf{d}, T)$ and $\\mathcal{G}(\\mathbf{d}, T)$, parametrized by a sequence of positive real numbers $\\mathbf{d}$ and a natural number $T$, and investigate the measure-theoretic properties of their limit sets. $\\mathcal{G}(\\mathbf{d}, T)$ is an infinite Möbius IFS, which is an extension of the IFS of real continued fractions to the IFS on the closed unit disc in the complex plane. $\\mathcal{F}(\\mathbf{d}, T)$ is an infinite linear IFS that shares the same first approximation as $\\mathcal{G}(\\mathbf{d}, T)$. We show that for many choices of $\\mathbf{d}$ and $T$, the limit sets of both $\\mathcal{F}(\\mathbf{d}, T)$ and $\\mathcal{G}(\\mathbf{d}, T)$ exhibit phenomena unique to infinite IFSs, such as having zero Hausdorff measure at the Hausdorff dimension, having infinite packing measure at the packing dimension, or having different Hausdorff and packing dimensions. We also prove that the Hausdorff dimension of the limit set of $\\mathcal{F}(\\mathbf{d}, T)$ is strictly larger than that of $\\mathcal{G}(\\mathbf{d}, T)$ under certain conditions on the parameters.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20863v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "L. Asselle",
      "S. Cingolani",
      "M. Starostk"
    ],
    "title": "Morse homology for strongly indefinite functionals on Banach spaces",
    "abstract": "In this paper we lay the foundations for the Morse theoretical study of strongly indefinite functionals on Banach manifolds by developing the local theory for a specific model class that captures several key analytical features also arising in the variational formulations of geometric problems such as Dirac-harmonic maps. As a corollary, we obtain existence results of solutions to certain systems of quasilinear elliptic problems involving the $p$-area functional. Abstracting from the concrete setting, we then formulate general conditions ensuring that Morse homology is well-defined for strongly indefinite functionals on a Banach space.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21184v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Rita Fioresi",
      "Angelica Simonetti",
      "Ferdinando Zanchetta"
    ],
    "title": "On Gluing Data, Finite Ringed Spaces and schemes",
    "abstract": "From descent theory to higher geometry, the idea of gluing has been embedded in many elegant and powerful techniques, proving instrumental for the solution of many problems. In this paper, we introduce a framework that allows to link important geometric objects, such as differentiable manifolds or schemes, to certain finite ringed spaces arising from sheaves on 2 dimensional semisimplicial sets, thus opening the door to their applications in fields such as discrete differential geometry.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21176v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Rita Fioresi",
      "Angelica Simonetti",
      "Ferdinando Zanchetta"
    ],
    "title": "Sheaves on Graphs and their Differential Calculi",
    "abstract": "In this paper we explore the link between the theory of sheaves on graphs and noncommutative geometry showing that many concepts and constructions in the latter can be generalized and enhanced using methods coming from the former. They include notions such as Laplacians and connections, important in the theory of discrete noncommutative geometry, that are here explored with sheaf theoretic methods and using the language of (semi)simplicial sets.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21131v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "François Ledrappier"
    ],
    "title": "Invariance Principle and dynamics",
    "abstract": "This is a survey of some invariances that arise in dynamical systems theory in the presence of zero Lyapunov exponents.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21097v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Paolo Cifani",
      "Franco Flandoli",
      "Lorenzo Marino"
    ],
    "title": "Anomalous diffusion properties of stochastic transport by heavy-tailed jump processes",
    "abstract": "In this work, we investigate the large-scale transport properties of a passive scalar advected by a turbulent fluid, modelled as a superposition of divergence-free vector fields, each weighted by an independent symmetric $α$-stable-like process. Motivated by recent works showing that complex small-scale spatial structures often lead to Brownian dispersion, we study if this principle persists when the driving noise exhibits heavy-tailed jump statistics. Our numerical results show a clear dichotomy linked with the tail behaviour of the noise. When considering standard $α$-stable processes, very large jumps survive the interaction with the spatial complexity and yield anomalous, super-diffusive transport. In contrast, when the $α$-stable noise is either truncated or exponentially tempered, suppressing extremely long jumps, the transport undergoes a transition to a classical diffusive regime.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21070v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Samuel Griffiths"
    ],
    "title": "Elementary local representation densities at all primes via lifting recursions",
    "abstract": "Let $p$ be a prime and let $L$ be a quadratic $\\mathbb{Z}_p$-lattice with quadratic form $Q$. For $t\\neq 0$ the local representation density $α_p(t;L)$ is the stable normalised growth of the congruence counts of solutions to $Q(v)\\equiv t\\pmod{p^m}$. We compute these counts and densities explicitly for the hyperbolic plane $H_0$ over $\\mathbb{Z}p$, uniformly in $p$, and at $p=2$ for the basic dyadic blocks (rank-$1$ Type I blocks and the even binary planes $2^aH\\varepsilon$), together with the anisotropic ternary lattice $L_3=\\langle 2\\rangle^{\\oplus 3}$. At the dyadic prime the usual Jacobian/Hensel lifting mechanism breaks down in the bilinear-lattice convention $Q(v)=\\langle v,v\\rangle$. The main new input is an explicit half-lift involution for diagonal sums of squares, which yields a stable lifting recursion with factor $2^{d-1}$ under the primitivity hypothesis $4\\nmid a$. As applications we obtain closed forms for the three-squares congruence counts (hence $α_2(t;L_3)$) and a prime-uniform formula for the densities of the scaled hyperbolic planes $p^eH_0$ in the standard normalisation $q=\\langle\\cdot,\\cdot\\rangle/2$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21062v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Daniela Bertacchi",
      "Fabio Zucca"
    ],
    "title": "Critical parameters of germ-monotone families of branching random walks",
    "abstract": "We introduce a broad class of families of branching random walks on a set $X$. The processes in each family are parametrized by a positive parameter $λ$ and they are monotonically increasing in $λ$ with respect to the germ order, a notion that extends classical stochastic domination. We define a general notion of critical parameter $λ(A)$ associated with a subset $A \\subseteq X$ and investigate how modifications of reproduction laws affect these critical parameters.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21056v1",
    "categories": [
      "math.FA",
      "math.CA"
    ],
    "authors": [
      "Dominique Guillot",
      "Javad Mashreghi",
      "Prateek Kumar Vishwakarma"
    ],
    "title": "Oppenheim--Schur inequalities for causal products",
    "abstract": "We establish a class of Oppenheim--Schur-type inequalities for the convolutional Jury product of positive semidefinite matrices. These results extend to a causal convolutional setting the classical Schur and Oppenheim inequalities associated with the Hadamard product. Our approach highlights structural parallels between entrywise and convolution-based matrix operations, revealing how positivity constraints interact with causality. Building on this perspective, we introduce a broader family of causal matrix products and prove unified inequalities that simultaneously recover the classical Schur and Oppenheim bounds as well as their convolutional Jury counterparts. These results provide a common framework for understanding positivity-preserving matrix products and suggest further connections between classical matrix analysis and causal operator structures.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20996v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Björn Schäfer",
      "Mariusz Tobolski"
    ],
    "title": "Voltage quantum graphs and a Gross-Tucker theorem for quantum graphs",
    "abstract": "A voltage graph is a finite directed graph whose edges are labeled by elements of a finite group $G$. A classical construction of Gross and Tucker associates to every voltage graph with vertex set $V$ a so-called derived graph with vertex set $V \\times G$. We generalize their construction to quantum graphs and finite abelian groups. Remarkably, the construction can produce true quantum graphs starting from a classical voltage graph. In this case the obtained quantum graph is quantum isomorphic to a classical graph. As a main result we also prove a quantum version of the Gross-Tucker theorem which characterizes precisely which graphs can be written as derived graphs of voltage graphs.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20961v1",
    "categories": [
      "math.KT"
    ],
    "authors": [
      "Koen van den Dungen"
    ],
    "title": "A K-theoretic note on the spectral localiser",
    "abstract": "We review the construction of the spectral localiser (due to Loring and Schulz-Baldes) from a K-theoretic perspective. We first give a K-theoretic argument providing a spectral flow expression for the even or odd index pairing in terms of the \"infinite volume\" spectral localiser. Our approach towards this first step is more direct, treats the even and odd cases on an equal footing, and has the advantage that the construction of the spectral localiser becomes immediately apparent from the computation of the index pairing via a Kasparov product. In a second step of \"spectral truncation\", we then describe how this spectral flow expression can be computed in terms of the signature of the \"finite volume\" spectral localiser. Throughout, we do not require invertibility of the operator representing the K-homology class, and the even index pairing then obtains an additional contribution coming from the Fredholm index.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20917v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Runbo Li"
    ],
    "title": "Primes in arithmetic progressions to large moduli and refinements of Harman's sieve",
    "abstract": "We study the average distribution of primes of size $x$ in arithmetic progressions to moduli larger than $x^{\\frac{1}{2}}$. Using arithmetic information from the works of many authors together with different variants of the original Harman's sieve, we construct suitable majorants and minorants for the prime indicator function $\\mathbb{1}_p(n)$ that satisfy Bombieri-Vinogradov type mean value theorems with different types of moduli. Specifically, we obtain some mean value theorems for primes with bilinear forms of moduli up to $x^{\\frac{9}{17}}$ or with trilinear forms of moduli up to $x^{\\frac{17}{32}}$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20890v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Stefan Glock",
      "Olaf Parczyk",
      "Silas Rathke",
      "Tibor Szabó"
    ],
    "title": "The maximum diameter of $d$-dimensional simplicial complexes",
    "abstract": "For every fixed dimension $d$ and sufficiently large $n$, we determine the maximum possible diameter of a strongly connected $d$-dimensional simplicial complex on $n$ vertices. This improves on a sequence of previous results and settles a problem of Santos from 2013. On the way, as a special case, we also characterise the existence of an extra-tight Euler tour in the complete $d$-uniform hypergraph on $n$ vertices.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20888v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Peter Semrl"
    ],
    "title": "Order automorphisms of effect algebras",
    "abstract": "An elegant description of the general form of order automorphisms of effect algebras has been known in the complex case. We present a much simpler proof based on the projective geometry which works also in the real case. As an application we classify order isomorphic pairs of matrix intervals and describe the general form of order isomorphisms for any pair of isomorphic matrix intervals.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20865v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Huy The Nguyen",
      "Artemis A. Vogiatzi"
    ],
    "title": "High Codimension Curve Shortening Flow with Free Boundary",
    "abstract": "We study curve shortening flow in high codimension for arcs with free boundary meeting a fixed smooth barrier orthogonally. We prove dilation-invariant curvature and higher-derivative estimates up to the boundary using a Stahl-type localised maximum principle and an adapted cut-off. Using a reflected Gaussian entropy and blow-up analysis, Type I boundary singularities yield a shrinking semicircle model after reflection. Type II blow-ups give a Grim Reaper translator, which is ruled out under a free-boundary entropy bound $<2$. Hence in the low-entropy regime the flow either converges to the orthogonal chord or has only semicircle boundary singularities.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20864v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Isaac A. García",
      "Jaume Giné",
      "Víctor Mañosa"
    ],
    "title": "Monodromic singularities of Brunella-Miari vector fields with two edges in the Newton diagram",
    "abstract": "This work focuses on the study of monodromic singularities in planar analytic families of vector fields whose Newton diagram consists of exactly two edges. We begin by analyzing the desingularization scheme of a minimal model of polynomial vector fields, denoted by ${X}$, which includes only the monomials corresponding to the vertices of the Newton diagram. We then extend this minimal model to the so-called Brunella-Miari vector fields ${X} \\subset {X}^{[1]}$, incorporating all monomials associated with points lying on the edges of the Newton diagram. As a second extension, we consider vector fields ${X}^{[1]} \\subset {X}^{[2]}$ that include higher-order terms corresponding to points located above the polygonal line in the Newton diagram. The key point of our approach is to preserve the desingularization geometry at each extension step. We provide explicit desingularization procedures, which enable the computation of the linear part of the return map $Π$ in cases where the desingularized singularity is associated with a hyperbolic polycycle. Several nontrivial examples are included to illustrate the method.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20840v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Dhruv Ranganathan"
    ],
    "title": "An invitation to the enumerative geometry of degenerations",
    "abstract": "This expository article is an introduction to logarithmic Gromov--Witten (GW) theory. We discuss how to study the GW theory of a smooth projective variety via simple normal crossings degenerations. We survey several approaches to constructing well-behaved, virtually smooth moduli spaces of stable maps to such degenerations. Each irreducible component of the special fiber of a degeneration determines a pair consisting of a variety and a normal crossings divisor, and these pairs carry their own logarithmic GW theory. We explain how the GW theory of the general fiber can be expressed in terms of the logarithmic GW theory of these pairs. Finally, we discuss applications to tautological classes on the moduli space of curves.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20835v1",
    "categories": [
      "math.AT",
      "math.AG",
      "math.CT"
    ],
    "authors": [
      "Drew Heard",
      "Marius Nielsen"
    ],
    "title": "The formal spectrum of a tensor-triangulated category",
    "abstract": "To any essentially small tensor-triangulated category $\\mathcal{K}$ and Thomason subset $Y \\subseteq \\mathrm{Spc}(\\mathcal{K})$ we associate a ringed space $(\\mathrm{Spf}(\\mathcal{K},Y), \\mathcal{O}_{\\mathrm{Spf}(\\mathcal{K},Y)}),$ called the formal spectrum of $(\\mathcal{K},Y)$. We establish basic properties of this construction and compute it in several examples from algebraic geometry, chromatic homotopy theory, equivariant homotopy theory, and modular representation theory.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20831v1",
    "categories": [
      "math.AG",
      "math.CV"
    ],
    "authors": [
      "Pedro Barbassa"
    ],
    "title": "Distributions with Unstable Tangent Sheaf on $\\mathbb{P}^3$",
    "abstract": "We study codimension one distributions on the projective three-space, focusing on cases where the tangent sheaf of the distribution is nonsplit and unstable. We relate the order of nonstability to the degree of the induced subfoliation by curves, showing that the order of nonstability is bounded. Moreover, we classify the tangent sheaf of the codimension one distributions that admit a subfoliation by curves of degree 1. In other words, assuming the sheaf is nonsplit, we classify the situations in which the tangent sheaf attains the maximal possible order of nonstability.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20825v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Anouar Jeddi"
    ],
    "title": "Asymptotic behavior of some stochastic models in population dynamics: a Hamilton-Jacobi approach",
    "abstract": "In this paper, we investigate the asymptotic behavior of individual-based models describing the evolution of a population structured by a real trait, subject to selection and mutation. We consider two different sets of assumptions: first, the case of critical or subcritical branching population processes in a regime combining a discretization of the trait space, small mutations, large time and large initial population size, where we are able to characterize using a Hamilton-Jacobi approach, the survival set of the population, and the asymptotic of the logarithmic scaling of subpopulation sizes. Second, we generalize by a direct method the convergence to the classical Hamilton-Jacobi equation obtained in the super-critical branching regime considered in \\cite{CMMT} to a more general trait space and under weaker assumptions. Moreover, we establish that the stochastic and the deterministic dynamics are asymptotically equivalent in large population.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20769v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Gianmarco Del Sarto",
      "Matthias Hieber",
      "Filippo Palma",
      "Tarek Zöchling"
    ],
    "title": "Continuous Data Assimilation for Semilinear Parabolic Equations: A General Approach by Evolution Equations",
    "abstract": "This article develops a general framework for continuous deterministic data assimilation for semilinear parabolic equations by means of evolution equations. Introducing a nudged model driven by partial observations, the global well-posedness of the reference and the approximating systems is established under natural assumptions. In addition, it is shown that the approximating solution converges exponentially to the solution of the reference system, provided the observational resolution and the nudging parameter are suitably chosen. The approach allows us to consider many systems, such as the Allen-Cahn, Cahn-Hilliard, Sellers-type energy balance, and bidomain systems, for the first time.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21197v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Vittoriano Ruas"
    ],
    "title": "Variants of Raviart-Thomas mixed elements for curved domains using straight-edged tetrahedra",
    "abstract": "A numerical study of tetrahedral Raviart-Thomas mixed finite element methods is presented in the solution of model second order boundary value problems posed in a curved spatial domain. An emphasis is given to the case where normal fluxes are prescribed on a boundary portion. In this case the question on the best way to enforce known boundary degrees of freedom is raised. It seems intuitive that the normal component of the flux variable should preferably not take up corresponding prescribed values at nodes shifted to the boundary of the approximating polyhedron in the underlying normal direction. This is because an accuracy downgrade is to be expected, as shown in https://doi.org/10.1137/15M1045442 and https://doi.org/10.1051/m2an/2025028. In the former work accuracy improvement is achieved by means of a standard Galerkin formulation with parametric elements. The latter one in turn advocates the use of straight-edged triangles combined with a Petrov-Galerkin formulation, in which the aforementioned shift applies only to the test-flux space, while the shape-flux space consists of fields whose fluxes satisfy the prescribed conditions on the true boundary. The first purpose of this article is to show that the method studied in https://doi.org/10.1051/m2an/2025028 for two-dimensional problems can be extended quite naturally to the three-dimensional case. More particularly we illustrate this by carrying out numerical experimentation with such a version for the two lowest order methods of this family, as compared to the corresponding do-nothing strategy. In the case of the lowest order method this comparative study is enriched by assessing as well the performance of its Hermite analog introduced in https://doi.org/10.1016/j.cam.2012.08.027.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21167v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Hao Feng",
      "Ming Zeng",
      "Ebrahim Bedeer",
      "Xingwang Li",
      "Octavia A. Dobre",
      "Zhiguo Ding"
    ],
    "title": "Wireless-Fed Pinching-Antenna Systems with Horn Antennas",
    "abstract": "Pinching-antenna systems have recently emerged as a promising solution for enhancing coverage in high-frequency wireless communications by guiding signals through dielectric waveguides and radiating them via position-adjustable antennas. However, their practical deployment is fundamentally constrained by waveguide attenuation and line-installation requirements, which limit the achievable coverage range. To address this challenge, this paper investigates a wireless-fed pinching-antenna architecture that employs highly directional horn antennas to enable efficient coverage extension. Specifically, a full-duplex amplify-and-forward relay equipped with horn antennas is introduced between the base station and the waveguide input, which significantly improves the link budget in high-frequency bands while effectively eliminating self-interference. On this basis, we formulate a total power minimization problem subject to a quality-of-service constraint at the user equipment, involving the joint optimization of the pinching-antenna position, the relay amplification gain, and the base station transmit power. By exploiting the structure of the end-to-end signal-to-noise ratio, the optimal pinching-antenna position is first obtained in closed form by balancing waveguide attenuation and free-space path loss. Subsequently, closed-form expressions for the optimal relay gain and transmit power are derived. Numerical results demonstrate that the proposed scheme substantially outperforms conventional systems without relaying and relay-assisted transmission with fixed antennas in terms of total power consumption.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21162v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Hao Feng",
      "Ebrahim Bedeer",
      "Ming Zeng",
      "Xingwang Li",
      "Shimin Gong",
      "Quoc-Viet Pham"
    ],
    "title": "Phase-Aware Localization in Pinching Antenna Systems: CRLB Analysis and ML Estimation",
    "abstract": "Pinching antenna systems (PASS) have recently emerged as a promising architecture for high-frequency wireless communications. In this letter, we investigate localization in PASS by jointly exploiting the received signal amplitude and phase information, unlike recent works that consider only the amplitude information. A complex baseband signal model is formulated to capture free-space path loss, waveguide attenuation, and distance-dependent phase rotation between the user and each pinching antenna. Using this model, we derive the Fisher information matrix (FIM) with respect to the user location and obtain closed-form expressions for the Cramer-Rao lower bound (CRLB) and the position error bound (PEB). A maximum likelihood (ML) estimator that jointly considers the received signal amplitude and phase is developed to estimate the unknown user location. Given the non-convexity of the estimation problem, a two-stage solution combining coarse grid search and Levenberg-Marquardt refinement is proposed. Numerical results demonstrate that the proposed phase-aware estimator outperforms existing amplitude-only method in terms of positioning accuracy.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21159v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Maria V. Bartmeyer",
      "Paulo L. Dattori da Silva",
      "Rafael B. Gonzalez"
    ],
    "title": "Global hypoellipticity for perturbations of complex vector fields on the torus",
    "abstract": "We apply Krönecker's approximation theorem to measure (in a topological sense) a set of constants which turn a vector field into a non-globally hypoelliptic operator. We present situations in which this set is a discrete enumerable (hence, meager) subset of the real line, and we also show that this set may be a dense $\\mathcal{G}_δ$ subset of the complex numbers (hence, nonmeager), which produces a contrast to a known result stating that this set has null Lebesgue measure.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20836v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yanbin Zhu",
      "Xiaomeng Jiang",
      "Yong Li"
    ],
    "title": "Onsager--Machlup Functional for Fractional Stochastic Newton Dynamics with Time-Dependent Noise Intensities",
    "abstract": "In this paper, we derive the Onsager--Machlup functional for a second-order Newton-type stochastic system driven by time-dependent fractional noise, \\[\n  X_t'' = f_t(X_t, X_t') + σ_t \\,ξ_t^{H}, \\] where \\( H \\in (1/4,1) \\). The analysis relies on applying a Girsanov transformation to the non-degenerate components and evaluating the limiting conditional expectation associated with the noise term, for which the stochastic Fubini theorem plays a crucial role. To illustrate the applicability of the result, we study two mechanical systems perturbed by noise and provide supporting numerical simulations.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20827v1",
    "categories": [
      "math-ph",
      "math.AP",
      "math.DS",
      "quant-ph"
    ],
    "authors": [
      "Riccardo Adami",
      "Luigi Barletti",
      "Alessandro Teta"
    ],
    "title": "A mathematical model for the Einstein-Podolsky-Rosen argument",
    "abstract": "We study a nonrelativistic system made of two quantum particles constrained to move on a line and a spin located at a fixed point of the line. Initially the two particles are in a maximally entangled state and the spin is down. The first particle interacts with the spin while the second particle is free, i.e., it does not interact neither with the first particle nor with the spin. We rigorously prove that there is a correlation between the state of the spin and the state of the second particle. More precisely, we show that, in a suitable scaling limit, if the first particle flips the spin, then the second particle possesses a definite momentum in the direction opposite to the spin.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20822v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Philipp Mickan",
      "Thorsten Hohage"
    ],
    "title": "Hölder-Logarithmic Stability and Convergence Rates for an Inverse Random Source Problem",
    "abstract": "In this paper, we investigate an inverse random source problem concerned with recovering the strength of a random, uncorrelated acoustic source from correlation measurements of emitted time-harmonic acoustic waves. Such problems arise in applications including aeroacoustics and seismic imaging. Unlike their deterministic counterparts, inverse random source problems are known to be uniquely solvable in the absence of noise. Nevertheless, due to their inherent ill-posedness, regularization is required to stably reconstruct the source strength.\n  We derive conditional Hölder-logarithmic stability estimates under Sobolev smoothness assumptions by employing complex geometrical optics solutions. Moreover, by establishing a variational source condition, we obtain Hölder-logarithmic convergence rates for spectral regularization methods. At fixed frequency, the exponents in the logarithmic stability and convergence estimates grow unboundedly as the Sobolev regularity of the source increases. Finally, we present numerical experiments supporting our theoretical findings.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20815v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Nils Lid Hjort",
      "Nikolai G. Ushakov"
    ],
    "title": "Upper Bounds for the I-MSE and max-MSE of Kernel Density Estimators",
    "abstract": "The performance of kernel density estimators is usually studied via Taylor expansions and asymptotic approximation arguments, in which the bandwidth parameter tends to zero with increasing sample size. In contrast, this paper focusses directly on the finite-sample situation. Informative upper bounds are derived both for the integrated and the maximal mean squared error function. Results are reached for the traditional case, where the kernel is a probability density function, under various sets of assumptions on the underlying density to be estimated. Results are also derived for the important non-conventional case of the sinc kernel, which is not integrable and also takes negative values. We pin-point ways in which the sinc-based estimator performs better than the conventional kernel estimators. When proving our results we rely on methods related to characteristic and empirical characteristic functions.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20808v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Bouderbala Mihoub"
    ],
    "title": "On the Asymptotic Behavior of a Multiplicative Arithmetic Function Related to the Divisor Function Over Perfect Squares Integers Generated by Shifting",
    "abstract": "Let $x$ be a real number satisfying $x \\geq 2$. For any positive integer $n$, we define $s(n)$ as the smallest non-negative integer such that $n + s(n)$ is a perfect square. In this paper, we derive an asymptotic formula for the sum \\begin{equation*} \\sum_{n \\leq x} D(n + s(n)), \\end{equation*} where \\begin{equation*} D(n) = \\frac{τ(n)}{2^{ω(n)}}. \\end{equation*} Here, $τ(n)$ denotes the number of positive divisors of $n$, and $ω(n)$ stands for the number of distinct prime factors of $n$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20783v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jack H. Koolen",
      "Jing-Yuan Liu",
      "Qianqian Yang",
      "Meng-Yue Cao"
    ],
    "title": "A structure theory for signed graphs with fixed smallest eigenvalue",
    "abstract": "In this paper, we will give a structure theory for signed graphs with fixed smallest eigenvalue and investigate signed graphs with smallest eigenvalue greater than $-1-\\sqrt{2}$. Given a real number $λ\\leq -1$, we show that the following hold for each signed graph $(G,σ)$ with smallest eigenvalue at least $λ$ and large minimum valency: $\\mathrm{(i)}$ there exist dense induced subgraphs $N_1, \\dots, N_r$ in $(G,σ)$ such that each vertex lies in at most $\\lfloor -λ\\rfloor$ $N_i$'s and almost all edges of $(G,σ)$ lie in at least one of the $N_i$'s; $\\mathrm{(ii)}$ if $λ>-1-\\sqrt{2}$, then $(G,σ)$ has smallest eigenvalue at least $-2$ and $(G,σ)$ is $1$-integrable.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21079v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Kai-Li Wang",
      "I-Kun Chen"
    ],
    "title": "On thermal transpiration and thermomolecular pressure difference",
    "abstract": "In this article, we demonstrate the phenomenon of thermal transpiration in a bounded convex domain. We employ the stationary Boltzmann equation with a cutoff potential. For boundary condition, we partition the boundary into diffuse reflection and incoming regions. We establish the existence of solution in a weighted $L^\\infty$ space. Furthermore, we consider a convex domain with diffuse reflection boundary condition in the middle and incoming boundary condition at the two ends.\n  We first consider Maxwellians with the same pressure but different temperatures at the two ends. We prove that the total flux $U(x)$ is directed toward the hot end. Furthermore, we derive an estimate for the total flux:\n  \\begin{align}\n  U(x)\\geq C\\left(1-\\frac{1}{\\sqrt{T_2}}\\right).\n  \\end{align}\n  In addition, we show that when the pressures and temperatures on the two ends satisfy the relation\n  \\begin{align}\n  \\frac{P_1}{P_2}=\\sqrt{\\frac{T_1}{T_2}},\n  \\end{align}\n  the total flux of the solution is of order $\\mathcal{O}(\\frac{1}κ)$. This result is consistent with Knudsen's finding of thermomolecular pressure difference in 1909.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21048v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Isaac Dobes"
    ],
    "title": "t-Hermitian Forms of Arbitrary Degree, Their Spectral Structure, and Positivity",
    "abstract": "We introduce $t$-Hermitian forms of arbitrary degree $k$, a natural extension of classical degree $k$ Hermitian forms obtained through a synthesis of the tensor transformation law and the $t$-product of third-order tensors. We show that degree $k$ $t$-Hermitian forms uniquely correspond to order $2k+1$ Hermitian tensors arising as canonical representatives within the $^*$-algebra of Hermitian tensors equipped with the $t$-product/$t$-Einstein product. Applying the discrete Fourier transform, their corresponding $t$-Hermitian forms decompose into collections of classical degree $k$ Hermitian forms. This decomposition yields a universal lifting property, allowing arbitrary collections of degree $k$ Hermitian forms to be viewed as a single structured object which preserves fundamental properties such as Hermitian positive-definiteness.\n  For a distinguished class of $t$-Hermitian forms, which we refer to as commutant $t$-Hermitian forms, we establish a spectral theory extending the classical spectral characterization of Hermitian tensors. In particular, we relate Hermitian positive-definiteness to two distinct classes of eigenvalues: the tensor eigenvalues of each frontal slice of the form's corresponding tensor, and matrix eigenvalues obtained after unfolding each of these slices into matrices. Indeed, we prove that the tensor eigenvalues characterize Hermitian positive-definiteness; moreover, positivity of the matrix eigenvalues implies Hermitian positive-definiteness, however the converse fails in general.\n  Together, these results provide a unified framework for structured interactions among higher-degree Hermitian forms and lay the groundwork for further study, especially with regards to the consequences of the spectral hierarchy of positivity inherent in this setting.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20956v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Walid Hachem",
      "Michail Louvaris",
      "Jamal Najim"
    ],
    "title": "Extreme eigenvalues and eigenvectors for finite rank additive deformations of non-hermitian sparse random matrices",
    "abstract": "Consider a $n\\times n$ sparse non-Hermitian random matrix $X_n$ defined as the Hadamard product between a random matrix with centered independent and identically distributed entries and a sparse Bernoulli matrix with success probability $K_n/n$ where $K_n\\le n$ (and possibly $K_n\\ll n$) and $K_n\\to \\infty$ as $n\\to \\infty$. Let $E_n$ be a deterministic $n\\times n$ finite-rank matrix. We prove that the outlier eigenvalues of $Y_n= X_n +E_n$ asymptotically match those of $E_n$. In the special case of a rank-one deformation, assuming further that the sparsity parameter satisfies $K_n \\gg \\log^9(n)$ and that the entries of the random matrix are sub-Gaussian, we describe the limiting behavior of the projection of the right eigenvector associated with the leading eigenvalue onto the right eigenvector of the rank-one deformation. In particular, we prove that the projection behaves as in the Hermitian case. To that end, we rely on the recent universality results of Brailovskaya and van Handel (2024) relating the singular value spectra of deformations of $X_n$ to Gaussian analogues of these matrices. Our analysis builds upon a recent framework introduced by Bordenave et.al. (2022), and amounts to showing the asymptotic equivalence between the reverse characteristic polynomial of the random matrix and a random analytic function on the unit disc with explicit dependence on the finite-rank deformation.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20861v1",
    "categories": [
      "math.RT",
      "math-ph",
      "math.CO",
      "math.QA"
    ],
    "authors": [
      "Jeremie Guilhot",
      "Loic Poulain d'Andecy"
    ],
    "title": "Kazhdan-Lusztig bases of parabolic Hecke algebras and applications to Schur-Weyl duality",
    "abstract": "With an eye to applications to type A and Schur-Weyl duality, we study Kazhdan-Lusztig bases for a general parabolic Hecke algebra. Parabolic Hecke algebras are idempotent subalgebras of Hecke algebras corresponding to parabolic subgroups, and for type A they coincide with the fused Hecke algebras appearing in a generalisation of the Schur-Weyl duality with the quantum group of GL(N). In this paper we investigate two different Kazhdan-Lusztig bases for parabolic Hecke algebras, together with the associated cells and the corresponding representations. We quickly specialise to type A, for which we describe the cells in terms of the RSK correspondence generalising thus the well-known description for the symmetric group. As a first application we recover the classification of irreducible representations of parabolic Hecke algebras of type A and provide a new construction of these representations. Next we turn to the Schur-Weyl duality and describe the kernel in terms of one the basis studied precedently. Moreover, we formulate some conjectures about a generator of these kernels in terms of Kazhdan-Lusztig basis elements, give some evidence and prove these conjectures in some special cases.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21164v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Federico Herrero-Hervás"
    ],
    "title": "Weak global solvability of a doubly degenerate parabolic-elliptic nutrient taxis system",
    "abstract": "This work studies the following doubly degenerate parabolic-elliptic nutrient taxis system $$ \\begin{cases}\n  u_t = (uvu_x)_x -(u^2 vv_x)_x + uv, \\\\[1.5 ex]\n  \\hspace{0.2 cm}0 = v_{xx} - uv + f(x,t), \\end{cases} $$ in a bounded interval $Ω\\subset \\mathbb{R}$, under no-flux boundary conditions and nonnegative initial value $u(x,0) = u_0(x) \\geq 0$, where $f(x,t) \\geq 0$ is known external supply of the nutrient.\n  It is shown that for any nonnegative $u_0 \\in W^{1,\\infty}(Ω)$ and $f \\in C^1\\big(\\barΩ \\times [0,\\infty) \\big)$, $f \\not \\equiv 0$, a global weak solution of the problem can be constructed by means of a regularization approach.\n  The core of the analysis lies on a Harnack-type inequality for the second that allows us to overcome the lack of uniform coercivity. Together with time regularity properties, we obtain relative compactness through a combination of the Arzelà-Ascoli theorem and the Aubin-Lions lemma.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21152v1",
    "categories": [
      "math.SG"
    ],
    "authors": [
      "Dylan Cant",
      "Eric Kilgore",
      "Jun Zhang"
    ],
    "title": "Equivariant Floer cohomology for contactomorphisms of quotient spaces",
    "abstract": "This paper establishes the orderability of contact manifolds which are quotients of fillable contact manifolds under finite group actions compatible with the filling, the prototypical example being $\\mathbb{R}P^{2n-1}$ as the quotient of $S^{2n-1}$. Our approach employs an equivariant formulation of the so-called contact Floer cohomology theory. This leads us to develop an analogue of Givental's nonlinear Maslov index using the $\\mathbf{k}[[x]]$-module structure on an equivariant version of contact Floer cohomology. A key idea is that mapping cones of continuation maps detect crossings with the discriminant (recall that Givental's index is a continuous integer valued function on the complement of the discriminant). To properly handle the inherent non-canonicity in defining such mapping cones, we lift the structure of contact Floer cohomology to chain level by defining it as an $\\infty$-functor on a suitable $\\infty$-categorification of the Eliashberg-Polterovich orderability relation on the universal cover of the contactomorphism group.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21114v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Tianyu Lu",
      "Jiajun He",
      "Mohammadali Mohammadi",
      "Michail Matthaiou"
    ],
    "title": "Delay Alignment Modulation for Secure ISAC Systems",
    "abstract": "This paper introduces delay-alignment modulation (DAM) for secure integrated sensing and communication (ISAC). Due to the broadcast nature of multi-user downlinks, communications are vulnerable to eavesdropping. DAM applies controlled per-path symbol delays at the transmitter to coherently align the multipath components at the intended user, enhancing the received signal power, while simultaneously creating delay misalignment at the eavesdropper (Eve). To mitigate sensing degradation caused by multipath propagation, we propose a two-stage protocol that first estimates the angle and then the delay of the line-of-sight (LoS) path after suppressing multipath interference. We derive the secrecy spectral efficiency (SSE) and the Cramer-Rao (CRB) of the target delay. Finally, we develop a path-based zero-forcing (ZF) precoding framework and formulate a max-min SSE design under CRB and power constraints. Simulation results show DAM significantly outperforms the strongest-path (SP) benchmark in terms of SSE, while meeting sensing requirements, since intentional delay alignment at legitimate users degrades reception at Eve.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21112v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Philemon Urbain Mballa"
    ],
    "title": "Potential Relation Between the Riemann Zeta Function and the Polynomial Function $F$ of the Generalized Erdős--Straus Conjecture, Subject to its Analytic Continuation",
    "abstract": "In this article, we explore a natural extension of the quadratic parametrization introduced in our previous work. By replacing the integer $n$ by $n^s$ ($ s\\in\\mathbb{R}, s>1$) and allowing the parameters to be real, we obtain for each $n\\ge 1$ a decomposition $\\frac{k}{n^s} = \\frac{1}{x_s(n)}+\\frac{1}{y_s(n)}+\\frac{1}{z_s(n)}$ with $x_s(n), y_s(n), z_s(n) \\in \\mathbb{R}^*+$. Summing this equality over all integers brings forth the Riemann zeta function. Subject to an analytic continuation of the quantities $x_s(n), y_s(n), z_s(n)$ to complex values of $s$, one would obtain a new function \\(G_k(s)\\) satisfying $G_k(s)=k\\,ζ(s)$, thus establishing a deep connection between the structure of the conjecture and the zeros of $ζ$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20919v1",
    "categories": [
      "math.CO",
      "math.NT"
    ],
    "authors": [
      "Seoyoung Kim",
      "Chi Hoi Yip",
      "Semin Yoo"
    ],
    "title": "Shifted multiplicative subgroups are not ratio sets",
    "abstract": "In a recent breakthrough, Kalmynin proved a conjecture of Lev--Sonn and a conjecture of Sárközy on additive decompositions of multiplicative subgroups of a prime field. In this paper, we prove a multiplicative analogue of Kalmynin's result on a generalization of the Lev--Sonn conjecture, inspired by a relevant conjecture of Sárközy. We show that all nonzero shifts of proper multiplicative subgroups (of size at least $3$) are not ratio sets of the form $A/A$. This in particular extends a result of Shkredov, where he showed the same for small multiplicative subgroups (of size $<p^{6/7}$ in $\\mathbb{F}_p$). We also prove an analogous statement over complex numbers for finite subgroups of the unit circle, which may be of independent interest.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20844v1",
    "categories": [
      "math.ST",
      "cs.IT",
      "math.PR",
      "stat.ME",
      "stat.ML"
    ],
    "authors": [
      "Subhrosekhar Ghosh",
      "Rathindra Nath Karmakar",
      "Samriddha Lahiry"
    ],
    "title": "Maximum entropy based testing in network models: ERGMs and constrained optimization",
    "abstract": "Stochastic network models play a central role across a wide range of scientific disciplines, and questions of statistical inference arise naturally in this context. In this paper we investigate goodness-of-fit and two-sample testing procedures for statistical networks based on the principle of maximum entropy (MaxEnt). Our approach formulates a constrained entropy-maximization problem on the space of networks, subject to prescribed structural constraints. The resulting test statistics are defined through the Lagrange multipliers associated with the constrained optimization problem, which, to our knowledge, is novel in the statistical networks literature.\n  We establish consistency in the classical regime where the number of vertices is fixed. We then consider asymptotic regimes in which the graph size grows with the sample size, developing tests for both dense and sparse settings. In the dense case, we analyze exponential random graph models (ERGM) (including the Erdös-Rènyi models), while in the sparse regime our theory applies to Erd{ö}s-R{è}nyi graphs.\n  Our analysis leverages recent advances in nonlinear large deviation theory for random graphs. We further show that the proposed Lagrange-multiplier framework connects naturally to classical score tests for constrained maximum likelihood estimation. The results provide a unified entropy-based framework for network model assessment across diverse growth regimes.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21085v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Rasmus Hauge Hansen",
      "Jens Kaad"
    ],
    "title": "Quantum deformations of the arc length metric",
    "abstract": "We investigate a q-deformation of the arc length metric on the unit circle. This q-deformation arises naturally from the Dirac operator by replacing the standard integers by their q-deformed analogues. Nonetheless, we show that the corresponding metric structure only makes sense at the level of quantum metric spaces as introduced by Marc Rieffel. This means that the quantum metric we obtain on the continuous functions on the circle does not arise from a classical metric on the circle. In the special case where q equals one we recover the usual arc length metric and we show that our family of quantum metric spaces depend continuously on the deformation parameter with respect to David Kerr's complete Gromov-Hausdorff distance.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21071v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Dongyeong Ko",
      "Xuan Yao"
    ],
    "title": "Capillary minimal slicing and scalar curvature rigidity",
    "abstract": "We develop minimal slicing via capillary hypersurfaces to understand positive scalar curvature metric on manifolds with boundary. The method provides rigidity statements once the regularity of minimizers of capillary area functional holds. In particular, in dimension $4$, we prove following comparison and rigidity statement: given a compact Riemannian $4$-manifold $(M^4,g)$ with a mean convex boundary whose boundary is diffeomorphic to boundary of a connected convex domain in $\\mathbb R^4$, if the scalar curvature is non-negative and the scaled mean curvature comparison holds along the boundary, then $M$ is isometric to the Euclidean domain.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21067v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Yuki Irie"
    ],
    "title": "On linear lexicographic codes: Ninth column construction of the ternary Golay code",
    "abstract": "We characterize linear lexicographic $p$-ary codes. Using this characterization, when $p \\ge 3$, we determine the dimensions of linear lexicographic codes obtained from several bases including the standard basis, except for those of certain minimum distances. In these excluded cases, we may obtain linear codes of higher dimensions; for instance, when $p = 3$ and $d = 6$, the ternary Golay code is obtained.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21060v1",
    "categories": [
      "math.CT",
      "math.AG",
      "math.RA"
    ],
    "authors": [
      "David Forsman"
    ],
    "title": "On the Semi-Abelianness of Affine Group Schemes",
    "abstract": "We prove that the category of commutative Hopf algebras over a field $k$ is co-semi-abelian. Consequently, the category of affine group $k$-schemes is semi-abelian. We establish coregularity by identifying the orthogonal factorization system of surjections and faithfully flat injections, and we deduce coexactness from Takeuchi's correspondence between normal Hopf ideals and Hopf subalgebras of commutative Hopf $k$-algebras.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21047v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jessica Alessandrì",
      "Nirvana Coppola"
    ],
    "title": "Torsion points on $\\rm{GL}_2$-type abelian varieties",
    "abstract": "It is well known that the rational torsion of an abelian variety defined over a number field injects into the reduction modulo any sufficiently large prime, so the order of the torsion group divides the greatest common divisor of the sizes of points on the reduction at each prime. Drawing inspiration from Katz's Inventiones paper (1981), we investigate the converse to this for abelian varieties of $\\rm GL_2$-type and exhibit a conjectural list of possible torsion orders for modular abelian varieties over $\\mathbb Q$ of dimension up to $5$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21040v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alex D Rodriguez"
    ],
    "title": "Blow-up criteria for the 1D NLS with combined nonlinearities",
    "abstract": "In this paper we develop two different types of criteria for the finite time blow-up solutions to the combined nonlinear Schrödinger equation in 1D. The first one is a negative energy criterion developed for triple combined nonlinearity and then for a (convergent) infinite sum of combined nonlinearities, including an exponential nonlinearity. The second one is a positive energy criterion for the double nonlinearity with the defocusing-focusing coefficients. We also provide examples of initial data that satisfy either of the criteria.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21032v1",
    "categories": [
      "math.NT",
      "math.AT"
    ],
    "authors": [
      "Will Sawin",
      "Melanie Matchett Wood"
    ],
    "title": "Distributions of unramified extensions of global fields",
    "abstract": "Given a finite group $Γ$, we prove results on the distribution of the prime to $q|Γ|$-part of fundamental groups of $Γ$-covers of the projective line $\\mathbb P^1_{\\mathbb F_q}$ over a finite field $\\mathbb F_q$ as $q\\to\\infty$. Equivalently, this is a result on the distribution of the Galois groups of maximal unramified extension of $Γ$-extensions of $\\mathbb F_q(t)$, and thereby motivates a new conjecture on the distribution of Galois groups of maximal unramified extension of $Γ$-extensions of a number field. In particular, this allows us to see and predict the effect of roots of unity in the base field on such distributions. We introduce the idea to study these groups along with the class in their 3rd homology group that arises from Artin-Verdier duality. This invariant refines the lifting invariant that, in the function field setting, corresponds to stable components of Hurwitz space. One major input into our function field results is an application of our recently developed methods to determine a distribution of groups (or more general algebraic structures) from its moments. We prove non-existence results in the number field case that support our conjectures in the case where our conjectures predict certain kinds of groups occur with probability zero.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21030v1",
    "categories": [
      "math.FA",
      "math.RA"
    ],
    "authors": [
      "Projesh Nath Choudhury",
      "Shivangi Yadav"
    ],
    "title": "Linear preserver problems in matrix positivity theory",
    "abstract": "Linear preserver problems have been a central focus of research in matrix theory and operator theory for more than a century, beginning with Frobenius' 1897 characterization of determinant preserving linear maps on the space of complex matrices. Since this foundational result, considerable work has examined linear preservers of diverse subsets, functions, and relations across different matrix and operator spaces. The purpose of this survey is to present the current state of research on linear preserver problems for several positivity classes of matrices. We provide an overview of recent developments in the literature and, for each positivity class considered, identify gaps that remain to guide future research.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21021v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Felipe Hernández"
    ],
    "title": "Structure and Spectrum of Nonergodic Nilsystems",
    "abstract": "We study Host-Kra factors and the spectral type of nilsystems, without assuming ergodicity. In the ergodic case, it is known that the spectral type splits into a discrete component and a Lebesgue component of infinite multiplicity. We extend this decomposition to nonergodic nilsystems. As a consequence, we obtain a spectral decomposition for ergodic $\\mathbb{Z}^2$-nilsystems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20993v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Jiajun He",
      "Han Yu",
      "Yiran Guo",
      "Xinping Yi",
      "Fan Liu",
      "Hing Cheung So",
      "Hien Quoc Ngo",
      "Michail Matthaiou",
      "Giuseppe Caire"
    ],
    "title": "Topology-Aware Coordination for Multi-Functional Low-Altitude Wireless Networks",
    "abstract": "Low-altitude wireless networks (LAWNs) are expected to consist of multi-tier, heterogeneous terrestrial and non-terrestrial devices, where effective coordination is essential to fully unlock the complementary capabilities of diverse systems from different vendors. To address this issue, we propose a novel multi-functional coordination framework that enables seamless cooperation within the LAWN while supporting efficient execution of diverse network functions. In the proposed architecture, each device or infrastructure element is assigned to a specific functional role, namely, edge mobile terminal (E-MT), distributed MT (D-MT), or computing center. E-MTs are equipped with lightweight, independent signal processing and computing capabilities, while D-MTs and the computing center handle regional and global coordination, respectively. To enhance the overall network efficiency, we model the LAWN as a sparse graph, where nodes represent network nodes and edges are defined according to a set of controllable connection rules. This topology-aware (TA) representation allows for efficiently solving various coordination tasks across the network. Numerical results show that the proposed TA coordination framework outperforms baseline approaches that lack topological insights, achieving higher efficiency in multi-task coordination. Finally, we discuss key technical challenges and outline potential solutions for future deployment.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20991v1",
    "categories": [
      "math.OC",
      "cs.DS",
      "math.PR"
    ],
    "authors": [
      "Robin A. Heinonen"
    ],
    "title": "Asymptotics of solutions to the linear search problem",
    "abstract": "The exact leading asymptotics of solutions to the symmetric linear search problem are obtained for any positive probability density on the real line with a monotonic, sufficiently regular tail. A similar result holds for densities on a compact interval.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20938v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Maicon Sonego"
    ],
    "title": "Boundary-driven patterns in elongated convex domains",
    "abstract": "We consider the heat equation in a smooth bounded convex domain $Ω\\subset \\mathbb{R}^2$ with nonlinear Neumann boundary condition $\\partial_νu = λ(u - u^3)$. Stable non-constant stationary solutions do not exist when $Ω$ is a ball. We show that this behavior is not a consequence of convexity alone. More precisely, if the inradius of $Ω$ is fixed and its diameter is sufficiently large, then there exists $λ>0$ for which the problem admits such a solution. The result reveals a geometric mechanism for the emergence of stable non-constant stationary solutions in elongated convex domains.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20935v1",
    "categories": [
      "math.PR",
      "math.MG"
    ],
    "authors": [
      "Zakhar Kabluchko",
      "Vanessa Mattutat",
      "Christoph Thaele"
    ],
    "title": "Seeing Through Hyperbolic Space: Visibility for $λ$-Geodesic Hyperplanes",
    "abstract": "We study visibility from a fixed point in the presence of a Poisson process of $λ$--geodesic hyperplanes in a $d$-dimensional hyperbolic space. The family of $λ$--geodesic hyperplanes interpolates between totally geodesic hyperplanes and horospheres. Our main result establishes a universality principle for this model: we prove that the fundamental visibility properties are invariant with respect to the parameter $λ\\in[0,1]$. Namely, there is a critical intensity $γ_{\\mathrm{crit}}>0$ such that the visible region is unbounded with positive probability for $γ< γ_{\\mathrm{crit}}$ and almost surely bounded for $γ> γ_{\\mathrm{crit}}$. For $d=2$ we establish almost sure boundedness also at criticality. The value for $γ_{\\mathrm{crit}}$ is explicit and does not depend on $λ$. In the bounded phase, we show that the mean visible volume is identical with the known formula for $λ=0$. The key integral-geometric step is an explicit computation showing that the measure of $λ$-geodesic hyperplanes hitting a geodesic segment is a linear function of the length of the segment, independent of~$λ$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20895v1",
    "categories": [
      "math.AP",
      "math-ph",
      "nlin.SI"
    ],
    "authors": [
      "Patrick Gérard",
      "Enno Lenzmann"
    ],
    "title": "The half-wave maps equation on $\\mathbb{T}$: Global well-posedness in $H^{1/2}$ and almost periodicity",
    "abstract": "We consider the half-wave maps equation $$ \\partial_t \\mathbf{u} = \\mathbf{u} \\times |D| \\mathbf{u} $$ for $\\mathbf{u} : \\mathbb{R} \\times \\mathbb{T} \\to \\mathbb{S}^2$, where $\\mathbb{T}=\\mathbb{R}/2 π\\mathbb{Z}$ is the one-dimensional torus and $\\mathbb{S}^2 \\subset \\mathbb{R}^3$ denotes the unit sphere. By extension from rational initial data, we construct a unique and continuous flow map for data in the critical energy space $H^{1/2}(\\mathbb{T}; \\mathbb{S}^2)$. Moreover, we show almost periodicity in time of these solutions. For the dense subset of rational initial data, we establish quasi-periodicity in time and a-priori bounds on $\\| \\mathbf{u}(t) \\|_{H^s(\\mathbb{T})}$ for any $s >0$.\n  Our analysis relies crucially on an explicit formula arising from the Lax pair structure acting on a Hardy space of vector-valued holomorphic functions on the unit disk. As a central ingredient, we develop a general {\\em stability principle} for explicit formulae associated with completely integrable PDEs possessing a Lax pair structure on Hardy spaces, including the Benjamin--Ono equation, Calogero--Sutherland DNLS, and the half-wave-maps equation posed on $\\mathbb{T}$.\n  Our results extend to the matrix-valued half-wave maps equation $$ \\partial_t \\mathbf{U} = -\\frac{i}{2} [ \\mathbf{U}, |D| \\mathbf{U} ] $$ with target manifold given by the complex Grassmannians $\\mathsf{Gr}_k(\\mathbb{C}^d)$, thereby generalizing the special case $\\mathbb{S}^2 \\cong \\mathbb{CP}^1 \\cong \\mathsf{Gr}_1(\\mathbb{C}^2)$. In a companion work, we prove global well-posedness for the half-wave maps equation posed on $\\mathbb{R}$ in the scaling-critical energy space $\\dot{H}^{1/2}$, by establishing a stability principle for explicit formulae on Hardy spaces in the complex half-plane $\\mathbb{C}_+$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20894v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "K. Castillo",
      "G. Gordillo-Núñez"
    ],
    "title": "Wendroff's theorem beyond consecutive degrees and related inverse spectral problems",
    "abstract": "A classical theorem of Wendroff shows that one may reconstructs a sequence of orthogonal polynomials on the real line from two non-constant polynomials of consecutive degrees whose zeros strictly interlace on the real line. In this note we extend this result to arbitrary non-constant polynomials. The reconstruction may be formulated via a Vandermonde-type linear system and recast as an underdetermined inverse spectral problem, in which the spectra of a finite Jacobi matrix and of one of its leading principal submatrices are prescribed. In addition, the analogous result on the unit circle is established by reconstructing a sequence of paraorthogonal polynomials from two arbitrary non-constant polynomials whose zeros strictly interlace on the unit circle. In this setting, the Jacobi matrix is replaced by a finite unitary pentadiagonal matrix, and the spectral data consist of the spectrum of the full matrix together with that of a rank-one perturbation of a leading principal submatrix. Strict interlacing of zeros is shown to be a necessary and sufficient condition for solvability, and explicit constructions of the associated polynomial families and matrices are provided. Finally, an algorithm and several illustrative examples are presented.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20875v1",
    "categories": [
      "math.ST",
      "math.OC",
      "math.PR",
      "stat.ME",
      "stat.ML"
    ],
    "authors": [
      "Louis Sharrock",
      "Nikolas Kantas",
      "Grigorios A. Pavliotis"
    ],
    "title": "Efficient Online Learning in Interacting Particle Systems",
    "abstract": "We introduce a new method for online parameter estimation in stochastic interacting particle systems, based on continuous observation of a small number of particles from the system. Our method recursively updates the model parameters using a stochastic approximation of the gradient of the asymptotic log likelihood, which is computed using the continuous stream of observations. Under suitable assumptions, we rigorously establish convergence of our method to the stationary points of the asymptotic log-likelihood of the interacting particle system. We consider asymptotics both in the limit as the time horizon $t\\rightarrow\\infty$, for a fixed and finite number of particles, and in the joint limit as the number of particles $N\\rightarrow\\infty$ and the time horizon $t\\rightarrow\\infty$. Under additional assumptions on the asymptotic log-likelihood, we also establish an $\\mathrm{L}^2$ convergence rate and a central limit theorem. Finally, we present several numerical examples of practical interest, including a model for systemic risk, a model of interacting FitzHugh--Nagumo neurons, and a Cucker--Smale flocking model. Our numerical results corroborate our theoretical results, and also suggest that our estimator is effective even in cases where the assumptions required for our theoretical analysis do not hold.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20858v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ismael Sandro da Silva",
      "Marcos T. Oliveira Pimenta",
      "Pedro Fellype Pontes"
    ],
    "title": "Multiple critical points theorems for a class of nonsmooth functionals and applications to problems driven by 1-Laplacian and discontinuous nonlinearities",
    "abstract": "In this paper, we present a novel approach to investigate the existence of multiple critical points for a class of nonsmooth functionals. This method provides a robust framework to analyze the existence of solutions for problems involving the $1$-Laplacian operator with discontinuous nonlinearities. Our results contribute to advancing the study of nonsmooth variational problems, by establishing new nonsmooth multiple critical point theorems.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20841v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Eva Horvat",
      "Luka Marčič"
    ],
    "title": "The fundamental quandle of ribbon concordances",
    "abstract": "We describe the fundamental quandle of a properly embedded surface $F$ (possibly with boundary) in $\\mathbb{R} ^{3}\\times I$, and derive its presentation in terms of a motion picture diagram or a CH-diagram of $F$. Our study is based on the topological definition of the fundamental quandle. We prove that a ribbon concordance $C$ from a classical knot $K_1$ to $K_0$ gives rise to an injective quandle homomorphism $Q(K_0)\\to Q(C)$ and a surjective quandle homomorphism $Q(K_1)\\to Q(C)$.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20774v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Sylwia Cichacz",
      "Dalibor Froncek"
    ],
    "title": "Semi-magic dihedral squares",
    "abstract": "Let $Γ$ be a group of order $n^2$ and $SMS_Γ(n)=(a_{i,j})_{n\\times n}$ be an $n\\times n$ array whose entries are all distinct elements of $Γ$. If there exists an element $μ\\inΓ$ such that for every row $i$, there exists an ordering of elements such that\n  $$\n  a_{i,j_1} a_{i,j_2} \\dots a_{i,j_{n-1}} a_{i,j_n} = μ\n  $$\n  and for every column $j$ there exists an ordering of elements such that\n  $$\n  a_{i_1,j} a_{i_2,j} \\dots a_{i_{m-1},j} a_{i_m,j} = μ,\n  $$\n  then $SMS_Γ(n)$ is called a \\emph{$Γ$-semi-magic square of side $n$} and $μ$ is called a \\emph{magic constant}.\n  We provide a complete characterization of semi-magic squares of side $n$ whose entries belong to a dihedral group $D_k$. Moreover, we show that in our constructions a single semi-magic square may admit two distinct magic constants, depending on the order in which the products are computed.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21194v1",
    "categories": [
      "math.CO",
      "hep-th"
    ],
    "authors": [
      "Hadleigh Frost",
      "Felix Lotter"
    ],
    "title": "The Universe Fan",
    "abstract": "The wavefunction of the universe, as studied in perturbative quantum field theory, is a rational function whose singularities and factorization properties encode a rich underlying combinatorial structure. We define and study a broad generalization of such wavefunctions that can be associated to any lattice. We obtain these wavefunctions as the Laplace transform of a polyhedral fan, the universe fan, whose cones are defined by positivity conditions reflecting a notion of causality in the lattice, and we describe its face lattice. In the matroid case, the universe fan projects to the nested set fan, and the wavefunctions we define recover the matroid amplitudes introduced by Lam as residues. Moreover, in the case relevant for physics, the positivity conditions give a novel way to study the wavefunction, and we show how it is related to the cosmological polytopes of Arkani-Hamed, Benincasa, Postnikov. Finally, we study refinements of the universe fan induced by piecewise linear (tropical) functions. The resulting subdivisions project to refinements of the nested set fan and correspond dually to blow-ups of matroid polytopes, generalizing the cosmohedron polytope.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21187v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Gabriela Ovando",
      "Mauro Subils"
    ],
    "title": "Magnetic equations on the Heisenberg group: symmetries, solutions and the inverse problem of the calculus of variations",
    "abstract": "The Heisenberg Lie group $H_3$ is modeled on the differentiable structure of $\\mathbb{R}^3$ but equipped with another non-commutative product operation. By fixing the usual metric on the Heisenberg Lie group, this work provides a comprehensive overview of the behavior of magnetic geodesics for any invariant Lorentz force. After writing the magnetic equations, we found symmetries that enable the explicit computation of the magnetic trajectories for any homogeneous exact and non-exact magnetic form. Finally we show that these magnetic trajectories are solutions of a variational problem: we present explicit examples of Lagrangians.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21138v1",
    "categories": [
      "math.OC",
      "cs.DS",
      "cs.LG"
    ],
    "authors": [
      "Kimon Fountoulakis",
      "David Martínez-Rubio"
    ],
    "title": "Complexity of Classical Acceleration for $\\ell_1$-Regularized PageRank",
    "abstract": "We study the degree-weighted work required to compute $\\ell_1$-regularized PageRank using the standard one-gradient-per-iteration accelerated proximal-gradient method (FISTA). For non-accelerated local methods, the best known worst-case work scales as $\\widetilde{O} ((αρ)^{-1})$, where $α$ is the teleportation parameter and $ρ$ is the $\\ell_1$-regularization parameter. A natural question is whether FISTA can improve the dependence on $α$ from $1/α$ to $1/\\sqrtα$ while preserving the $1/ρ$ locality scaling. The challenge is that acceleration can break locality by transiently activating nodes that are zero at optimality, thereby increasing the cost of gradient evaluations. We analyze FISTA on a slightly over-regularized objective and show that, under a checkable confinement condition, all spurious activations remain inside a boundary set $\\mathcal{B}$. This yields a bound consisting of an accelerated $(ρ\\sqrtα)^{-1}\\log(α/\\varepsilon)$ term plus a boundary overhead $\\sqrt{vol(\\mathcal{B})}/(ρα^{3/2})$. We provide graph-structural conditions that imply such confinement. Experiments on synthetic and real graphs show the resulting speedup and slowdown regimes under the degree-weighted work model.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21115v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Fa Peng",
      "Salvador Villegas"
    ],
    "title": "Regularity of stable radial solutions to semilinear elliptic equations in MEMS problems",
    "abstract": "This paper investigates the regularity of stable radial solutions to semilinear elliptic equations arising in MEMS problems, modeled by the Dirichlet problem $-Δu=f(u)$ in the unit ball $B_1$, where the nonlinearity $f\\in C^1([0,1))$ is nonnegative and satisfies $\\int^1_0f(s)\\,ds=+\\infty$. We focus on the case where $f$ blows up as $u\\to 1^{-}$. Micro-electro-mechanical systems (MEMS) are widely used devices in engineering and technology. Our main result establishes for dimensions $2\\le n\\le 6$, every stable radial solution is regular, meaning $\\|u\\|_{L^{\\infty}(B_1)}<1$. This result gives a positive answer to an open problem posed by Bruera and Cabré concerning the regularity of stable solutions for singular nonlinearities without requiring a Crandall-Rabinowitz type condition, at least in the radial case.",
    "date": "02-25"
  },
  {
    "link": "https://arxiv.org/pdf/2602.20964v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Maarten Derickx",
      "Sachi Hashimoto",
      "Filip Najman",
      "Ari Shnidman"
    ],
    "title": "Rational points on modular curves: parameterization and geometric explanations",
    "abstract": "We show that, conditional on Zywina's effective version of the Serre uniformity conjecture, there is a natural way to parameterize non-CM $\\mathbb{Q}$-rational points on all modular curves in terms of the rational points on finitely many modular curves. Our proof refines Zywina's work to give a (conditional) parameterization of the images of adelic Galois representations of elliptic curves. In particular, we show that there are 41 $j$-invariants of elliptic curves whose associated Galois image does not vary in an infinite family. Using our explicit parameterization, we show that all rational points on all modular curves arise from the geometry of modular curves in a formal sense, confirming a philosophy of Mazur and Ogg.",
    "date": "02-25"
  }
]