[
  {
    "link": "https://arxiv.org/pdf/2602.02981v1",
    "categories": [
      "math.OC",
      "math.NA"
    ],
    "authors": [
      "Harbir Antil",
      "Animesh Jain",
      "Rainald Löhner"
    ],
    "title": "Fisher-Information-Based Sensor Placement for Structural Digital Twins: Analytic Results and Benchmarks",
    "abstract": "High-fidelity digital twins rely on the accurate assimilation of sensor data into physics-based computational models. In structural applications, such twins aim to identify spatially distributed quantities--such as elementwise weakening fields, material parameters, or effective thermal loads--by minimizing discrepancies between measured and simulated responses subject to the governing equations of structural mechanics. While adjoint-based methods enable efficient gradient computation for these inverse problems, the quality and stability of the resulting estimates depend critically on the choice of sensor locations, measurement types, and directions.\n  This paper develops a rigorous and implementation-ready framework for Fisher-information-based sensor placement in adjoint-based finite-element digital twins. Sensor configurations are evaluated using a D-optimal design criterion derived from a linearization of the measurement map, yielding a statistically meaningful measure of information content. We present matrix-free operator formulas for applying the Jacobian and its adjoint, and hence for computing Fisher-information products $Fv = J^\\top R^{-1} Jv$ using only forward and adjoint solves. Building on these operator evaluations, we derive explicit sensitivity expressions for D-optimal sensor design with respect to measurement parameters and discuss practical strategies for evaluating the associated log-determinant objectives. To complement the general framework, we provide analytically tractable sensor placement results for a canonical one-dimensional structural model, clarifying the distinction between detectability and localizability and proving that D-optimal placement of multiple displacement sensors yields approximately uniform spacing.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02954v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Amod Agashe"
    ],
    "title": "The index of a certain quotient of the Hecke algebra in its normalization",
    "abstract": "Let $Γ$ be a congruence subgroup of $SL_2(Z)$, and let $f$ be a normalized eigenform of weight $k$ on $Γ$. Let $K$ denote the number field generated over $Q$ by the Fourier coefficients of $f$. Let $R$ denote the the order in $K$ generated by the Fourier coefficients of $f$, which is contained in the ring of integers $O$ of $K$. We relate the primes that divide the index of $R$ in $O$ to primes $p$ such that $f$ is congruent to a conjugate of $f$ modulo a prime ideal of residue characteristic $p$. The index mentioned above is the same as the index of the quotient of the Hecke algebra by the annihilator ideal of $f$ in its normalization.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02854v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "John T. Baldwin",
      "Constantin C. Brîncuş"
    ],
    "title": "Categoricity for inferential $ω$-logic and $L_{ω_1,ω}$",
    "abstract": "This paper provides two extensions of first order logic by `$ω$-rules'. In each case we characterize the countable structures whose theory in the logic is categorical (has a unique model). In the one-sorted inferential $ω$-logic, both Robinson's system $Q$ and Peano Arithmetic become categorical. In the two-sorted generalized $ω$-logic we show\n  each complete $L_{ω_1,ω}$ sentence defines the same class of structures as a first-order theory with the appropriate $G-ω$-rule. These logics are much weaker than second order logic and we argue that they do not appeal to the arithmetical concepts that the categoricity theorems themselves aim to secure. The results depend on proving that the inferential rules for the logics are categorical, i.e. they uniquely determine certain truth-conditions for the logical connectives and quantifiers. We provide an extensive answer to the doxological challenge (on referential determinacy) proposed in \\cite{ButtonWalshbook} and we develop a philosophical view of mathematics -which we call {\\em cognitive modelism}- according to which classical mathematics is best understood as a complex process of constructing and developing a distinctive class of concepts, rather than merely describing a fixed pre-existing realm of structures.\n  KEYWORDS: categoricity, inferentialism, first-order logic, first-order theories, $ω$-rules, $L_{ω_1,ω}$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02747v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Felix De La Cruz Serrano"
    ],
    "title": "Visualizing the Matrix Product as a Transformation: A Task Design Using GeoGebra in Secondary Mathematics Education",
    "abstract": "The teaching of matrix multiplication in secondary education is often limited to the mechanical application of the row-by-column algorithm, leaving aside its interpretation as a geometric transformation. This study analyzes the impact of a GeoGebra-mediated instructional sequence, grounded in the Mathematical Working Space (MWS) framework, on students learning of the matrix product. Ten fifth-year secondary students from a school in Lima (Peru) participated in the study. The intervention was carried out over four sessions, combining manual activities with digital exploration using GeoGebra. The results show notable progress in students semiotic genesis, reflected in the coordination of algebraic, graphical, and numerical representations; in instrumental genesis, through the increasingly meaningful use of GeoGebra as a cognitive tool; and in discursive genesis, as students developed explanations of the geometric effects of matrices. A transition is observed from an algorithmic execution of matrix multiplication toward a conceptual understanding based on linear transformations. These findings suggest that task designs integrating manual work, dynamic visualization, and mathematical argumentation support deeper understanding of matrix multiplication and provide criteria for the reflective use of digital technologies in secondary linear algebra instruction.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02664v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Gabriel Ribeiro"
    ],
    "title": "A moduli space of character sheaves",
    "abstract": "We study de Rham character sheaves on a commutative connected algebraic group $G$, defined as multiplicative line bundles with integrable connection. We construct a group algebraic space $G^\\flat$ representing their moduli problem on seminormal test schemes, and we investigate its functoriality and geometry. The main technical ingredient is a study of extension sheaves on the de Rham space $G_\\text{dR}$. An appendix provides self-contained, elementary proofs of basic results on de Rham spaces that may be of independent interest.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02508v1",
    "categories": [
      "cs.IT",
      "cs.AI",
      "eess.IV"
    ],
    "authors": [
      "Xi Chen",
      "Homa Esfahanizadeh",
      "Foad Sohrabi"
    ],
    "title": "Precoding-Oriented CSI Feedback Design with Mutual Information Regularized VQ-VAE",
    "abstract": "Efficient channel state information (CSI) compression at the user equipment plays a key role in enabling accurate channel reconstruction and precoder design in massive multiple-input multiple-output systems. A key challenge lies in balancing the CSI feedback overhead with the achievable downlink rate, i.e., maximizing the utility of limited feedback to maintain high system performance. In this work, we propose a precoding-oriented CSI feedback framework based on a vector quantized variational autoencoder, augmented with an information-theoretic regularization. To achieve this, we introduce a differentiable mutual information lower-bound estimator as a training regularizer to promote effective utilization of the learned codebook under a fixed feedback budget. Numerical results demonstrate that the proposed method achieves rates comparable to variable-length neural compression schemes, while operating with fixed-length feedback. Furthermore, the learned codewords exhibit significantly more uniform usage and capture interpretable structures that are strongly correlated with the underlying channel state information.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03332v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Yuta Watanabe"
    ],
    "title": "$L^2$-Dolbeault resolutions and Nadel vanishing on weakly pseudoconvex complex spaces with singular Hermitian metrics",
    "abstract": "In this paper, in order to develop a more general $L^2$-theory for the $\\overline{\\partial}$-operator on complex spaces, we provide $L^2$-Dolbeault fine resolutions and isomorphisms, and $L^2$-estimates, for holomorphic line bundles on complex spaces equipped with singular Hermitian metrics. As applications, we obtain several generalizations of the Nadel vanishing theorem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03322v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yanyan Shi",
      "Christian Lubich"
    ],
    "title": "Weighted finite difference methods for a nonlinear Klein--Gordon equation with high oscillations in space and time",
    "abstract": "We consider a nonlinear Klein--Gordon equation in the nonrelativistic limit regime with initial data in the form of a modulated highly oscillatory exponential. In this regime of a small scaling parameter $\\varepsilon$, the solution exhibits rapid oscillations in both time and space, posing challenges for numerical approximation. We propose an explicit and an implicit exponentially weighted finite difference method. While the explicit weighted leapfrog method needs to satisfy a CFL-type stability condition, the implicit weighted Crank--Nicolson method is unconditionally stable. Both methods achieve second-order accuracy with time steps and mesh sizes that are not restricted in magnitude by $\\varepsilon$. The methods are uniformly convergent in the range from arbitrarily small to moderately bounded $\\varepsilon$. Numerical experiments illustrate the theoretical results.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03298v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Noé de Rancourt",
      "Pandelis Dodos",
      "Konstantinos Tyros"
    ],
    "title": "Uniformity of extremal graph-codes",
    "abstract": "It is an important fact that extremal discrete structures -- that is, discrete structures of maximal size among those that avoid certain configurations -- exhibit strong pseudorandom behavior. We present instances of this phenomenon in the context of graph-codes, a notion put forth recently by Alon, as well as on related problems related to density polynomial Hales--Jewett conjecture.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03267v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Vanja Stojanović"
    ],
    "title": "The Mutual-Visibility Problem In Directed Graphs",
    "abstract": "The mutual-visibility problem, originally defined for undirected graphs, asks for the size of the maximum set of vertices $S$ such that every pair of vertices in $S$ is connected by a shortest path passing only through vertices in $V \\setminus S$. In this paper, we extend this concept to directed graphs, establishing fundamental results for several graph classes. We prove that for Directed Acyclic Graphs (DAGs), the mutual-visibility number $μ(D)$ is always 1, and for directed cycles of length $n \\geq 3$, it is strictly 2. In contrast, we demonstrate that tournaments can support arbitrarily large mutual-visibility sets; specifically, using properties of Paley tournaments, we show that $μ(T)$ grows linearly with the size of the tournament. On the algorithmic side, we show that while verifying a candidate set is polynomial-time solvable ($O(|S|(|V|+|A|))$), the problem of determining $μ(D)$ is NP-hard for general digraphs. We also analyze the impact of strong bridges and strongly connected components on the upper bounds of $μ(D)$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03193v1",
    "categories": [
      "math.RT",
      "math.GR",
      "math.RA"
    ],
    "authors": [
      "Jiawei He",
      "Xiaogang Li"
    ],
    "title": "Permutation groups and symmetric Hecke algebras",
    "abstract": "The endomorphism algebras of the permutation modules for transitive permutation groups, known as Hecke algebras, are fundamental objects in representation theory. While group algebras are known to be symmetric over any field, it is natural to ask whether this property extends to Hecke algebras. To study this, we introduce the new concepts of $p$-$S$-permutation groups (for a prime $p$) and $S$-permutation groups. A \\emph{ $p$-$S$-permutation group} is a transitive permutation group whose associated Hecke algebra is symmetric over every field of characteristic $p$. An \\emph{ $S$-permutation group} is a transitive permutation group that is a $p$-$S$-permutation group for all primes $p$. In this paper, we study Hecke algebras from a group-theoretical perspective and we show that several classes of permutation groups are $p$-$S$-permutation groups and $S$-permutation groups in our sense. This result represents a substantial extension of earlier work by Li and He. (Transform Groups, 30(4), 2025), and reframes the question of determining when the algebra \\(\\End_{KG}(KΩ)\\) is symmetric within a more general theoretical framework.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03174v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Martin Morange"
    ],
    "title": "Quantitative sensitivity analysis for Fokker-Planck equation with respect to the Wasserstein distance",
    "abstract": "We analyze the sensitivity of solutions to the Fokker-Planck equation with respect to some unknown parameter. Our main result is to provide quantitative upper bounds for the $p$-Wasserstein distance $\\mathcal{W}_p$ between two solutions with different parameters, for every $p \\geq 2$. We are able to give two proofs of this result, the first relying on synchronous coupling between two solutions of an SDE, and another one that relies on the differentiation of Kantorovitch dual formulation of optimal transport. We also provide more specific bounds in the case of the overdamped Langevin process, for which we are able to compare convergence to the invariant measure and sensitivity to the parameter.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03170v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Thomas Blomme",
      "Gurvan Mével"
    ],
    "title": "Refined invariants for Abelian surfaces: between polynomiality and modularity",
    "abstract": "Tropical refined invariants for toric surfaces, introduced Block and G{ö}ttsche, are obtained couting tropical curves with a Laurent polynomial multiplicity. Brugall{é} and Jaramillo-Puentes then exhibited a polynomial behavior of the coefficients of this Laurent polynomial, seen as function on the curve degree. The authors provided explicit formula for small genus, involving quasi-modular forms. Inspired by the toric setting, the first-named author defined refined invariants for abelian surfaces and extended the polynomiality result. In this paper, we further study this regularity for abelian surfaces, providing explicit formulas involving quasi-modular forms. This resonates with the small genus cases of the toric setting.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03167v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Aleksandar Bulj",
      "Kotaro Inami",
      "Shobu Shiraki"
    ],
    "title": "Reverse square function estimates for degenerate curves and its applications",
    "abstract": "Building on the classical work of Córdoba--Fefferman and the recent work of Schippa, we establish $L^4$ reverse square function estimates for functions whose Fourier support is contained in a $δ$-neighborhood of the curve $\\{(ξ,ξ^a): |ξ|\\leq 1\\}$ in $\\mathbb{R}^2$, for all exponents $a\\in(0,\\infty)\\backslash\\{1\\}$. As applications, we derive sharp $L^4$ Strichartz estimates on the one-dimensional torus for fractional Schrödinger equations and establish new local smoothing estimates in modulation spaces. In the latter application, orthogonal Strichartz-type estimates also play a crucial role.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03118v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Henri Klintebäck",
      "Christoph Ortner",
      "Lior Silberman"
    ],
    "title": "The High Cost of Data Augmentation for Learning Equivariant Models",
    "abstract": "According to Noether's theorem the presence of a continuous symmetry in a Hamiltonian systems is equivalent to the existence of a conserved quantity, yet these symmetries are not always explicitly enforced in data-driven models. There remains a debate whether or not encoding of symmetry into a model architecture is the optimal approach. A competing approach is to target approximate symmetry through data augmentation. In this work, we study two approaches aimed at improving the symmetry properties of such an approximation scheme: one based on a quadrature rule for the Haar measure on the compact Lie group encoding the continuous symmetry of interest and one based on a random sampling of that Haar measure. We demonstrate both theoretically and empirically that the quadrature augmentation leads to exact symmetry preservation in polynomial models, while the random augmentation has only square-root convergence of the symmetrization error.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03080v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Birama Sangare"
    ],
    "title": "Automorphisms and antiautomorphisms of quandles",
    "abstract": "In this paper we provide the conditions under which an automorphism or an antiautomorphism of a group $G$ induces an automorphism or an antiautomorphism of the $m$-conjugation quandle $\\operatorname{Conj_{m}}(G),\\,\\, m\\in \\mathbb{Z} $, the core quandle $\\operatorname{Core}(G)$, the generalized Alexander quandle $\\operatorname{Alex}(G,φ)$ where $φ\\in \\operatorname{Aut}(G)$ and some others. We also construct automorphisms of these quandles that do not originate from $G$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03058v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Silouanos Brazitikos",
      "Colin Tang",
      "Tomasz Tkocz"
    ],
    "title": "Moments of sums of exponentials, beyond CHS",
    "abstract": "We establish a sharp lower bound on the $L_p$-norm of sums of independent exponential random variables with fixed variance, for $p \\geq 2$, thus extending Hunter's positivity theorem (1976) for completely homogeneous polynomials. We determine the exact regime of $p$ where such sums enjoy Schur-monotonicity.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03041v1",
    "categories": [
      "math.SG",
      "math.AG"
    ],
    "authors": [
      "Yu-Wei Fan"
    ],
    "title": "Special Lagrangians and Bridgeland stable objects beyond geometric stability conditions: the product case",
    "abstract": "We construct a family of non-geometric Bridgeland stability conditions on certain wrapped Fukaya categories, using homological mirror symmetry and categorical Künneth formulae. These stability conditions correspond to certain holomorphic volume forms, under which we prove that every stable object admits a special Lagrangian representative. This provides the first higher-dimensional examples of stability conditions away from the large complex structure limit for which ``stable implies special Lagrangian\" is proved.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03236v1",
    "categories": [
      "math.RA",
      "math.AG"
    ],
    "authors": [
      "Haigang Hu",
      "Izuru Mori",
      "Wenchao Wu"
    ],
    "title": "Classification of noncommutative central conics",
    "abstract": "Classification of noncommutative quadric hypersurfaces is one of the major projects in noncommutative algebraic geometry. In recent years, we are dedicated to complete the classification of noncommutative central conics. To achieve this goal, we and other authors develop some theories to study and classify some classes of noncommutative quadric hypersurfaces in a series of papers. Finally, in this paper, we completely classify noncommutative central conics by developing the general theory of homogenization and dehomogenization for noncommutative algebras and by previous results. As a main result, we show that there are bijections among the following sets of objects (i) the set of isomorphism classes of $4$-dimensional Frobenius algebras, (ii) the set of isomorphism classes of noncommutative affine pencils of conics, and (iii) the set of isomorphism classes of noncommutative central conics.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02744v1",
    "categories": [
      "math.CO",
      "cs.CR"
    ],
    "authors": [
      "Maura B. Paterson",
      "Douglas R. Stinson"
    ],
    "title": "An introduction to local differential privacy protocols using block designs",
    "abstract": "The design of protocols for local differential privacy (or LDP) has been a topic of considerable research interest in recent years. LDP protocols utilise the randomised encoding of outcomes of an experiment using a transition probability matrix (TPM). Several authors have observed that balanced incomplete block designs (BIBDs) provide nice examples of TPMs for LDP protocols. Indeed, it has been shown that such BIBD-based LDP protocols provide optimal estimators.\n  In this primarily expository paper, we give a detailed introduction to LDP protocols and their connections with block designs. We prove that a subclass of LDP protocols known as pure LDP protocols are equivalent to $(r,λ)$-designs (which contain balanced incomplete block designs as a special case). An unbiased estimator for an LDP scheme is a left inverse of the transition probability matrix. We show that the optimal estimators for BIBD-based TPMs are precisely those obtained from the Moore-Penrose inverse of the corresponding TPM. We also review some existing work on optimal LDP protocols in the context of pure protocols.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02616v1",
    "categories": [
      "math.NA",
      "physics.flu-dyn",
      "physics.med-ph"
    ],
    "authors": [
      "Élise Foulatier",
      "Pierre-Alain Boucard",
      "François Louf",
      "David Néron",
      "Philipp Junker"
    ],
    "title": "A space-time LATIN-PGD strategy for solving Newtonian compressible flows",
    "abstract": "Simulating flow problems is at the core of many engineering applications but often requires high computational effort, especially when dealing with complex models. This work presents a novel approach for resolving flow problems using the LATIN-PGD solver. In this contribution, we place ourselves within the framework of Newtonian compressible and laminar flows. This specific and relatively simple case enables focusing on flows for which a state equation provides a direct relation between pressure and density. It is then possible to use the LATIN solver to set up a pressure-velocity decoupling algorithm. Moreover, Proper Generalised Decomposition (PGD) is natively included in the solver and yields two independent space-time decompositions for the velocity and the pressure fields. As a first step, the solver is validated on a problem for which an analytical solution is available. It is then applied to slightly more complex problems. The results show good agreement with the literature, and we expect that the solver could be used to compute more complicated material laws in the future.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02549v1",
    "categories": [
      "math.NA",
      "cs.DC"
    ],
    "authors": [
      "Yuki Uchino",
      "Katsuhisa Ozaki",
      "Toshiyuki Imamura"
    ],
    "title": "Error Analysis of Matrix Multiplication Emulation Using Ozaki-II Scheme",
    "abstract": "The Ozaki-II scheme is an emulation method that leverages the Chinese Remainder Theorem to compute high-precision matrix multiplication via a sequence of low-precision matrix multiplications. In this scheme, the attainable numerical accuracy improves as the number of low-precision matrix multiplications increases. Previous numerical studies have shown that single- and double-precision matrix multiplication using the Ozaki-II scheme achieves higher throughput than that of standard BLAS routines on modern AI hardware equipped with fast INT8 matrix multiply-accumulate units with INT8 inputs and INT32 accumulation. However, the accuracy of the Ozaki-II scheme can degrade when the exponent distribution of the input matrices is wide, in which case a large number of low-precision matrix multiplications is required to obtain high-precision results. In this paper, we present a rigorous deterministic error analysis of the Ozaki-II scheme. The proposed analysis not only clarifies the accuracy behavior of the method but also enables the estimation of the number of low-precision matrix multiplications required to achieve a desired level of numerical accuracy.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02992v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Masashi Wakaiki"
    ],
    "title": "Data-driven stabilization of continuous-time systems with noisy input-output data",
    "abstract": "We study data-driven stabilization of continuous-time systems in autoregressive form when only noisy input-output data are available. First, we provide an operator-based characterization of the set of systems consistent with the data. Next, combining this characterization with behavioral theory, we derive a necessary and sufficient condition for the noisy data to be informative for quadratic stabilization. This condition is formulated as linear matrix inequalities, whose solution yields a stabilizing controller. Finally, we characterize data informativity for system identification in the noise-free setting.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02940v1",
    "categories": [
      "math.LO",
      "cs.CL",
      "cs.FL",
      "cs.LO"
    ],
    "authors": [
      "Daniel Quigley"
    ],
    "title": "A vector logic for intensional formal semantics",
    "abstract": "Formal semantics and distributional semantics are distinct approaches to linguistic meaning: the former models meaning as reference via model-theoretic structures; the latter represents meaning as vectors in high-dimensional spaces shaped by usage. This paper proves that these frameworks are structurally compatible for intensional semantics. We establish that Kripke-style intensional models embed injectively into vector spaces, with semantic functions lifting to (multi)linear maps that preserve composition. The construction accommodates multiple index sorts (worlds, times, locations) via a compound index space, representing intensions as linear operators. Modal operators are derived algebraically: accessibility relations become linear operators, and modal conditions reduce to threshold checks on accumulated values. For uncountable index domains, we develop a measure-theoretic generalization in which necessity becomes truth almost everywhere and possibility becomes truth on a set of positive measure, a non-classical logic natural for continuous parameters.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02938v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Daniele Giannetto"
    ],
    "title": "A Correspondence between Billiards and Geodesics",
    "abstract": "From a geometric viewpoint, billiard trajectories and geodesics are related by mutual approximation results. In one direction, it is known that every geodesic curve in the boundary of a smooth convex body can be approximated by a sequence of billiard trajectories inside of it. We establish the other direction by proving that, for Riemannian billiard tables (under mild assumptions), there exists a family of fold-type surfaces such that every sequence of geodesic segments on these surfaces has a subsequence that converges to a billiard trajectory in the table. In particular, this is true for convex Euclidean tables. We also describe a more general class of tables to which this result applies and present explicit non-Euclidean examples.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02889v1",
    "categories": [
      "math.CO",
      "math.MG",
      "math.PR"
    ],
    "authors": [
      "Balázs Maga"
    ],
    "title": "Chebyshev centers and radius of the set of permutons",
    "abstract": "We study the metric geometry of the set of permutons under the rectangular distance $d_{\\square}$. We determine the Chebyshev radius to be 1/4 and characterize all Chebyshev centers: a permuton is a center if and only if it is 1/2- periodic in each coordinate. We also describe permutons that attain the extremal distance 1/4 from a given center.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02761v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Hangsheng Chen"
    ],
    "title": "Existence for Stable Rotating Star-Planet Systems",
    "abstract": "This paper investigates the existence and properties of stable, uniformly rotating star-planet systems, i.e. mass ratio is sufficiently small. It is modeled by the Euler-Poisson equations. Following the framework established by McCann for binary stars \\cite{McC06}, we adopt a variational approach, and prove the existence of local energy minimizers with respect to the Wasserstein $L^\\infty$ metric, under the assumed equation of state $P(ρ)=Kρ^γ$ and under the condition that the mass ratio $m$ is sufficiently small, corresponding to a star-planet system. Such minimizers correspond to solutions of the Euler-Poisson system. We consider two cases. For $γ> 2$, we not only prove existence but also show, via scaling arguments, that the radii (to be precise, the bounds of the supports of the minimizers) tend to zero. For $\\frac{3}{2} < γ\\leq 2$, we estimate an upper bound for the (potential) expansion rates of the radii, and it turns out that the existence result remains valid in this case as well. Finally, we provide estimates for the distances between different connected components of supports of minimizers and propose a conjecture regarding the number of connected components.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03206v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Tomas Chamberlain",
      "Marten Wortel"
    ],
    "title": "The Riesz-Kantorovich formulas for $\\mathbb{L}$-vector lattices",
    "abstract": "Let $\\mathbb{L}$ be a Dedekind complete unital $f$-algebra. We prove the Riesz-Kantorovich formulas for order bounded $\\mathbb{L}$-module homomorphisms from a directed partially ordered $\\mathbb{L}$-module with the Riesz Decomposition Property into a Dedekind complete $\\mathbb{L}$-vector lattice satisfying an additional mild condition.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03178v1",
    "categories": [
      "math.NA",
      "physics.comp-ph"
    ],
    "authors": [
      "Davit Aslanyan",
      "Constantine Sideris"
    ],
    "title": "Fully Automated Adaptive Parameter Selection for 3-D High-order Nyström Boundary Integral Equation Methods",
    "abstract": "We present an adaptive Chebyshev-based Boundary Integral Equation (CBIE) solver for electromagnetic scattering from smooth perfect electric conductor (PEC) objects. The proposed approach eliminates manual parameter tuning by introducing (i) a unified adaptive quadrature strategy for automatic selection of the near-singular interaction distance and (ii) an adaptive computation of all self- and near-singular precomputation integrals to a prescribed accuracy using Gauss-Kronrod (h-adaptive) or Clenshaw-Curtis (p-adaptive) rules and singularity-resolving changes of variables. Both h-adaptive and p-adaptive schemes are explored within this framework, ensuring high-order accuracy and robustness across a broad range of geometries without loss of efficiency. Numerical results for canonical and complex CAD geometries demonstrate that the adaptive solver achieves accuracy and convergence rates comparable to optimally tuned fixed-grid CBIE implementations, while offering automation and scalability to electrically large, geometrically complex problems.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03166v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Arun Govind Neelan"
    ],
    "title": "Event-Level Probabilistic Prediction of Extreme Rainfall over India Using Physics-Gated Latent Dynamics",
    "abstract": "Extreme rainfall over the Indian monsoon region poses severe societal and infrastructural risks but remains difficult to predict at daily time scales due to stochastic convective triggering and multiscale atmospheric interactions. While large-scale atmospheric fields provide important environmental context, their ability to localize extreme rainfall events is fundamentally limited. In this study, we examine how large-scale atmospheric information from ERA5 reanalysis can be leveraged for event-level probabilistic prediction of daily rainfall extremes over India. We compare an adaptive ConvLSTM baseline with a proposed Physics-Gated Latent Ordinary Differential Equation (PG-LODE) framework, which models atmospheric evolution as a continuous-time latent process whose dynamics are explicitly modulated by a physics-based gating mechanism under convectively unstable conditions. Extreme events are defined using the local 95th percentile of the India Meteorological Department gridded rainfall dataset during the June to September monsoon season. Pixel-wise evaluation shows limited skill for both models due to spatial displacement errors, whereas event-level tile-based verification reveals a clear performance contrast. The ConvLSTM remains highly conservative, detecting only 27 percent of extreme events, while PG-LODE achieves near-complete detection with a substantially higher critical success index and a moderate false alarm rate. These results demonstrate that physics-gated continuous-time latent dynamics offer a robust pathway for translating large-scale atmospheric predictability into reliable assessments of extreme rainfall risk.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03163v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Christian Lentz",
      "Gregory Henselman-Petrusek",
      "Lori Ziegelmeier"
    ],
    "title": "A U-match Algorithm for Persistent Relative Homology",
    "abstract": "A central problem in data-driven scientific inquiry is how to interpret structure in noisy, high-dimensional data. Topological data analysis (TDA) provides a solution via persistent homology, which encodes features of interest as topological holes within a filtration of data. The present work extends this framework to a related invariant which uncovers topological structure of a space relative to a subspace: persistent relative homology (PRH). We show that this invariant can be computed in a simple, highly transparent and general manner, using a two-step matrix reduction technique with worst-case time complexity comparable to ordinary persistent homology. We provide proofs demonstrating the correctness and computational complexity of this approach in addition to a performance-optimized implementation for a special case.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03150v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Dominique Manchon"
    ],
    "title": "Une remarque sur l'arborification de Matula",
    "abstract": "Nous esquissons une application de l'arborification de Matula à l'étude de la fonction sommatoire des fonctions de M\\\" obius et de Liouville sur les entiers naturels - We sketch an application of Matula's arborification to the study of the partial sums of both M\\\" obius and Liouville function.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03091v1",
    "categories": [
      "math.RA",
      "math.AG"
    ],
    "authors": [
      "Jingbang Guo"
    ],
    "title": "On Dual Algebras of Hopf Algebroids",
    "abstract": "We study the dual algebras of (discrete) Hopf algebroids. In particular, we understand comodules over a Hopf algebroid as (discrete) modules over its dual algebra.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03044v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yoshiki Kaiho"
    ],
    "title": "On very weak solutions of certain elliptic systems with double phase growth",
    "abstract": "In this paper, we prove a higher integrability result for very weak solutions of higher-order elliptic systems involving a double phase operator as the principal part. As a model case, we consider \\begin{equation} \\int_Ω \\left( |D^m u|^{p-2}D^m u + a(x)|D^m u|^{q-2}D^m u \\right) \\cdot D^m \\varphi = 0 \\quad \\text{for any } \\varphi \\in C_c^{\\infty}(Ω), \\end{equation} where $n,m \\in \\mathbb{N},\\ n\\ge 2,\\,1 < p \\le q < \\infty,\\,Ω\\subset \\mathbb{R}^n$ is an open set and $a:Ω\\rightarrow [0,\\infty)$ is a measurable function. The proof is based on a construction of an appropriate test function by the Lipschitz truncation technique, a deduction of a reverse Hölder inequality and an application of Gehring's lemma. Our contributions include estimates for weighted mean value polynomials and sharp Sobolev--Poincaré-type inequalities for the double phase operator. Our result can be viewed as a generalization with respect to the derivative order, the coefficient function and the growth conditions of the recent paper by Baasandorj, Byun and Kim (Trans. Amer. Math. Soc. 376:8733-8768,2023).",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03016v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Rong Chen"
    ],
    "title": "A counterexample to Hickingbotham's conjecture about $k$-ghost-edges",
    "abstract": "Fix $k\\in \\mathbb{N}$ and let $G$ be a connected graph with $tw(G)\\leq k$. We say that $xy\\in E(G^c)$ is a {\\em $k$-ghost-edge} of $G$ if for every tree decomposition $(T,\\cB)$ of $G$ with width at most $k$, the set $\\{x,y\\}$ is contained in a bag of $(T,\\cB)$. Although a $k$-ghost-edge of $G$ is not an edge of $G$, but it behaves like real edges with respect to tree decomposition of $G$ with width at most $k$. For any graph $G$ with treewidth $k$ and $xy\\in E(G^c)$, when there are at least $k+1$ internally vertex disjoint $(x,y)$-paths, Hickingbotham proved that $xy$ is a $k$-ghost-edge of $G$; while when there are at most $k$ internally vertex disjoint $(x,y)$-paths, he conjectured that it is not a $k$-ghost-edge of $G$. In this paper, we prove that this conjecture is wrong.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03408v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yuri Matiyasevich"
    ],
    "title": "In Search of Approximate Polynomial Dependencies Among the Derivatives of the Alternating Zeta Function",
    "abstract": "It is well-known that the Riemann zeta function does not satisfy any exact polynomial differential equation. Here we present numerical evidence for the existence of approximate polynomial dependencies between the values of the alternating zeta function and its initial derivatives.\n  A number of conjectures is stated.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03330v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Philip Kennerberg"
    ],
    "title": "Invariant Extremal Projections for Operator-Ordered Families",
    "abstract": "We study an extremal projection principle for families of operators ordered by domination, induced by fixed bounded linear mappings acting on a source with an additive baseline. Stability is defined through domination of second--order structure, leading to a covariance envelope of admissible sources ordered by the Löwner relation.\n  Our main result establishes an envelope extremal principle: the maximal value of the quadratic functional over the entire envelope coincides with that of a single extremal configuration, which may lie only in the closure of the admissible class. This identification is obtained without convexity, compactness, or any global Hilbert space structure governing all components of the system, and relies instead on an operator--theoretic approximation scheme.\n  As a consequence, minimax optimization over stability sets reduces to an ordinary quadratic minimization problem with well--posed existence and uniqueness properties for the associated minimizing operators. Structural properties of covariance envelopes are also derived, including density, closure, and spectral characterizations in stationary settings.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03299v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Huyuan Chen",
      "Rui Chen"
    ],
    "title": "On Poincaré-Sobolev level involving fractional GJMS operators on hyperbolic space",
    "abstract": "This paper is devoted to a qualitative analysis of the Poincaré--Sobolev level associated with the fractional GJMS operators \\(\\mathcal{P}_s\\) \\(\\bigl(s\\in(0,\\tfrac n2)\\setminus\\mathbb N\\bigr)\\) on the hyperbolic space \\(\\mathbb H^n\\). In contrast to the integer-order case, when \\(s\\notin\\mathbb N\\) the operator \\(\\mathcal{P}_s\\) does not enjoy the conformal covariance that allows one, in the upper half-space or ball model, to relate it to the Euclidean fractional Laplacian \\((-Δ)^s\\); this link is crucial for importing Euclidean theory. We therefore introduce \\(\\widetilde{\\mathcal{P}}_s\\) (\\(s>0\\)), which is conformally related to \\((-Δ)^s\\). Our purpose in the paper is to analyze the monotonicity, attainability, and strict-gap regions of the Poincaré--Sobolev levels associated with \\(\\mathcal{P}_s\\) and with \\(\\widetilde{\\mathcal{P}}_s\\) with \\(s\\in(0,\\tfrac n2)\\setminus\\mathbb N\\). First, we reinterpret the Brezis--Nirenberg problem through the lens of Poincaré--Sobolev levels, connecting earlier results for the Euclidean Laplacian and for operators \\(\\mathcal{P}_k\\) on \\(\\mathbb H^n\\) with integer \\(k\\in(0,\\tfrac n2)\\). We then establish new, explicit lower bounds for the Hardy term in fractional Hardy--Sobolev--Maz'ya inequalities involving both \\(\\mathcal{P}_s\\) and \\(\\widetilde{\\mathcal{P}}_s\\). By applying the concentration--compactness principle together with a detailed analysis of the strict-gap regions for the Poincaré--Sobolev levels, we prove the existence of solutions to the Brezis--Nirenberg problem on \\(\\mathbb H^n\\) for both operators. Finally, combining the Hardy lower bounds with criteria for attainability, we obtain a complete characterization of the Poincaré--Sobolev levels \\(H_{n,s}\\) and \\(\\widetilde H_{n,s}\\).",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03421v1",
    "categories": [
      "cs.IT",
      "cs.CR"
    ],
    "authors": [
      "Hadi Aghaee",
      "Christian Deppe",
      "Holger Boche"
    ],
    "title": "On (Im)possibility of Network Oblivious Transfer via Noisy Channels and Non-Signaling Correlations",
    "abstract": "This work investigates the fundamental limits of implementing network oblivious transfer via noisy multiple access channels and broadcast channels between honest-but-curious parties when the parties have access to general tripartite non-signaling correlations. By modeling the shared resource as an arbitrary tripartite non-signaling box, we obtain a unified perspective on both the channel behavior and the resulting correlations. Our main result demonstrates that perfect oblivious transfer is impossible. In the asymptotic regime, we further show that even negligible leakage cannot be achieved, as repeated use of the resource amplifies the receiver(s)'s ability to distinguish messages that were not intended for him/them. In contrast, the receiver(s)'s own privacy is not subject to a universal impossibility limitation.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03407v1",
    "categories": [
      "cs.IT",
      "math.CO"
    ],
    "authors": [
      "Fatih Gulec",
      "Vahid Abolghasemi"
    ],
    "title": "Universal Costas Matrices: Towards a General Framework for Costas Array Construction",
    "abstract": "Costas arrays are a special type of permutation matrices with ideal autocorrelation and low cross-correlation properties, making them valuable for radar, wireless communication, and integrated sensing and communication applications. This paper presents a novel unified framework for analyzing and discovering new Costas arrays. We introduce Universal Costas Matrices (UCMs) and Universal Costas Frequency Matrices (UCFMs) and investigate their structural characteristics. A framework integrating UCMs and UCFMs is proposed to pave the way for future artificial intelligence-assisted Costas array discovery. Leveraging the structural properties of UCMs and UCFMs, a reconstruction-based search method is developed to generate UCMs from UCFMs. Numerical results demonstrate that the proposed approach significantly accelerates the search process and enhances structural insight into Costas array generation.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03363v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kaizhe He",
      "Qi Chen"
    ],
    "title": "Entropy Functions on Two-Dimensional Faces of Polymatroid Region with One Extreme Ray Containing Rank-One Matroid",
    "abstract": "Characterization of entropy functions is of fundamental importance in information theory. By imposing constraints on their Shannon outer bound, i.e., the polymatroidal region, one obtains the faces of the region and entropy functions on them with special structures. In this paper, we characterize entropy functions on 2-dimensional faces of polymatroid region of degree n with one extreme ray containing rank-1 matroid. We classify all such 2-dimensional faces with another extreme ray containing a matroid into four types.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03348v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Shaoshuai Chu",
      "Michael Herty"
    ],
    "title": "A Comparative Study of Low-Dissipation Numerical Schemes for Hyperbolic Conservation Laws",
    "abstract": "This work provides a comparative assessment of several low-dissipation numerical schemes for hyperbolic conservation laws, highlighting their performance relative to the classical Harten-Lax-van Leer (HLL) schemes. The schemes under consideration include the classical Harten-Lax-van Leer-Contact (HLLC), the recently proposed TV flux splitting, the low-dissipation Central-Upwind (LDCU), and the local characteristic decomposition-based Central-Upwind (LCDCU) schemes. These methods are extended to higher orders of accuracy, up to the fifth order, within both finite-volume and finite-difference frameworks. A series of numerical experiments for the one- and two-dimensional Euler equations of gas dynamics are performed to evaluate the accuracy, robustness, and computational efficiency of the studied schemes. The comparison highlights the trade-offs between resolution of contact and shear waves, robustness in the presence of shocks, and computational cost. The investigated low-dissipation schemes show comparable levels of numerical dissipation, with only subtle differences appearing in selected benchmark problems. The results provide practical guidance for selecting efficient low-dissipation solvers for the simulation of complex compressible flows.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03280v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Andrea Mondino",
      "Raquel Perales"
    ],
    "title": "Gromov-Hausdorff and intrinsic flat convergence of RCD(K,N) and Kato spaces",
    "abstract": "We consider metric measure spaces $(X,\\mathsf{d},\\mathscr{H}^N)$ satisfying the properties (ETR), (LBD), and with an almost everywhere connected regular set. In particular, these assumptions are fulfilled by non-collapsed RCD$(K,N)$ spaces without boundary, as well as by non-collapsed strong Kato limit spaces without boundary. For both classes, we study orientability in the sense of metric currents, establish stability of orientation under pointed Gromov--Hausdorff convergence, and show that the pointed Gromov--Hausdorff limit coincides with the local flat limit.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03261v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Paulo Andrés Soto Moreno"
    ],
    "title": "On some NIP Fragments of Fields",
    "abstract": "In this note we study sets of NIP formulas in some theories of fields and valued fields, with a special focus on the sets of quantifier-free and existential formulas. First, we give a new proof of the fact that Separably Closed Valued Fields of any characteristic and any imperfection degree are NIP, and use this result to fill some gaps of a proof of the so-called NIP Transfer Theorem for henselian valued fields of equal characteristic. Second, we prove a variant of a theorem of Johnson: every positive characteristic valued field whose existential formulas are NIP is henselian. Finally, we set the ground for the finer question of transfer of NIP formulas of valued fields with bounded quantifier rank. Namely, we prove that for any henselian equicharacteristic valued field, any formula of quantifier rank at most $n\\geq 1$ is NIP if and only if the same is true for the residue field and the value group, provided that the valued field is separably defectless Kaplansky and conditional on a multi-variable generalization of a well known statement about indiscernible sequences of singletons in ac-valued fields.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03247v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Qianxing Jia",
      "Dong Wang"
    ],
    "title": "Physics informed learning of orthogonal features with applications in solving partial differential equations",
    "abstract": "The random feature method (RFM) constructs approximation spaces by initializing features from generic distributions, which provides universal approximation properties to solve general partial differential equations. However, such standard initializations lack awareness of the underlying physical laws and geometry, which limits approximation. In this work, we propose the Physics-Driven Orthogonal Feature Method (PD-OFM), a framework for constructing feature representations that are explicitly tailored to both the differential operator and the computational domain by pretraining features using physics-informed objectives together with orthogonality regularization. This pretraining strategy yields nearly orthogonal feature bases. We provide both theoretical and empirical evidence that physics-informed pretraining improves the approximation capability of the learned feature space. When employed to solve Helmholtz, Poisson, wave, and Navier-Stokes equations, the proposed method achieves residual errors 2-3 orders of magnitude lower than those of comparable methods. Furthermore, the orthogonality regularization improves transferability, enabling pretrained features to generalize effectively across different source terms and domain geometries for the same PDE.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03202v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "Joonhyuk Jung",
      "Chao Gao"
    ],
    "title": "Sharp Inequalities between Total Variation and Hellinger Distances for Gaussian Mixtures",
    "abstract": "We study the relation between the total variation (TV) and Hellinger distances between two Gaussian location mixtures. Our first result establishes a general upper bound: for any two mixing distributions supported on a compact set, the Hellinger distance between the two mixtures is controlled by the TV distance raised to a power $1-o(1)$, where the $o(1)$ term is of order $1/\\log\\log(1/\\mathrm{TV})$. We also construct two sequences of mixing distributions that demonstrate the sharpness of this bound. Taken together, our results resolve an open problem raised in Jia et al. (2023) and thus lead to an entropic characterization of learning Gaussian mixtures in total variation. Our inequality also yields optimal robust estimation of Gaussian mixtures in Hellinger distance, which has a direct implication for bounding the minimax regret of empirical Bayes under Huber contamination.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03194v1",
    "categories": [
      "math.CO",
      "math.RT"
    ],
    "authors": [
      "Min Huang",
      "Qiling Ma"
    ],
    "title": "A mutation invariant for skew-symmetrizable matrices",
    "abstract": "Matrix mutation of skew-symmetrizable matrices is foundational in cluster algebra theory. Effective mutation invariants are essential for determining whether two matrices lie in the same mutation class. Casals~\\cite{Casals} introduced a binary mutation invariant for skew-symmetric matrices. In this paper, we extend Casals' construction to the skew-symmetrizable setting. When the skew-symmetrizer $d_1,\\dots, d_n$ is pairwise coprime, we obtain two distinct extensions of this invariant.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03192v1",
    "categories": [
      "math-ph",
      "math.SP"
    ],
    "authors": [
      "Kenta Higuchi",
      "Ryuta Ishikawa",
      "Hisashi Morioka",
      "Etsuo Segawa",
      "Eijirou Yoshimura"
    ],
    "title": "Resonant scattering for tunable quantum walks on graphs with tails",
    "abstract": "We study the resonant scattering for discrete time quantum walks on graphs with some tails. In our arguments, we reduce the study of resonances to the perturbation of eigenvalues of a finite rank matrix associated with the internal graph. Then we can apply Kato's perturbation theory of matrices, and the reduction process of generalized eigenspaces allows us to derive an explicit asymptotic expansion of the scattering matrix. As a consequence, we obtain the resonant scattering at resonant energies.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03111v1",
    "categories": [
      "math.DG",
      "math-ph",
      "math.CV"
    ],
    "authors": [
      "Zbigniew Błocki",
      "Tamás Darvas"
    ],
    "title": "Sharp $C^{1,\\bar1}$ estimates in Kähler quantization and non-pluripolar Radon measures",
    "abstract": "Let $K_\\varphi$ denote the weighted Bergman kernel associated to a plurisubharmonic function $\\varphi$. We obtain upper bounds and positive lower bounds for the Bergman metric $i\\partial \\bar{\\partial} \\log K_\\varphi$, expressed solely in terms of upper bounds and positive lower bounds of $i\\partial \\bar{\\partial}\\varphi$. Our approach applies in both local and compact Kähler settings. As an immediate application we obtain the optimal $C^{1,α}$-convergence for the quantization of Kähler currents with bounded coefficients. We also show that any non-pluripolar Radon measure on a compact Kähler manifold admits a quantization.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03083v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Hao Hu",
      "Haijun Yu"
    ],
    "title": "Scaling Optimized Spectral Approximations on Unbounded Domains: The Generalized Hermite and Laguerre Methods",
    "abstract": "We propose a novel error analysis framework for scaled generalized Laguerre and generalized Hermite approximations.This framework can be regarded as an analogue of the Nyquist-Shannon sampling theorem: It characterizes the spatial and frequency bandwidths that can be effectively captured by Laguerre or Hermite sampling points. Provided a function satisfies the corresponding bandwidth constraints, it can be accurately approximated within this framework. The proposed framework is notably more powerful than classical theory -- it not only provides systematic guidance for choosing the optimal scaling factor, but also predicts root-exponential and other intricate convergence behaviors that classical approaches fail to capture. Leveraging this framework, we conducted a detailed comparative study of Hermite and Laguerre approximations. We find that functions with similar decay and oscillation characteristics may nonetheless display markedly different convergence rates. Furthermore, approximations based on two concatenated sets of Laguerre functions may offer significant advantages over those using a single set of Hermite functions.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03029v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Marc Carnovale",
      "Steven Senger"
    ],
    "title": "On the number of 3APs in fractal sets",
    "abstract": "We use techniques from the study of the Falconer distance conjecture to explore conditions which guarantee largeness (in terms of bounded $L^2$ density/Lebesgue measure and Hausdorff measure) of the set of lengths of step-sizes of three-term arithmetic progressions which occur within fractal sets, as well as analogous statements in discrete settings. Our main result is a version of Łaba and Pramanik's result in arxiv:0712.3882 that relies only on an assumption of a lower bound, $δ$, on the mass of the measure $μ$ together with an upper bound, $M$ on the $L^q$ norm of its Fourier transform for some $q\\in(2,3]$ depending on the parameters $δ$ and $M$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03027v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Chao Wang"
    ],
    "title": "Analytic Proof of a Quartic Continued Fraction Identity for $8/π^2$ via Operator Factorization",
    "abstract": "We present a rigorous analytic proof of a generalized continued fraction (GCF) identity for the transcendental constant $8/π^2$, a result recently conjectured via the algorithmic framework of the Ramanujan Machine. Distinct from canonical GCFs derived from classical hypergeometric series, the identity at hand features a complex polynomial architecture characterized by quartic partial numerators. Our approach utilizes an algebraic decomposition of the second-order shift operator $\\mathcal{L} = \\mathcal{T}^2 - b_n \\mathcal{T} - a_n$ into a coupled first-order system. This decomposition enables an exact mapping of the higher-order recurrence to a cascaded system, from which the continued fraction is identified as the reciprocal of an Apéry-like summation involving central binomial coefficients. The convergence is established through Pincherle's Theorem, confirming that the numerator sequence constitutes the minimal solution to the associated difference equation. This work provides a systematic operator-theoretic methodology for verifying automated conjectures of transcendental constants with high-degree polynomial coefficients.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02997v1",
    "categories": [
      "math.DG",
      "math.AP"
    ],
    "authors": [
      "Nick Edelen",
      "Luis Atzin Franco Reyna",
      "Paul Minter"
    ],
    "title": "Entire area-minimizing surfaces in R^4 are algebraic",
    "abstract": "We classify entire 2-dimensional area-minimizing or stable surfaces in R^4 with quadratic area growth as algebraic, cut out by a finite union of holomorphic polynomials whose collective degrees are controlled by the density at infinity. As a consequence, we obtain bounds on the singular set size and genus in terms of the density at infinity.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02926v1",
    "categories": [
      "math.OA",
      "math.LO"
    ],
    "authors": [
      "Lisa Orloff Clark",
      "Ryan Thompson",
      "Ilija Tolich"
    ],
    "title": "Topologically free non-Hausdorff groupoids",
    "abstract": "We study three conditions that control the behaviour of isotropy in étale groupoids, and their relationships under the additional assumptions of second-countability and Hausdorffness. We examine a number of examples that show these properties are distinct. Working under the assumption of the Zermelo-Fraenkel axioms, excluding choice, we then examine an alternate characterization of topological freeness, first introduced by Anantharaman-Delaroche, in the non-Hausdorff setting. Finally, we prove an equivalence between the Baire Category Theorem and an étale groupoid theorem, along with similar equivalences to other weakenings of the Axiom of Choice.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02876v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Boštjan Brešar",
      "Wenjie Hu",
      "Babak Samadi"
    ],
    "title": "Frugal coloring of graphs revisited",
    "abstract": "Given a graph $G$ and a positive integer $t$, an independent set $S\\subseteq V(G)$ is $t$-frugal if every vertex has at most $t$ neighbors in $S$. A $t$-frugal coloring of $G$ is a partition of its vertex set into $t$-frugal independent sets. The maximum cardinality of a $t$-frugal independent set in $G$ is denoted by $α_t^f(G)$, while the minimum cardinality of a $t$-frugal coloring of $G$, $χ_t^f(G)$, is called the $t$-frugal chromatic number of $G$. Frugal colorings were introduced in 1998 and studied later in just a handful of papers. In this paper, we revisit this concept. While the NP-hardness of frugal coloring is known, we prove that the decision version of $α_t^f$ is NP-complete even for bipartite graphs, and present a linear-time algorithm to determine its value for trees. We prove a general sharp lower bound on $χ_{t}^{f}(G)$ expressed in terms of $α_{t}^{f}(G)$ and size of $G$. We also give a sharp upper bound on the $α_2^f$ of any graph $G$, which in the case of graphs with minimum degree $δ\\geq2$ simplifies to $α_2^f(G)\\le 2n/(δ+2)$. We prove that $3\\leχ_2^f(G)\\le 5$ holds for any graph $G$ with $Δ(G)=3$. For several classes of graphs such as block graphs, the Cartesian and strong products of multiple two-way infinite paths, we determine the exact values of $α_2^f$. We provide sharp bounds on the $α_2^f$ in all four standard graph products, which are expressed as different invariants of their factors. Finally, we obtain Nordhaus-Gaddum type inequalities for the sum of the $2$-frugal chromatic numbers of $G$ and its complement from below and from above by functions of the order of $G$. For the upper bound $χ_{2}^{f}(G)+χ_{2}^{f}(\\overline{G})\\leq 3n/2$, we characterize the family of extremal graphs $G$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02837v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Lev Dvorkin"
    ],
    "title": "Monotonicity versus positivity in modal logics",
    "abstract": "We say that a logic L has the Lyndon positivity property (LPP) if all formulas which are monotone in L (that is, are preserved under increasing the valuation on L-algebras) are L-equivalent to positive formulas (formulas without negation and implication symbols). In the present paper, we investigate LPP in propositional monotone modal logics. First, we transfer Lyndon's result from classical predicate calculus and prove LPP for all normal modal logics with the Lyndon interpolation property (LIP). Then we prove that all logics between K4.3 and S4.3 do not have LPP. We also show that among tabular extensions of S4 there are infinitely many logics with LPP and infinitely many logics without this property. Finally, we prove that all canonical monotone modal logics which are preserved under bisimulation products have both LIP and LPP. In particular, we show LIP and LPP for all logics that are axiomatizable over the minimal monotone logic EM by means of closed formulas and formulas of the form A(p) -> <>p, where A is positive.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02826v1",
    "categories": [
      "math.OC",
      "cs.RO"
    ],
    "authors": [
      "Louis Callens",
      "Bastiaan Vandewal",
      "Ibrahim Ibrahim",
      "Jan Swevers",
      "Wilm Decré"
    ],
    "title": "Fast Near Time-Optimal Motion Planning for Holonomic Vehicles in Structured Environments",
    "abstract": "This paper proposes a novel and efficient optimization-based method for generating near time-optimal trajectories for holonomic vehicles navigating through complex but structured environments. The approach aims to solve the problem of motion planning for planar motion systems using magnetic levitation that can be used in assembly lines, automated laboratories or clean-rooms. In these applications, time-optimal trajectories that can be computed in real-time are required to increase productivity and allow the vehicles to be reactive if needed. The presented approach encodes the environment representation using free-space corridors and represents the motion of the vehicle through such a corridor using a motion primitive. These primitives are selected heuristically and define the trajectory with a limited number of degrees of freedom, which are determined in an optimization problem. As a result, the method achieves significantly lower computation times compared to the state-of-the-art, most notably solving a full Optimal Control Problem (OCP), OMG-tools or VP-STO without significantly compromising optimality within a fixed corridor sequence. The approach is benchmarked extensively in simulation and is validated on a real-world Beckhoff XPlanar system",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02818v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Adrian Muntean",
      "Giulia Rui"
    ],
    "title": "Lack of uniqueness for an elliptic equation with nonlinear and nonlocal drift posed on a torus",
    "abstract": "We study a nonlinear and nonlocal elliptic equation posed on the flat torus. While constant solutions always exist, we show that uniqueness fails in general. Using spectral analysis and the Crandall--Rabinowitz bifurcation theorem, we prove the existence of branches of non-constant periodic solutions bifurcating from constant states. This result is qualitative and non-constructive. Using a conceptually different argument, we construct explicit multiple solutions for a specific one--dimensional formulation of our target problem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02814v1",
    "categories": [
      "math.OC",
      "cs.RO",
      "eess.SY"
    ],
    "authors": [
      "Berk Bozkurt",
      "Aditya Mahajan",
      "Ashutosh Nayyar",
      "Yi Ouyang"
    ],
    "title": "Sub-optimality bounds for certainty equivalent policies in partially observed systems",
    "abstract": "In this paper, we present a generalization of the certainty equivalence principle of stochastic control. One interpretation of the classical certainty equivalence principle for linear systems with output feedback and quadratic costs is as follows: the optimal action at each time is obtained by evaluating the optimal state-feedback policy of the stochastic linear system at the minimum mean square error (MMSE) estimate of the state. Motivated by this interpretation, we consider certainty equivalent policies for general (non-linear) partially observed stochastic systems that allow for any state estimate rather than restricting to MMSE estimates. In such settings, the certainty equivalent policy is not optimal. For models where the cost and the dynamics are smooth in an appropriate sense, we derive upper bounds on the sub-optimality of certainty equivalent policies. We present several examples to illustrate the results.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02800v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Suhan Liu",
      "Mo Liu"
    ],
    "title": "Decision-Focused Optimal Transport",
    "abstract": "We propose a fundamental metric for measuring the distance between two distributions. This metric, referred to as the decision-focused (DF) divergence, is tailored to stochastic linear optimization problems in which the objective coefficients are random and may follow two distinct distributions. Traditional metrics such as KL divergence and Wasserstein distance are not well-suited for quantifying the resulting cost discrepancy, because changes in the coefficient distribution do not necessarily change the optimizer of the underlying linear program. Instead, the impact on the objective value depends on how the two distributions are coupled (aligned). Motivated by optimal transport, we introduce decision-focused distances under several settings, including the optimistic DF distance, the robust DF distance, and their entropy-regularized variants. We establish connections between the proposed DF distance and classical distributional metrics. For the calculation of the DF distance, we develop efficient computational methods. We further derive sample complexity guarantees for estimating these distances and show that the DF distance estimation avoids the curse of dimensionality that arises in Wasserstein distance estimation. The proposed DF distance provides a foundation for a broad range of applications. As an illustrative example, we study the interpolation between two distributions. Numerical studies, including a toy newsvendor problem and a real-world medical testing dataset, demonstrate the practical value of the proposed DF distance.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02779v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Koji Koyamada"
    ],
    "title": "Comparison of Trefftz-Based PINNs and Standard PINNs Focusing on Structure Preservation",
    "abstract": "In this study, we investigate the capability of physics-informed neural networks (PINNs) to preserve global physical structures by comparing standard PINNs with a Trefftz-based PINN (Trefftz-PINN). The target problem is the reproduction of mag-netic field-line structures in a helical fusion reactor configuration. Using identical training data sampled from exact solutions, we perform comparisons under matched mean squared error (MSE) levels. Visualization of magnetic field lines reveals that standard PINNs may exhibit structural collapse across magnetic surfaces even when the MSE is sufficiently small, whereas Trefftz-PINNs successfully preserve the global topology of magnetic field lines. Furthermore, the proposed framework is extended to computational fluid dynamics (CFD) problems, where streamline structures of veloc-ity fields are analyzed. Similar tendencies are observed, demonstrating that Trefftz-PINNs provide superior structure preservation compared to standard PINNs. These results indicate that minimizing numerical error alone does not guarantee physical consistency, and that constraining the solution space prior to learning is an effective strategy for physics-consistent surrogate modeling.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02768v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ronald Ogden",
      "David Fridovich-Keil",
      "Takashi Tanaka"
    ],
    "title": "Rate-Distortion Analysis of Optically Passive Vision Compression",
    "abstract": "The use of remote vision sensors for autonomous decision-making poses the challenge of transmitting high-volume visual data over resource-constrained channels in real-time. In robotics and control applications, many systems can quickly destabilize, which can exacerbate the issue by necessitating higher sampling frequencies. This work proposes a novel sensing paradigm in which an event camera observes the optically generated cosine transform of a visual scene, enabling high-speed, computation-free video compression inspired by modern video codecs. In this study, we simulate this optically passive vision compression (OPVC) scheme and compare its rate-distortion performance to that of a standalone event camera (SAEC). We find that the rate-distortion performance of the OPVC scheme surpasses that of the SAEC and that this performance gap increases as the spatial resolution of the event camera increases.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02715v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Istvan Kadar",
      "Warren Li"
    ],
    "title": "Scattering and stability for ODE-type blow-up surfaces for focusing nonlinear wave equations",
    "abstract": "We study the focusing power nonlinear wave equation with any power, in Minkowski space of any spacetime dimension. We present a complete understanding of the local stability and scattering theory (both in high regularity spaces) for solutions exhibiting ODE type blow-up on spacelike hypersurfaces, with the blow-up at each point modelled by the explicit solution $φ_{\\mathrm{model}} = c_p t^{-α_p}$.\n  Given a sufficiently regular spacelike hypersurface $Σ_f$, together with auxiliary scattering data $ψ$, we construct the unique corresponding solution to the nonlinear wave equation that (locally) forms an ODE type singularity on $Σ_f$ attaining $ψ$ as scattering data. Conversely, we show that such ODE type singularities are (locally) stable to suitably regular perturbations away from the singularity, and that the blow-up surface and scattering data remain regular, in a continuously dependent manner, following such perturbations.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02642v1",
    "categories": [
      "math.GT",
      "math.CO",
      "math.SG"
    ],
    "authors": [
      "Paul Leon Itzlinger"
    ],
    "title": "Grid Diagrams of Fibered Knots",
    "abstract": "Grid diagrams are special representations of knots in the three-sphere that are used to define a combinatorial version of knot Floer homology. Paolo Ghiggini and Yi Ni showed that knot Floer homology detects fibered knots. Their results imply, in particular, that grid diagrams with a unique grid state whose Alexander grading is maximal only exist for fibered knots. Whether every fibered knot admits such a diagram remains an open question. Here, we investigate the existence of such special grid diagrams for fibered knots. We develop an efficient method for deciding whether a given grid diagram meets the even stricter condition of having a unique grid state that realizes an upper bound for the Alexander function. By implementing this method in a Python package, we find suitable grid diagrams for 5385 of the 5397 fibered prime knots with crossing number at most 13.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03399v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Yuk-Kam Lau",
      "Jing Ma"
    ],
    "title": "Möbius Disjointness Conjecture for a skew product on a circle and the Heisenberg nilmanifold",
    "abstract": "We establish Sarnak's conjecture on Möbius disjointness for the dynamical system of a skew product on a circle and the three-dimensional Heisenberg nilmanifold, first studied by Wen Huang, Jianya Liu and Ke Wang. We advance the work of Huang, Liu, Wang, and their followers to a broad generality by removing the previously imposed restrictive symmetry condition.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03341v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ming Li",
      "Linyu Peng",
      "Ping Zhang",
      "Xin Zhang"
    ],
    "title": "Local profiles of self-similar solutions of the planar stationary Navier--Stokes equations",
    "abstract": "In this paper, we revisit self-similar solutions of the two-dimensional stationary incompressible Navier-Stokes equations under scaling symmetries, also known as Jeffery-Hamel solutions. We investigate the local patterns of smooth Jeffery-Hamel solutions in a conical subdomain $Ω$ with vertex at the origin, without imposing any boundary conditions on $Ω$. For radial Jeffery-Hamel solutions, we obtain all the explicit local profiles in $Ω$ with arbitrary opening angles. In the non-radial case, we show that some Jeffery-Hamel solutions can be obtained via solving a Liénard equation, and we derive new explicit local profiles expressible in terms of Weierstrass elliptic functions.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03254v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Ilmari Kangasniemi",
      "Jani Onninen",
      "Yizhe Zhu"
    ],
    "title": "Values of finite distortion: Reshetnyak's theorem and the Lusin (N) -property",
    "abstract": "Let $Ω\\subset \\mathbb{R}^n$ be a domain and $f \\in W^{1,n}_{\\text{loc}} (Ω,\\mathbb{R}^n) $. We say that $f$ has a value of finite distortion at $y_0 \\in \\mathbb{R}^n$ if there exist measurable functions $K \\colon Ω\\to [0,\\infty) $ and $Σ\\in L^1_{\\text{loc}} (Ω)$ such that \\[\n  \\lvert Df(x)\\rvert^n \\le K(x) \\det Df (x) + Σ(x) \\lvert f(x)-y_0 \\rvert^n\n  \\quad \\text{for a.e. } x \\in Ω. \\] This notion unifies the classical theory of mappings of finite distortion with the recently introduced theory of quasiregular values.\n  We establish a single-value analogue of Reshetnyak's theorem in this setting. Specifically, if $f$ is nonconstant and has a value of finite distortion at $y_0$, with $K \\in L^p_{\\text{loc}}(Ω) $, $Σ/K \\in L^q_{\\text{loc}}(Ω)$, $p>n-1$, and $p^{-1}+q^{-1}<1$, then the preimage $f^{-1}\\{y_0\\}$ is discrete, the local topological index is positive at every point of $f^{-1}\\{y_0\\}$, and every neighborhood of a point in $f^{-1}\\{y_0\\}$ is mapped onto a neighborhood of $y_0$. We also prove that mappings satisfying a more general distortion inequality with defect preserve sets of Lebesgue measure zero.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03239v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Wenli Wang",
      "Duo Liu",
      "Gangrong Qu",
      "Michiel E. Hochstenbach"
    ],
    "title": "Deterministic and randomized Kaczmarz methods for $AXB=C$ with applications to color image restoration",
    "abstract": "We study Kaczmarz type methods to solve consistent linear matrix equations. We first present a block Kaczmarz (BK) method that employs a deterministic cyclic row selection strategy. Assuming that the associated coefficient matrix has full column or row rank, we derive matrix formulas for a cycle of this BK method. Moreover, we propose a greedy randomized block Kaczmarz (GRBK) method and further extend it to a relaxed variant (RGRBK) and a deterministic counterpart (MWRBK). We establish the convergence properties of the proposed methods. Numerical tests verify the theoretical findings, and we apply the proposed methods to color image restoration problems.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03191v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yingfang Zhang",
      "Xuexiu Zhong",
      "Wenming Zou"
    ],
    "title": "Bivariate Hardy-Sobolev Inequality and Its Sharp Stability",
    "abstract": "This paper establishes a bivariate Hardy-Sobolev inequality. Let $Ω\\subset \\mathbb{R}^N$ ($N \\geq 3$) be an open domain, $s \\in (0,2)$, $α> 1$, $β> 1$ with $α+ β= 2^*(s)$, and $κ\\in \\mathbb{R}$. For any functions $u, v \\in D_0^{1,2}(Ω)$, we prove the inequality:\n  \\begin{multline*}\n  \\int_Ω |\\nabla u|^2 \\, \\mathrm{d}x + \\int_Ω |\\nabla v|^2 \\, \\mathrm{d}x\n  \\ge S_{α,β,λ,μ}(Ω) \\left( \\int_Ω \\Big( λ\\frac{|u|^{2^*(s)}}{|x|^s} + μ\\frac{|v|^{2^*(s)}}{|x|^s} + 2^*(s) κ\\frac{|u|^α|v|^β}{|x|^s} \\Big)\\, \\mathrm{d}x \\right)^{\\frac{2}{2^*(s)}}.\n  \\end{multline*}\n  We derive the best constant $S_{α,β,λ,μ}(Ω)$ and characterize the set of minimizers. Moreover, for $Ω= \\mathbb{R}^N$ and $κ> 0$, we obtain sharp stability results for nonnegative functions.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03179v1",
    "categories": [
      "math.AC",
      "math.AG",
      "math.CA",
      "math.CV"
    ],
    "authors": [
      "Shijie Bao",
      "Qi'an Guan",
      "Zhitong Mi",
      "Zheng Yuan"
    ],
    "title": "An algebraic approach to the existence of valuative interpolation",
    "abstract": "An algebraic approach is presented for the valuative interpolation problem, which recovers and generalizes prior characterizations known in the complex analytic setting by the authors. We use the asymptotic Samuel function to give the characterization of the existence of valuative interpolation. We also give a characterization of the existence in the infinite valuative interpolation problem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03162v1",
    "categories": [
      "math.CO",
      "math.MG",
      "math.NT"
    ],
    "authors": [
      "Antonio Bonelli"
    ],
    "title": "The Simplicial Geometry of Integer Partitions: An Exact $O(1)$ Formula via $A_{k-1}$ Root Systems",
    "abstract": "We present a structural resolution to the exact evaluation of the partition function $p_k(n)$, addressing the limitations of traditional recursive and asymptotic methods. By introducing the Simplicial Successive Decomposition (SSD) framework, we demonstrate that the partition polytope $\\mathcal{P}_{n,k}$ is not an arbitrary geometric object, but admits a rigid minimal unimodular triangulation into exactly $N_k = \\binom{k}{2}$ simplices. This cardinality is determined by the positive root system of the $A_{k-1}$ Weyl chamber.We decompose Euler's generating function into a finite sum of simplicial rational transforms. By applying Brion's localization theorem and the negative binomial expansion, we derive an exact closed-form formula with $O(1)$ computational complexity. The validity of the model is confirmed through Ehrhart-Macdonald reciprocity, ensuring accuracy in the \"Core Collapse\" regime where the polytope's interior is empty and continuous volume approximations are inapplicable.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03131v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Renjun Duan",
      "Fengqiang Shi",
      "Wendong Wang",
      "Jianbo Yu"
    ],
    "title": "Existence and partial regularity of suitable weak solutions to the 3D Navier-Stokes-Vlasov-Fokker-Planck equations",
    "abstract": "In this paper, we investigate the incompressible Navier-Stokes equations coupled with the Vlasov-Fokker-Planck equation, which describes a two-phase mixture of the viscous incompressible fluid with particles or bubbles through a frictional force term. In the three-dimensional whole space, we construct a new class of suitable weak solutions to the Navier-Stokes-Vlasov-Fokker-Planck system satisfying energy estimates and three local or global energy inequalities of different forms. These obtained local energy inequalities play an important role in characterizing the measure of the singularity set of weak solutions. The main difficulties in deriving these inequalities lie in establishing the convergence of the density function $f$ in bounded or unbounded domains and dealing with the convergence of the non-local frictional force term. The strong convergence of both $f$ and $f \\log f$ weighted by $|v|^k$ is proved by exploring some new a priori quantities of the velocity with the help of Tao's $L^p$ decomposition and the DiPerna-Lions compactness method. Moreover, as an immediate consequence of the existence result, we are able to describe the Hausdorff dimension of set of singular points of the fluid velocity $u$ and also establish the $α$-Hölder continuity of $f$ at the regular points of $u$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03106v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Hsiao-Tzu Tsai",
      "Chih-Chung Liu"
    ],
    "title": "Regulated $L^2$ Norm on Certain Wild Higgs Bundles Over $\\mathbb{CP}^1$",
    "abstract": "We define and analyse certain $L^2$ norm on moduli space of Higgs bundles over $\\mathbb{CP}^1$ with certain singularity. We prove that certain limit of our metrics here is the regulated $L^2$ norm proposed on the central fiber, first appearing in Fredrickson-Neitzke's work.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03047v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "math.PR"
    ],
    "authors": [
      "Sung-Soo Byun",
      "Peter J. Forrester",
      "Satya N. Majumdar",
      "Gregory Schehr"
    ],
    "title": "Equilibrium measures for higher dimensional rotationally symmetric Riesz gases",
    "abstract": "We study equilibrium measures for Riesz gases in dimension $d$ with pairwise interaction kernel $|x-y|^{-s}$, subject to radially symmetric external fields. We characterise broad classes of confining potentials for which the equilibrium measure is supported on the unit ball and admits an explicit density. Our main contribution is a converse construction: starting from a prescribed radially symmetric equilibrium density given as a power series in the squared radius, we determine the associated external potential and establish the corresponding Euler-Lagrange variational conditions. A key ingredient in the proof is an identity between two ${}_3F_2$ hypergeometric functions evaluated at unit argument, which is of independent interest. As applications, we identify the external potentials corresponding to equilibrium densities proportional to $(1-|x|^2)^α$, $α>-1$, and show that these potentials can be expressed in terms of Gauss hypergeometric functions ${}_2F_1$, reducing to polynomials for special values of $α$. We also determine the equilibrium measure associated with purely power-type external potentials, often referred to as Freud or Mittag--Leffler potentials in the context of log gases, for which the equilibrium density admits an explicit ${}_2F_1$ representation. Furthermore, we apply our framework to a Coulomb gas in dimension $d+1$ confined by a harmonic potential to the half-space. We derive a necessary condition under which the equilibrium measure is fully supported on the boundary hyperplane of dimension $d$, with the induced density corresponding to that of a Riesz gas with exponent $s=d-1$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03021v1",
    "categories": [
      "math.KT",
      "math.AG",
      "math.AT"
    ],
    "authors": [
      "Brian Shin"
    ],
    "title": "Norms and Hermitian $\\mathrm{K}$-Theory",
    "abstract": "Over the past century, cohomology operations have played a crucial role in homotopy theory and its applications. A powerful framework for constructing such operations is the theory of commutative algebras in spectra. In this article, we discuss an algebro-geometric analogue of this framework, called the theory of normed algebras in motivic spectra. Specifically, we show that the motivic spectrum $\\mathrm{ko}$ representing very effective hermitian $\\mathrm{K}$-theory can be equipped with a normed algebra structure, and that the orientation map $\\mathrm{MSL} \\to \\mathrm{ko}$ respects this structure. The main step will be showing that the motivic infinite loop space machine is compatible with norms.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02935v1",
    "categories": [
      "math.AG",
      "math.RA",
      "math.RT"
    ],
    "authors": [
      "Vlad Roman"
    ],
    "title": "Commuting varieties in bad characteristic",
    "abstract": "Let $k$ be an algebraically closed field of characteristic $2$. We consider the commuting variety and the commuting nilpotent variety of the Lie algebra $\\mathfrak{sp}_{2n}$, namely the sets $\\mathcal{C}_2(\\mathfrak{sp}_{2n})=\\{ (x,y) \\in \\mathfrak{sp}_{2n} \\times \\mathfrak{sp}_{2n} \\mid [x,y]=0\\}$ and $\\mathcal{C}_2^{\\text{nil}}(\\mathfrak{sp}_{2n})=\\{ (x,y) \\in \\mathfrak{sp}_{2n} \\times \\mathfrak{sp}_{2n} \\mid x,y \\text{ nilpotent, } [x,y]=0\\}$ and prove that they are both irreducible, of dimensions $\\dim(\\mathfrak{sp}_{2n}) + 2n$ and $\\dim(\\mathfrak{sp}_{2n}) + n-1$, respectively.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02921v1",
    "categories": [
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "G. Ramesh"
    ],
    "title": "The Weyl-von Neumann theorem for antilinear skew-self-adjoint operators",
    "abstract": "In this article, we prove the Weyl-von Neumann theorem for antilinear skew-self-adjoint operators. More specifically, we prove the following:\n  Let $A$ be an antilinear skew-self-adjoint operator on a separable Hilbert space $H$ whose kernel is either even dimensional or infinite dimensional. Let $1<p<\\infty$. Then for every $ε>0$ there exists an antilinear skew block diagonal operator $D$ and an antilinear Schatten $p$-class operator $K$ such that $A=K+D$ with $\\|K\\|_{p}<ε$.\n  As a consequence of this, we prove the Weyl-von Neumann theorem for complex skew-symmetric operators:\n  Let $τ$ be a conjugation on $H$ and let $T$ be a $τ$-skew-symmetric bounded linear operator with $\\dim N(T)=\\infty$ or $\\dim N(T)$ is even. Let $1<p<\\infty$. Then for every $ε>0$, there exists a $τ$-skew-symmetric Schatten $p$-class operator $K$, a skew-symmetric block diagonal operator $D$ and a unitary operator $U$ such that $T=K+UDU^{tr}$ and $\\|K\\|_{p}<ε$, where $U^{tr}$ is the transpose of $U$ with respect to an orthonormal basis ${\\{e_n:n\\in \\mathbb N}\\}$ such that $τ(e_n)=e_n$ for each $n\\in \\mathbb N$.\n  Furthermore, the above result holds even without any assumption on the dimension of $N(T)$, provided that $N(T)=N(T^*)$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02856v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Tanner J. Reese",
      "Sunder Sethuraman"
    ],
    "title": "Crystal Growth on Locally Finite Partially Ordered Sets",
    "abstract": "We consider a Markovian growth process on a partially ordered set $Λ$, equivalent to last passage percolation (LPP) with independent (not necessarily identical) exponentially distributed weights on the elements of $Λ$. Such a process includes inhomogeneous exponential LPP on the Euclidean lattice $\\mathbb{N}_0^d$. We give non-asymptotic bounds on the mean and variance, as well as higher, central, and exponential moments of the passage time $τ_A$ to grow any set $A \\subseteq Λ$ in terms of characteristics of $A$. We also give a limit shape theorem when $Λ$ is equipped with a monoid structure. Methods involve making use of the backward equation associated to the Markovian evolution and comparison inequalities with respect to the time-reversed generator.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02764v1",
    "categories": [
      "math.FA",
      "math.GR"
    ],
    "authors": [
      "Jared T. White"
    ],
    "title": "Radicals of Biduals of Beurling Algebras Can Be Different for the Two Arens Products",
    "abstract": "Let $\\operatorname{rad}$ denote the Jacobson radical of a Banach algebra, and let $\\Box$ and $\\Diamond$ denote the two Arens products on its bidual. We give an example of a Beurling algebra $\\mathcal{A}$ for which $\\operatorname{rad}(\\mathcal{A}^{**}, \\Box) \\neq \\operatorname{rad}(\\mathcal{A}^{**}, \\Diamond)$, answering a question of Dales and Lau. The underlying group in our example is the free group on three generators.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02668v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Taylor Brysiewicz",
      "Fulvio Gesmundo"
    ],
    "title": "Marvelous slices of orthogonal matrices",
    "abstract": "The space of $4 \\times 4$ special orthogonal matrices with zeros on the diagonal decomposes into the union of $14$ irreducible surfaces whose intersections are beautifully encoded by the cuboctahedron. Using this decomposition, we exhibit a totally real witness set for $SO(4)$. We explain how to obtain a similar decomposition for $SO(5)$, where the $64$ components can be grouped to obtain such a correspondence with the face lattice of a $3$-polytope. We show that no such pattern exists for $SO(6)$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02631v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Hangsheng Chen"
    ],
    "title": "Revisiting Non-Rotating Star Models: Classical Existence and Uniqueness Theory and Scaling Relations",
    "abstract": "This paper presents a systematic study of the properties of non-rotating stellar models governed by the Euler-Poisson system under general equations of state, including the case of polytropic gaseous stars. We revisit and extend existence results by Auchmuty and Beals \\cite{AB71}, adapt the uniqueness results from the quantum mechanical framework of Lieb and Yau \\cite{LY87} to the classical Newtonian mechanical setting. The results are also synthesized in McCann \\cite{McC06} but without proof. The second work we do is applying a scaling method to establish relations between solutions with different total masses. As the mass tends to zero, we analyze convergence properties of the density functions and identify precise rates for the contraction or extension of their supports.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03391v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Noam Greenberg",
      "Gian Marco Osso"
    ],
    "title": "Forcing and classes of $\\mathsf{HYP}$-dominating functions",
    "abstract": "This paper is aimed at showing separations between three subsets of $ω^ω$, namely $\\mathsf{HYP}\\text{-}\\mathsf{SNE}$, $\\mathsf{HYP}\\text{-}\\mathsf{SME}$, and $\\mathsf{HYP}\\text{-}\\mathsf{DOM}$. These classes are natural computational analogues of cardinal characteristics from Cichon's diagram and are known to satisfy $\\mathsf{HYP}\\text{-}\\mathsf{SNE} \\subseteq \\mathsf{HYP}\\text{-}\\mathsf{SME} \\subseteq \\mathsf{HYP}\\text{-}\\mathsf{DOM}$. To show that both of these inclusions are strict we introduce effectivizations of Laver and Hechler forcing, which we believe are of independent interest. Our techniques allow us to show similar results relative to any Turing ideal closed under $\\leq_{\\mathsf{HYP}}$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03385v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Federico Tufo"
    ],
    "title": "On the Fano dimension of an Enriques surface",
    "abstract": "We construct a family of Fano fourfolds with the derived category of coherent sheaves of a general Enriques surface as semiorthogonal component. This improves a result of Kuznetsov, lowering the Fano dimension of a general Enriques surface from six to four.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03356v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Amine Hadjar"
    ],
    "title": "On characteristic foliations of metric contact-symplectic structures",
    "abstract": "We study compatible and associated metrics for a contact-symplectic pair $(η, ω)$ on a manifold. We show that the integral curves of the Reeb vector field are geodesics for any compatible metric. We prove that all associated metrics share a common volume element, which we give explicitly. When the characteristic foliations of $η$ and $ω$ are orthogonal with respect to an associated metric, their leaves, as well as those of the characteristic foliation of $dη$, are minimal. We construct explicit examples on nilpotent Lie groups and nilmanifolds where the characteristic foliations are not both totally geodesic.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03241v1",
    "categories": [
      "math.DG",
      "math.AP",
      "math.CV"
    ],
    "authors": [
      "Jeffrey S. Case",
      "Yuya Takeuchi"
    ],
    "title": "Non-homothetic complete periodic contact forms with constant Tanaka--Webster scalar curvature",
    "abstract": "We study the existence problem for complete contact forms with constant Tanaka--Webster scalar curvature on non-compact strictly pseudoconvex CR manifolds. We prove that, under mild assumptions, the universal cover of a compact strictly pseudoconvex CR manifold admits infinitely many non-homothetic such contact forms whenever its fundamental group has infinite profinite completion. As applications, we treat complements of real or complex spheres in the standard CR sphere, as well as circle bundles over compact Kähler manifolds and the boundary of a Reinhardt domain.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03149v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Ross Street"
    ],
    "title": "Homodular pseudofunctors and bicategories of modules",
    "abstract": "The universal property for the Bénabou bicategory of distributors (although we call them \"modules\") presented here is somewhat implicitly spread over a series of papers and yet, to my knowledge, does not appear in print. The inclusion of a bicategory $\\CW$ into the bicategory $\\CW\\text{-}\\mathrm{Mod}$ of $\\CW$-enriched categories and modules between them does have a completion property with respect to freely adjoining lax colimits (collages); see \\cite{85, CKW}. Here we are interested in the universal property of the construction of $\\CW\\text{-}\\mathrm{Mod}$ from $\\CW\\text{-}\\mathrm{Cat}$. What we have in mind is an objective version of the notion of {\\em homological functor} used by André Joyal in 1985.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03136v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Enric Florit-Simon"
    ],
    "title": "Phase transitions with bounded index: Parallels to De Giorgi's conjecture",
    "abstract": "A well-known conjecture of De Giorgi -- motivated by analogy with the Bernstein problem for minimal surfaces -- asserts the rigidity of monotone solutions to the Allen--Cahn equation in $\\mathbb{R}^{d+1}$, with $d\\leq 7$.\n  We establish close parallels to De Giorgi's conjecture for general solutions of bounded Morse index, far stronger than the minimal surface analogy would suggest: Namely, any finite index solution to the Allen--Cahn equation with bounded energy density in $\\mathbb{R}^4$ is one-dimensional, and -- conditionally on the classification of stable solutions -- the same holds for all $4\\leq n \\leq 7$.\n  As a geometric application, phase transitions with bounded energy and index in closed four-manifolds have smooth transition layers which behave like minimal hypersurfaces.\n  Consequently, phase transitions exhibit a remarkably rigid behaviour in higher dimensions. This is in stark contrast with the 3D case, in which a wealth of nontrivial entire solutions with finite index (and energy density) is conversely known to exist, by work pioneered by Del Pino--Kowalczyk--Wei. The authors conjectured that any such solution must have parallel ends which are either planar or catenoidal, suggesting it as a parallel to De Giorgi's conjecture in this framework. We confirm this picture under the bounded energy density assumption.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03133v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Maxim V. Podkorytov"
    ],
    "title": "Associative Rota--Baxter operators on the Sweedler algebra $H_4$",
    "abstract": "In this paper, we classify all Rota--Baxter operators on the Sweedler algebra $H_4$ up to conjugation and dualization. Modulo algebra (anti)automorphisms of $H_4$, we first describe its subalgebras and then analyse the kernel of a Rota--Baxter operator. The classification is carried out according to the dimension of this kernel, yielding a complete description of such operators. A complete list of operators is given in the theorem of the final section.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03074v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Xi Zhong",
      "Jörg Kliewer",
      "Mingyue Ji"
    ],
    "title": "Straggler-Aware Coded Polynomial Aggregation",
    "abstract": "Coded polynomial aggregation (CPA) in distributed computing systems enables the master to directly recover a weighted aggregation of polynomial computations without individually decoding each term, thereby reducing the number of required worker responses. However, existing CPA schemes are restricted to an idealized setting in which the system cannot tolerate stragglers. In this paper, we extend CPA to straggler-aware distributed computing systems with a pre-specified non-straggler pattern, where exact recovery is required for a given collection of admissible non-straggler sets. Our main results show that exact recovery of the desired aggregation is achievable with fewer worker responses than that required by polynomial codes based on individual decoding, and that feasibility is characterized by the intersection structure of the non-straggler patterns. In particular, we establish necessary and sufficient conditions for exact recovery in straggler-aware CPA. We identify an intersection-size threshold that is sufficient to guarantee exact recovery. When the number of admissible non-straggler sets is sufficiently large, we further show that this threshold is necessary in a generic sense. We also provide an explicit construction of feasible CPA schemes whenever the intersection size exceeds the derived threshold. Finally, simulations verify our theoretical results by demonstrating a sharp feasibility transition at the predicted intersection threshold.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03063v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Matthew Dominique Mitchell"
    ],
    "title": "The Small Dispersion Limit of the Intermediate Long Wave Equation via Semiclassical Soliton Ensembles",
    "abstract": "We study the small dispersion limit of the intermediate long wave (ILW) equation, specifically on a class of well-behaved initial conditions $u_0$ where the number of solitons in the solution increases without bound. First, we conduct a formal WKB-style analysis on the ILW direct scattering problem, generating approximate eigenvalues and norming constants. We then use this to define a modified set of scattering data and rigorously analyze the associated inverse scattering problem. The main results include demonstrating $L^2$-convergence of the solution at $t = 0$ to the original initial condition $u_0$ and for $0 < t < t_\\mathrm{c}$ to the associated solution of invicid Burgers' equation, where $t_\\mathrm{c}$ is the time of gradient catastrophe.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02998v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Bochao Chen",
      "Yixian Gao",
      "Hongyu Liu"
    ],
    "title": "Symmetrization of the Maxwell--Neumann--Poincar'e operator, spectral decomposition in $\\mathbf{H}(\\mathrm{curl},D)$ traces, and boundary localisation of SPRs",
    "abstract": "The Neumann--Poincaré (NP) operator, a fundamental operator in potential theory, has attracted renewed attention for its central role in the analysis of surface plasmon resonances (SPRs). SPRs, characterized by non-radiative electromagnetic waves at material interfaces with opposing permittivities, underpin advanced technologies such as bio-sensing and cloaking devices. While spectral properties of the scalar NP operator and SPR dynamics for scalar waves are well-established, their vectorial counterparts in Maxwell's framework remain poorly understood. This work bridges this gap by introducing a novel symmetrization principle for the matrix-valued Maxwell Neumann--Poincaré (MNP) operator, enabling a spectral decomposition of traces in the $\\mathbf{H}(\\mathrm{curl},D)$ space--a foundational advance for electromagnetic theory. Building on this framework, we rigorously characterize the quantum-ergodic localization of weak surface plasmon resonances at material boundaries in the full Maxwell system, thereby settling a long-standing question concerning their quantitative description.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03283v1",
    "categories": [
      "math.ST",
      "cs.IT",
      "stat.ML"
    ],
    "authors": [
      "Haohua Chen",
      "Songbin Liu",
      "Junjie Ma"
    ],
    "title": "Orthogonal Approximate Message Passing Algorithms for Rectangular Spiked Matrix Models with Rotationally Invariant Noise",
    "abstract": "We propose an orthogonal approximate message passing (OAMP) algorithm for signal estimation in the rectangular spiked matrix model with general rotationally invariant (RI) noise. We establish a rigorous state evolution that exactly characterizes the high-dimensional dynamics of the algorithm. Building on this framework, we derive an optimal variant of OAMP that minimizes the predicted mean-squared error at each iteration. For the special case of i.i.d. Gaussian noise, the fixed point of the proposed OAMP algorithm coincides with that of the standard AMP algorithm. For general RI noise models, we conjecture that the optimal OAMP algorithm is statistically optimal within a broad class of iterative methods, and achieves Bayes-optimal performance in certain regimes.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03259v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Arun J Manattu",
      "Athira Vinay",
      "Aparna Lakshmanan S"
    ],
    "title": "On a conjecture about the strong odd chromatic number of planar graphs",
    "abstract": "A proper coloring of a graph $G$ is said to be a strong odd coloring of $G$, if for every vertex $v$ and every color $c$, either $c$ appears on an odd number of vertices in the neighborhood of $v$ or $c$ is absent in the neighborhood of $v$. The strong odd chromatic number of $G$ is defined as the smallest integer $k$ for which $G$ admits a strong odd coloring using $k$ colors. In this paper, we evaluate the strong odd chromatic number of join of cycles and empty graphs and one point union of graphs. Using these results, we construct infinite family of planar graphs that serves as counter examples to a recent conjecture regarding the upper bound of the strong odd chromatic number of planar graphs.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03251v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Enrique González-Jiménez"
    ],
    "title": "Squares in arithmetic progression over quadratic extensions of number fields",
    "abstract": "We study arithmetic progressions of squares over quadratic extensions of number fields. Using a method inspired by an approach of Mordell, we characterize such progressions as quadratic points on a genus $5$ curve. Specifically, we determine the set of $K$-quadratic points on this curve under certain conditions on the base field $K$. Our main results rely on the algebraic properties of specific elliptic curves after performing a base change to suitable number fields. As a consequence, we establish that, under appropriate assumptions, any non-elementary arithmetic progression of five or six squares properly defined over a quadratic extension of $K$ must be of a specific form. Moreover, we prove the non-existence of such progressions of length greater than six under these assumptions.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02723v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Thomas Leistner",
      "Lilia Mehidi",
      "Abdelghani Zeghib"
    ],
    "title": "Locally conformally homogeneous Lorentzian spaces",
    "abstract": "We study locally conformally homogeneous Lorentzian manifolds of dimension at least $3$, admitting an essential pseudo-group of local conformal transformations. Generalizing a recent result of Alekseevsky and Galaev, we show that any such manifold $(M,g)$ is either conformally flat, or locally conformally equivalent to a homogeneous plane wave. When the manifold is non-conformally flat, we show the existence of a codimension-one lightlike foliation of Heisenberg type, which leads to the plane wave structure. Our approach relies on tools from Gromov's theory of rigid transformations. Finally, we observe that the plane wave metric in the conformal class coincides with the Penrose limit of $(M,g)$ along some null geodesic.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02976v1",
    "categories": [
      "math.LO",
      "math.AT"
    ],
    "authors": [
      "Mark Schachner"
    ],
    "title": "Computational techniques for sheaf cohomology of locally profinite sets",
    "abstract": "We compute the sheaf cohomology with constant $\\mathbb{Z}_2$ coefficients of a concrete class of locally profinite sets of independent interest. We introduce $k$-Fubini partitions to aid in constructions, which witness a failure of a Fubini theorem analog for these spaces. It is also shown that questions of intermediate cohomology degrees can be reduced to questions about top cohomology degrees by exhibiting nontrivial top cocycles as pointwise limits of coboundaries.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02933v1",
    "categories": [
      "math.GR",
      "math.LO"
    ],
    "authors": [
      "Alexei Miasnikov",
      "Andrey Nikolaev"
    ],
    "title": "Nonstandard free groups",
    "abstract": "Interpretation of a structure $\\mathbb A$ in $\\mathbb B$ allows to produce structures elementarily equivalent to $\\mathbb A$ given those elementarily equivalent to $\\mathbb B$. In particular, interpretation of the free group in $\\mathbb N$ enables us to introduce and study a family of elementary free groups, which we call nonstandard free groups. More generally, for a wide class of groups we introduce nonstandard models arising from interpretation in $\\mathbb N$. We exploit interpretation to show that under mild assumptions, ultrapowers of a group can be viewed as nonstandard models of that group. This leads us to describe the structure of the ultrapowers in terms of structure of nonstandard models of natural numbers, offering insight into a longstanding question of Malcev. We also introduce fundamentals of nonstandard combinatorial group theory such as the notions of nonstandard subgroups, nonstandard normal subgroups, and nonstandard group presentations.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02913v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Felipe Caster",
      "Dan Guyer",
      "José Alejandro Samper"
    ],
    "title": "Poset Partitions and the Combinatorics of the $\\textbf{cd}$-Index",
    "abstract": "We introduce a new class of Eulerian posets, called S-partitionable posets, which have a non-negative cd-index. These posets are a generalization of S-shellable complexes introduced by Stanley in 1994. We prove that S-partitionable posets have a non-negative cd-index via a recursive formula. Then, we introduce a semi-Eulerian version of S-partitionable posets, which we call SE-partitionable posets. We show that SE-partitionable posets also have a non-negative semi-Eulerian cd-index as defined by Juhnke-Kubitzke, Samper and Venturello in 2024.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02911v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Julia Brandes",
      "Trevor D. Wooley"
    ],
    "title": "Structure and paucity in affine diagonal systems, I",
    "abstract": "Let $\\varepsilon>0$ and $\\mathbf h\\in \\mathbb Z^3$. We show that whenever $P$ is large and the system \\[ x_1^j+x_2^j-y_1^j-y_2^j=h_j\\quad (j=1,2,3) \\] has more than $P^\\varepsilon$ integral solutions with $1\\le x_i,y_i\\le P$, then there exist natural numbers $a$ and $b$ with $h_j=a^j-b^j$ $(j=1,2,3)$. This example illustrates the theme that, either the Diophantine system has a paucity of integral solutions, or else the coefficient tuple $\\mathbf h$ is highly structured. We examine related paucity problems as well as some consequences for problems involving more variables.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.02885v1",
    "categories": [
      "math.GR",
      "cs.CC",
      "math.GT"
    ],
    "authors": [
      "Eric Samperton",
      "Armin Weiß"
    ],
    "title": "Obstruction theory and the complexity of counting group homomorphisms",
    "abstract": "Fix a finite group $G$. We study the computational complexity of counting problems of the following flavor: given a group $Γ$, count the number of homomorphisms $Γ\\to G$. Our first result establishes that this problem is $\\#\\mathsf{P}$-hard whenever $G$ is a non-abelian group and $Γ$ is provided via a finite presentation. We give several improvements showing that this hardness conclusion continues to hold for restricted $Γ$ satisfying various promises. Our second result, in contrast, shows that if $G$ is class 2 nilpotent and $Γ= π_1(M^3)$ for some input 3-manifold triangulation $M^3$, then there is a polynomial time algorithm. The difference in complexity is explained by the fact that 3-manifolds are close enough to being Eilenberg-MacLane spaces for us to be able to solve the necessary group cohomological obstruction problems efficiently using the given triangulation. A similar polynomial time algorithm for counting maps to finite, class 2 nilpotent $G$ exists when $Γ$ is itself a finite group encoded via a multiplication table.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03428v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "T. Chaumont-Frelet",
      "S. Sauter"
    ],
    "title": "On singular Galerkin discretizations for three models in high-frequency scattering",
    "abstract": "We consider three common mathematical models for time-harmonic high frequency scattering: the Helmholtz equation in two and three spatial dimensions, a transverse magnetic problem in two dimensions, and Maxwell's equation in three dimensions with dissipative boundary conditions such that the continuous problem is well posed. In this paper, we construct meshes for popular (low order) Galerkin finite element discretizations such that the discrete system matrix becomes singular and the discrete problem is not well posed. This implies that a condition \"the finite element space has to be sufficiently rich\" in the form of a resolution condition - typically imposed for discrete well-posedness - is not an artifact from the proof by a compact perturbation argument but necessary for discrete stability of the Galerkin discretization.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03810v1",
    "categories": [
      "math.QA",
      "math-ph"
    ],
    "authors": [
      "Andrea Rivezzi",
      "Jonas Schnitzer"
    ],
    "title": "On the Quantization-Dequantization Correspondence for (co)Poisson Hopf Algebras",
    "abstract": "In this paper, we construct a functorial quantization of (co)Poisson Hopf algebras within a broad categorical framework. We further introduce categories naturally associated with (co)Poisson Hopf algebras, namely Drinfeld-Yetter modules. These categories provide a canonical setting in which we define explicit dequantization functors that are inverse to the quantization functors. Using this framework, we also establish functorial (de)quantization results for the corresponding module categories. Finally, we recover the classical results of Etingof and Kazhdan as special cases of our construction and discuss applications to deformation quantization à la Tamarkin.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03803v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Antoine Leudière",
      "Renate Scheidler"
    ],
    "title": "Computing submodules of points of general Drinfeld modules over finite fields",
    "abstract": "We present an algorithm for computing the structure of any submodule of the module of points of a Drinfeld $A$-module over a finite field, where $A$ is a function ring over $\\mathbb F_q$. When the function ring is $A = \\mathbb F_q[T]$, we additionally compute a Frobenius decomposition of said submodule. Our algorithms apply in particular to kernels of isogenies and torsion submodules. They are presented within the frameworks of Frobenius normal forms, presentations of modules, and Fitting ideals. They rely largely on efficient and classical linear algebra methods, combined with fast arithmetic of Ore polynomials. We analyze the complexity of our algorithms, explore optimizations, and provide an implementation in SageMath. Finally, we compute a simple invariant attached to a Drinfeld $\\mathbb F_q[T]$-module that encodes all the polynomials in $\\mathbb F_q[T]$ whose associated torsion is rational.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03736v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Pintu Debnath"
    ],
    "title": "A combinatorial approach to the stronger Central Sets Theorem for semigroups",
    "abstract": "H. Furstenberg introduced the notion of central sets in terms of topological dynamics and established the famous Central Sets Theorem. Later in [A new and stronger Central Sets Theorem, Fund. Math. 199 (2008), 155-175], D. De, N. Hindman, and D. Strauss established a stronger version of the Central Sets Theorem that uses the algebra of the Stone-\\v Cech compactification of discrete semigroups. In this article, We will provide a new and combinatorial proof of the stronger Central Sets Theorem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03726v1",
    "categories": [
      "math.SP",
      "math-ph",
      "math.DS"
    ],
    "authors": [
      "Julien Moy"
    ],
    "title": "Spectral gap for Pollicott-Ruelle resonances on random coverings of Anosov surfaces",
    "abstract": "Let $(M,g)$ be a closed Riemannian surface with Anosov geodesic flow. We prove the existence of a spectral gap for Pollicott--Ruelle resonances on random finite coverings of $M$ in the limit of large degree, which is expected to be optimal. The proof combines the recent strong convergence results of Magee, Puder and van Handel for permutation representations of surface groups with an analysis of the spherical mean operator on the universal cover of $M$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03660v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Isabel Vogt"
    ],
    "title": "Recent advances in Brill--Noether theory and the geometry of Brill--Noether curves",
    "abstract": "The first goal of this article is to survey recent progress in Brill--Noether theory, including both the study of the moduli space of maps from a curve to projective space and the geometry of the resulting curves in projective space. The second goal is to introduce newcomers to some of the important techniques that have been introduced or developed in the last decade that made these advances possible.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03642v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Ivan Ermoshin"
    ],
    "title": "The largest prime factor of an irreducible cubic polynomial",
    "abstract": "Heath-Brown proved that for a positive proportion of integers $n$, $n^3+2$ has a prime factor larger than $n^{1+c}$ with $c=10^{-303}$.\n  We generalize this result to arbitrary monic irreducible cubic polynomial of $\\mathbb{Z}[x]$ with $c$ replaced by an exponent $c_p$ dependent on the polynomial.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03607v1",
    "categories": [
      "cs.IT",
      "math.OC"
    ],
    "authors": [
      "Hajar El Hassani",
      "Mikael Gidlund"
    ],
    "title": "Sleep or Transmit: Dual-Mode Energy-Efficient Design for NOMA-Enabled Backscatter Networks",
    "abstract": "The rapid growth of Internet-of-Things (IoT) devices demands communication systems that are both spectrally efficient and energy frugal. Backscatter communication (BackCom) is an attractive low-power paradigm, but its spectral efficiency declines in dense deployments. This paper presents an uplink BackCom design that integrates non-orthogonal multiple access (NOMA) and maximizes system energy efficiency (EE). In a bistatic network where multiple backscatter nodes (BNs) harvest RF energy and alternate between sleep and active modes, we formulate a fractional program with coupled time, power, and reflection variables and develop a Dinkelbach-based alternating optimization (AO) algorithm with closed-form updates. Analysis reveals two operating modes depending on power availability, circuit demands and propagation conditions. Simulations show the proposed design adapts the time allocation, achieving up to 8% higher EE than fixed-power and 68% than no-sleep baselines, and delivering up to 127% EE gains over orthogonal multiple access (OMA). These results establish NOMA-enabled BackCom as a scalable, energy efficient solution for large-scale IoT deployments.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03606v1",
    "categories": [
      "math-ph",
      "hep-th",
      "math.OA"
    ],
    "authors": [
      "Stefan Hollands",
      "Roberto Longo",
      "Gerardo Morsella"
    ],
    "title": "Bekenstein's bound for wave packets",
    "abstract": "Let $B$ be a spatial region of width $2R$ and $Φ$ a Klein-Gordon wave packet localized in $B$ at time zero. We show the inequality $S \\leq 2πR E$; here, $S$ is the entropy of $Φ$ contained in a region $B$, and $E$ is the energy content of $Φ$ within $B$. We consider a wider setting and formulate a variational problem aimed at minimizing our bound when $Φ$ is not localized in $B$. Our inequality holds in more generality in the framework of local, Poincaré covariant nets of standard subspaces and is related to the Bekenstein inequality. We point out a general bound that is compatible with the recent numerical computations by Bostelmann, Cadamuro, and Minz concerning the one-particle modular Hamiltonian of a scalar massive quantum Klein-Gordon field. We also provide a version of the entropy balance and ant formulas for wave packets.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03577v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Shubhabrata Das",
      "Partha Sarathi Ghosh"
    ],
    "title": "Stability of the weak Haagerup property under graph products",
    "abstract": "In this paper we prove that: Any graph product of finitely many groups, all of them satisfying weak Haagerup property with $Λ_{WH}=1$, also satisfies weak Haagerup property and as a corollary of this result we obtain that the free product of weakly Haagerup groups with $Λ_{WH}=1$, again has weak Haagerup property with $Λ_{WH}=1$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03575v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Timothée Crin-Barat",
      "Zihao Song"
    ],
    "title": "The compressible Euler system with damping in hybrid Besov spaces: global well-posedness and relaxation limit",
    "abstract": "We investigate the global well-posedness of the compressible Euler system with damping in Rd (d\\geq1) and its relaxation limit toward the porous medium equation. In [12], the first author and Danchin studied these two problems in hybrid Besov spaces, where the high-frequency components of the solution are bounded in L2-based norms, while the low-frequency components are controlled in Lp-based norms with p\\in[2,\\max{4,\\frac{2d}{d-2}}]. Motivated by the observation that the limit system is well-posed in Lp-based spaces for p\\in[2, \\infty), we extend the low-frequency analysis to this full range, thereby providing a more unified framework for studying such relaxation limits.\n  The core of our proof consists in establishing refined product and commutator estimates describing sharply the interactions between the high, medium, and low-frequency regimes. A key observation underlying our analysis is that the product of two functions localized at low frequencies generates only interactions between low and medium frequencies, never purely high-frequency ones. Consequently, for a suitable choice of frequency threshold, the high-frequency projection of the product of two functions localized low frequencies vanishes.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03568v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Shubhabrata Das",
      "Partha Sarathi Ghosh"
    ],
    "title": "Stability of Haagerup property under graph product",
    "abstract": "In this paper, we prove that any graph product of finitely many groups, all satisfying the Haagerup property (or Gromov's a-T-menability) also satisfies Haagerup property.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03768v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tatsuya Hosono"
    ],
    "title": "Global existence for the fully parabolic Keller--Segel system with critical mass on the plane",
    "abstract": "We study the global existence of solutions to the Cauchy problem for the two-dimensional fully parabolic Keller--Segel system at the critical mass. It is known that global-in-time existence holds for initial data with critical mass under radial symmetry or suitable moment conditions, whereas the behavior of general solutions in the critical regime remains delicate. In this paper, we establish global-in-time existence for general initial data with critical mass, without imposing any symmetry or moment assumptions. The proof relies on the construction of a reconstructed Lyapunov functional, combined with refined regularity estimates for the associated dissipative terms, which enable us to control the solution dynamics in the critical regime.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03740v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Xavier Emery",
      "Christian Lantuéjoul"
    ],
    "title": "On the compatibility between the spatial moments and the codomain of a real random field",
    "abstract": "While any symmetric and positive semidefinite mapping can be the non-centered covariance of a Gaussian random field, it is known that these conditions are no longer sufficient when the random field is valued in a two-point set. The question therefore arises of what are the necessary and sufficient conditions for a mapping $ρ: \\X \\times \\X \\to \\R$ to be the non-centered covariance of a random field with values in a subset ${\\cE}$ of $\\R$. Such conditions are presented in the general case when ${\\cE}$ is a closed subset of the real line, then examined for some specific cases. In particular, if ${\\cE}=\\R$ or $\\Z$, it is shown that the conditions reduce to $ρ$ being symmetric and positive semidefinite. If ${\\cE}$ is a closed interval or a two-point set, the necessary and sufficient conditions are more restrictive: the symmetry, positive semidefiniteness, upper and lower boundedness of $ρ$ are no longer enough to guarantee the existence of a random field valued in ${\\cE}$ and having $ρ$ as its non-centered covariance. Similar characterizations are obtained for semivariograms and higher-order spatial moments, as well as for multivariate random fields.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03739v1",
    "categories": [
      "math.CT",
      "math.QA",
      "math.RA",
      "math.RT"
    ],
    "authors": [
      "Lucrezia Bottegoni",
      "Zhenbang Zuo"
    ],
    "title": "Semiseparability of induction functors in a monoidal category",
    "abstract": "For any algebra morphism in a monoidal category, we provide sufficient conditions (which are also necessary if the unit is a left tensor generator) for the attached induction functor being semiseparable. Under mild assumptions, we prove that the semiseparability of the induction functor is preserved if one applies a lax monoidal functor. Similar results are shown for the coinduction functors attached to coalgebra morphisms in a monoidal category. As an application, we study the semiseparability of combinations of (co)induction functors in the context of duoidal categories.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03722v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.GT"
    ],
    "authors": [
      "Dawei Chen",
      "Evan Chen",
      "Kenny Lau",
      "Ken Ono",
      "Jujian Zhang"
    ],
    "title": "Parity of $k$-differentials in genus zero and one",
    "abstract": "Here we completely determine the spin parity of $k$-differentials with prescribed zero and pole orders on Riemann surfaces of genus zero and one. This result was previously obtained conditionally by the first author and Quentin Gendron assuming the truth of a number-theoretic hypothesis Conjecture A.10. We prove this hypothesis by reformulating it in terms of Jacobi symbols, reducing the proof to a combinatorial identity and standard facts about Jacobi symbols. The proof was obtained by AxiomProver and the system formalized the proof of the combinatorial identity in Lean/Mathlib (see the Appendix).",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03703v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Benjamin Mudrak"
    ],
    "title": "On Zero-Dimensional Glicci Monomial Ideals",
    "abstract": "Consider the polynomial ring $R_n = k[x_1,...,x_n]$, where $k$ is a field. Let $m = (x_1,...,x_n)$ and $I$ be an $m$-primary monomial ideal in $R$. We consider the problem of determining whether such ideals are in the Gorenstein liasion class of a complete intersection (glicci). We prove that all $m$-primary monomial ideals in $k[x,y,z]$ with at most eight generators are homogeneously glicci. We also construct a large class of $m$-primary monomial ideals in $R_n$ for any $n$ with any number of minimal generators that are homogeneously glicci but not in the complete intersection liaison class of a complete intersection (licci). All Gorenstein links used are constructed explicitly and every second step links to another $m$-primary monomial ideal.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03475v1",
    "categories": [
      "math.RA",
      "math.RT"
    ],
    "authors": [
      "Bertrand Nguefack"
    ],
    "title": "On the uniform dimension of subextensions in skew polynomial rings",
    "abstract": "This work investigates the invariance of the non-necessarily finite uniform dimension and related concepts for subextensions in skew polynomial rings \\mbox{$ \\mathbb{S}=R[ \\mathbf{\\mathrm{X}}; \\mathbfα , \\mathbfδ ]$} of bijective type over a well-ordered set of variables. When the coefficient ring has enough uniform left ideals, in the commuting variables case we show that classical results on this topic for polynomial rings extend to subextensions of skew Laurent polynomial rings \\mbox{$ \\mathbb{S}=R[ \\mathbf{\\mathrm{X}}^{\\pm1}; \\mathbfα]$}, generated over $R$ by any family of (standard) terms. The situation in the non-commuting variables context is more complex; easily formed polynomial-like subrings can behave very oddly from the ambient ring.\n  We provide easy examples of a (semi)prime left Goldie skew polynomial ring of bijective type containing a monoid subring isomorphic to a free non-commutative polynomial ring. We then study the so-called subclass of \\emph{essentially special subextensions} and obtain for them the preservation of the uniform dimension and related concepts.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03463v1",
    "categories": [
      "math.AP",
      "math-ph"
    ],
    "authors": [
      "Lidia Gargyants",
      "Anna Konovalova",
      "Olga Rozanova"
    ],
    "title": "Internal free boundary problem for cold plasma equations",
    "abstract": "For the system of cold plasma equations describing the motion of electrons in the field of stationary ions, we consider the Riemann problem posed at an impenetrable interface between two media. These media differ in the magnitude of the constant ion field. The interface between the media is assumed to be free. Its position is determined from the generalized Rankine-Hugoniot conditions and the stability condition, that is, the intersection of Lagrangian particle trajectories at the interface.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03441v1",
    "categories": [
      "math.DG",
      "hep-th",
      "math-ph",
      "math.AG",
      "math.AT"
    ],
    "authors": [
      "Severin Bunk",
      "Lukas Müller",
      "Joost Nuiten",
      "Richard J. Szabo"
    ],
    "title": "Symmetries and Higher-Form Connections in Derived Differential Geometry",
    "abstract": "We introduce a general definition of higher-form connections on principal $\\infty$-bundles in differential geometry. This is achieved by developing the formal differentiation and integration of maps from smooth manifolds to derived stacks with sufficient deformation theory. That allows us to introduce the Atiyah $L_\\infty$-algebroid of a principal $\\infty$-bundle and establish its global sections as the $L_\\infty$-algebra of the derived higher symmetry group of the bundle. We define the space of $p$-form connections on an $\\infty$-bundle as the space of order $p$ splittings of its Atiyah $L_\\infty$-algebroid. We demonstrate that our new concept of derived geometric $p$-form connections recovers the known notion of connections on higher U(1)-bundles defined via Čech-Deligne differential cocycles. We further relate the $L_\\infty$-algebras of derived higher symmetries of higher U(1)-bundles and higher Courant algebroids. Some applications in higher gauge theory and in supergravity are mentioned.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03440v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Levent Kargın",
      "Merve Mutluer"
    ],
    "title": "A New Expression for the Bernoulli Numbers and its Applications",
    "abstract": "This paper shows that a finite discrete convolution involving Stirling numbers of both kinds and harmonic numbers can be expressed in terms of the Bernoulli numbers. As applications of this expression, the linear recurrence relation for the Bernoulli numbers given by Agoh is reproved, and a new recurrence relation for the Bernoulli numbers is obtained. Furthermore, it is shown that a cumulative sum of the Bernoulli numbers can be written in terms of the Bernoulli and di-Bernoulli numbers. Finally, congruences for the sums of the Bernoulli and Euler numbers are established.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03532v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Leonard Mada",
      "Maria Anastasia Jivulescu"
    ],
    "title": "An operator algebraic approach for generalized Cardano polynomials",
    "abstract": "We develop an operator algebraic framework for generalized Cardano polynomials and show how their structure naturally leads to an operator formulation of Cardano method that is compatible with tools and concepts from quantum information theory. The generalized Cardano polynomials are constructed as a generalization of classical theory of Cardano formula for cubic equation, as well as through the spectral properties of the circular operator, that embeds Cardano type identities into their spectral theory. The construction clarifies the algebraic structure and solvability of a family of two parameters odd order polynomials, classically and through operator methods familiar in QIT, including Fourier transforms and spectral calculus on operator algebras. As applications, we show connections to Cebyshev polynomials and the solution of the quartic order Ferrari equation.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03481v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alexander Zlotnik"
    ],
    "title": "On weak solutions to the 1d compressible Navier-Stokes equations: a Lipschitz continuous dependence on data in weaker norms and an error of their homogenization",
    "abstract": "We deal with the global in time weak solutions to the 1D compressible Navier-Stokes system of equations for large discontinuous initial data and nonhomogeneous boundary conditions of three standard types. We prove the Lipschitz-type continuous dependence of the solution $(η,u,θ)$, in a norm slightly stronger than $L^{2,\\infty}(Q)\\times L^2(Q)\\times L^2(Q)$, on the initial data $(η^0,u^0,e^0)$ in a norm of $L^2(Ω)\\times H^{-1}(Ω)\\times H^{-1}(Ω)$-type and also on the free terms in all the equations in some dual norms. Here $η$, $u$ and $θ$ are the specific volume, velocity and absolute temperature as well as $η^0$, $u^0$ and $e^0$ are the initial specific volume, velocity and specific total energy, and $Q=Ω\\times (0,T)$. We also apply this result to the case of discontinuous rapidly oscillating, with the period $\\varepsilon$, initial data and free terms and derive an estimate $O(\\varepsilon)$ for the difference between the solutions to the Navier-Stokes equations and their Bakhvalov-Eglit two-scale homogenized version with averaged data.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03717v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Éva Czabarka",
      "Alec Helm"
    ],
    "title": "Curious crossing-critical edges -- variations on an example of Širáň",
    "abstract": "Motivated by Kuratowski's theorem, a Kuratowski subgraph of a graph is a subgraph that is a subdivided $K_5$ or a subdivided $K_{3,3}$. An edge is crossing-critical if the crossing number decreases after removing the edge. In this note, we present the following examples: a graph with an edge that is crossed in every optimal drawing of the graph, but the edge is not in any Kuratowski subgraph of the graph; a graph with an edge that is in every Kuratowski subgraph but is not crossed in any optimal drawing of the graph; and a graph with a crossing-critical edge that is not present in any Kuratowski subgraph and is not crossed in any optimal drawing of the graph.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03716v1",
    "categories": [
      "math.CO",
      "math.AC",
      "math.NT"
    ],
    "authors": [
      "Evan Chen",
      "Chris Cummins",
      "GSM",
      "Dejan Grubisic",
      "Leopold Haller",
      "Letong Hong",
      "Andranik Kurghinyan",
      "Kenny Lau",
      "Hugh Leather",
      "Seewoo Lee",
      "Aram Markosyan",
      "Ken Ono",
      "Manooshree Patel",
      "Gaurang Pendharkar",
      "Vedant Rathi",
      "Alex Schneidman",
      "Volker Seeker",
      "Shubho Sengupta",
      "Ishan Sinha",
      "Jimmy Xin",
      "Jujian Zhang"
    ],
    "title": "Fel's Conjecture on Syzygies of Numerical Semigroups",
    "abstract": "Let $S=\\langle d_1,\\dots,d_m\\rangle$ be a numerical semigroup and $k[S]$ its semigroup ring. The Hilbert numerator of $k[S]$ determines normalized alternating syzygy power sums $K_p(S)$ encoding alternating power sums of syzygy degrees. Fel conjectured an explicit formula for $K_p(S)$, for all $p\\ge 0$, in terms of the gap power sums $G_r(S)=\\sum_{g\\notin S} g^r$ and universal symmetric polynomials $T_n$ evaluated at the generator power sums $σ_k=\\sum_i d_i^k$ (and $δ_k=(σ_k-1)/2^k$). We prove Fel's conjecture via exponential generating functions and coefficient extraction, solating the universal identities for $T_n$ needed for the derivation. The argument is fully formalized in Lean/Mathlib, and was produced automatically by AxiomProver from a natural-language statement of the conjecture.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03679v1",
    "categories": [
      "math.HO"
    ],
    "authors": [
      "Felix De la Cruz Serrano"
    ],
    "title": "Footprints of the Walking of Numbers: A Dynamic Visualization Task for Understanding Decimal Numbers in Secondary Education",
    "abstract": "The study of decimal numbers in secondary education is often approached from algorithmic perspectives, which limits students' understanding of their structure. This paper presents the task Footprints of the Walking of Numbers, a dynamic visualization proposal aimed at supporting the understanding of decimal numbers through the exploration of their infinite decimal expansions. The task is based on assigning vectors to the decimal digits from 0 to 9, so that the sequence of digits of a number generates a dynamic geometric path in the plane. Through the use of GeoGebra as a visualization environment, students can observe, compare, and interpret traces associated with different types of numbers, such as terminating decimals, repeating decimals, and irrational numbers, identifying visual regularities linked to their decimal behavior. The analysis is developed from a theoretical-didactical perspective, using the Mathematical Working Space as an interpretative lens to characterize the potential of the task design. In addition, the paper discusses the punctual use of generative AI tools exclusively as instrumental support for computation, without shifting the focus away from mathematical reasoning.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03659v1",
    "categories": [
      "math.RT",
      "math.RA"
    ],
    "authors": [
      "Jenny August",
      "Johanne Haugland",
      "Karin M. Jacobsen",
      "Sondre Kvamme",
      "Yann Palu",
      "Hipolito Treffinger"
    ],
    "title": "Higher torsion classes, $τ_d$-tilting theory and silting complexes",
    "abstract": "Initiated in work by Adachi, Iyama and Reiten, the area known as $τ$-tilting theory plays a fundamental role in contemporary representation theory. In this paper we explore a higher-dimensional analogue of this theory, formulated with respect to the higher Auslander-Reiten translation $τ_d$. In particular, we associate to any functorially finite $d$-torsion class a maximal $τ_d$-rigid pair and a $(d+1)$-term silting complex. In the case $d=1$, the notions of maximal $τ_d$-rigid and support $τ$-tilting pairs coincide, and our theory recovers the classical bijections. However, the proof strategies for $d>1$ differ significantly. As an intermediate step, we prove that a $d$-cluster tilting subcategory of a module category induces a $d$-cluster tilting subcategory of the category of $(d+1)$-term complexes, producing novel examples of $d$-exact categories. We introduce the notion of a $d$-torsion class in the exact setup, and use this to obtain the aforementioned $(d+1)$-term silting complex. We moreover apply our theory to study $d$-APR tilting modules and slices. To illustrate our results, we provide explicit combinatorial descriptions of maximal $τ_d$-rigid pairs and $(d+1)$-term silting complexes for higher Auslander and higher Nakayama algebras.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03653v1",
    "categories": [
      "math.DG",
      "math.CV"
    ],
    "authors": [
      "Daniele Angella",
      "Nicoletta Tardini"
    ],
    "title": "Cohomological properties and Hermitian metrics of complex non-Kähler manifolds",
    "abstract": "We give a partial account of some problems concerning cohomological invariants and metric properties of complex non-Kähler manifolds.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03539v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Thomas Nagler",
      "Sophie Langer"
    ],
    "title": "Optimal neural network approximation of smooth compositional functions on sets with low intrinsic dimension",
    "abstract": "We study approximation and statistical learning properties of deep ReLU networks under structural assumptions that mitigate the curse of dimensionality. We prove minimax-optimal uniform approximation rates for $s$-Hölder smooth functions defined on sets with low Minkowski dimension using fully connected networks with flexible width and depth, improving existing results by logarithmic factors even in classical full-dimensional settings. A key technical ingredient is a new memorization result for deep ReLU networks that enables efficient point fitting with dense architectures. We further introduce a class of compositional models in which each component function is smooth and acts on a domain of low intrinsic dimension. This framework unifies two common assumptions in the statistical learning literature, structural constraints on the target function and low dimensionality of the covariates, within a single model. We show that deep networks can approximate such functions at rates determined by the most difficult function in the composition. As an application, we derive improved convergence rates for empirical risk minimization in nonparametric regression that adapt to smoothness, compositional structure, and intrinsic dimensionality.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03526v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Hossein Safi",
      "Rizwana Ahmad",
      "Iman Tavakkolnia",
      "Harald Haas"
    ],
    "title": "Q-Learning for 3D Coverage in VCSEL-based Optical Wireless Systems",
    "abstract": "Beam divergence control is a key factor in maintaining reliable coverage in indoor optical wireless communication (OWC) systems as receiver height varies.Conventional systems employ fixed divergence angles, which result in significant coverage degradation due to the non-convex tradeoff between optical power concentration and spatial spread. In this paper, we introduce a reinforcement learning (RL)-based framework for dynamic divergence adaptation in vertical-cavity surface-emitting laser (VCSEL)-based OWC networks. By continuously interacting with the environment, the RL agent autonomously learns a near-optimal mapping between receiver height and beam divergence, thereby eliminating the need for analytical modeling or computationally intensive exhaustive search. Simulation results demonstrate that the proposed approach achieves up to 92% coverage at low receiver heights and maintains robust performance under challenging conditions, enabling scalable, real-time, and energy-efficient beam control for dense VCSEL array deployments in next-generation OWC systems.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03503v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Luisa Beghin",
      "Lorenzo Cristofaro",
      "Enrico Scalas"
    ],
    "title": "Shot-noise processes with logarithmic response function and their scaling limits",
    "abstract": "We consider shot-noise processes with an impulse response written in terms of the logarithm of the ratio between current and event time (instead of the usual absolute time difference). We study its finite-time properties as well as its weak convergence, under appropriate scaling and with general assumptions on the dependence of noises on event times. The limiting process coincides with the so-called Hadamard fractional Brownian motion (introduced in Beghin, Cristofaro, Polito (2026)), which represents a middle ground between standard Brownian motion and fractional Brownian motion. It shares the one-dimensional distribution with the former, while possessing the long-memory property (within a certain parameter range) of the latter, though with smaller intensity.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03465v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Seheon Ham",
      "Jiwon Kah",
      "Sanghyuk Lee",
      "Ji Li"
    ],
    "title": "On Rubio de Francia's maximal theorem",
    "abstract": "In his influential 1986 paper, Rubio de Francia established $L^p$ bounds for the maximal function generated by dilations of measures $μ$ whose Fourier transforms $\\widehatμ$ satisfy specific decay condition. In the present work, we obtain results that complement his work in several directions. In particular, we obtain restricted weak-type endpoint bound on the maximal function and $L^p$--$L^q$ bounds on its local variant. We also investigate how Frostman's growth condition on the measure influences those maximal bounds. While a key feature of Rubio de Francia's result is that $L^p$ boundedness is determined solely by the decay order of $\\widehatμ$, we show that the Frostman condition plays a significant role when the growth order exceeds $d-1$ or when $L^p$--$L^q$ estimates are considered.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03451v1",
    "categories": [
      "math.DG",
      "gr-qc"
    ],
    "authors": [
      "Eduardo Hafemann"
    ],
    "title": "A low-regularity Riemannian positive mass theorem for non-spin manifolds with distributional curvature",
    "abstract": "This article establishes a low-regularity Riemannian positive mass theorem for non-spin manifolds whose metrics are only $C^0 \\cap W_{\\mathrm{loc}}^{1,n}$ and smooth outside a compact set. The main theorem asserts that asymptotically flat manifolds with nonnegative distributional scalar curvature have nonnegative ADM mass. The proof uses smooth approximations of the metric together with a Sobolev version of Friedrichs' Lemma, which yields improved convergence for commutators between differentiation and convolution operators. Rigidity is obtained for $C^0 \\cap W_{\\mathrm{loc}}^{1,p}$ metrics with $p>n$ via the comparison theory of $\\sf{RCD}$-spaces and a rigidity theorem for compact manifolds with metrics of nonnegative distributional curvature by Jiang-Sheng-Zhang. The argument relies on either elementary techniques or generalisations of the standard argument. In essence, a version of the main theorem of Lee-LeFloch is presented in which the spin condition is removed under the assumption that the metric is smooth outside a compact set.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03446v1",
    "categories": [
      "math.OA",
      "math-ph",
      "math.FA"
    ],
    "authors": [
      "David P. Blecher",
      "Damon M. Hay"
    ],
    "title": "Base norm spaces--classical, complex, and noncommutative",
    "abstract": "We generalize the theory of base norm spaces to the complex case, and further to the noncommutative setting relevant to `quantum convexity'. In particular, we establish the duality between complex Archimedean order unit spaces and complex base norm spaces, as well as the corresponding duality between their noncommutative counterparts. Additional topics include an exploration of natural connections with various notions of quantum convexity and regularity of noncommutative convex sets, and an analysis of how these concepts interact with complexification. We also define, as in the classical case, a class that contains and generates the noncommutative base norm spaces, but is defined by fewer axioms. We show how this may be applied to provide new and interesting examples of noncommutative base norm spaces.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03831v1",
    "categories": [
      "math.MG",
      "math.FA",
      "math.PR"
    ],
    "authors": [
      "Silouanos Brazitikos",
      "Apostolos Giannopoulos",
      "Antonios Hmadi",
      "Natalia Tziotziou"
    ],
    "title": "On the maximal perimeter of isotropic log-concave probability measures",
    "abstract": "We study the maximal perimeter constant of isotropic log-concave probability measures on $\\mathbb{R}^n$. For a measure $μ$, this quantity, denoted by $Γ(μ)$, is defined as the supremum of the $μ$-perimeter over all convex bodies and measures the largest possible boundary contribution of convex sets with respect to $μ$. Let $$Γ_n := \\sup\\{Γ(μ) : μ\\text{ is an isotropic log-concave probability measure on } \\mathbb{R}^n\\}.$$ We prove that $Γ_n \\leqslant Cn^{3/2}$, where $C>0$ is an absolute constant. This result improves the previously known $O(n^2)$ upper bound. Under additional structural assumptions, we obtain sharp linear bounds of order $O(n)$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03774v1",
    "categories": [
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Yatin Dandi",
      "David Gamarnik",
      "Haodong Zhu"
    ],
    "title": "Minimum Number of Monochromatic Subgraphs of a Random Graph",
    "abstract": "We consider the problem of minimizing the number of monochromatic subgraphs of a random graph, when each node of the host graph is assigned one of the two colors. Using a recently discovered contiguity between appearance of strictly balanced subgraphs $F$ in a random graph, and random hypergraphs where copies of $F$ are generated independently, we show that the minimum value converges to a limit, when the expected number of copies of $F$ is linear in the number of nodes $|V|$. Furthermore, using the connections with mean field spin glass models, we obtain an asymptotic expression for this limit as the normalized expected number of copies of $F$ and the size of $F$ diverge to infinity.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03763v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Mathias Hudoba de Badyn",
      "Tyler Summers"
    ],
    "title": "Optimizing Weighted Hodge Laplacian Flows on Simplicial Complexes",
    "abstract": "Simplicial complexes are generalizations of graphs that describe higher-order network interactions among nodes in the graph. Network dynamics described by graph Laplacian flows have been widely studied in network science and control theory, and these can be generalized to simplicial complexes using Hodge Laplacians. We study weighted Hodge Laplacian flows on simplicial complexes. In particular, we develop a framework for weighted consensus dynamics based on weighted Hodge Laplacian flows and show some decomposition results for weighted Hodge Laplacians. We then show that two key spectral functions of the weighted Hodge Laplacians, the trace of the pseudoinverse and the smallest non-zero eigenvalue, are jointly convex in upper and lower simplex weights and can be formulated as semidefinite programs. Thus, globally optimal weights can be efficiently determined to optimize flows in terms of these functions. Numerical experiments demonstrate that optimal weights can substantially improve these metrics compared to uniform weights.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03746v1",
    "categories": [
      "math.CO",
      "cs.DM",
      "math.DS"
    ],
    "authors": [
      "Bastiàn Espinoza",
      "Pierre Popoli",
      "Manon Stipulanti"
    ],
    "title": "Factor-balancedness, linear recurrence, and factor complexity",
    "abstract": "In the study of infinite words, various notions of balancedness provide quantitative measures for how regularly letters or factors occur, and they find applications in several areas of mathematics and theoretical computer science. In this paper, we study factor-balancedness and uniform factor-balancedness, making two main contributions. First, we establish general sufficient conditions for an infinite word to be (uniformly) factor-balanced, applicable in particular to any given linearly recurrent word. These conditions are formulated in terms of $\\mathcal{S}$-adic representations and generalize results of Adamczewski on primitive substitutive words, which show that balancedness of length-2 factors already implies uniform factor-balancedness. As an application of our criteria, we characterize the Sturmian words and ternary Arnoux--Rauzy words that are uniformly factor-balanced as precisely those with bounded weak partial quotients. Our second main contribution is a study of the relationship between factor-balancedness and factor complexity. In particular, we analyze the non-primitive substitutive case and construct an example of a factor-balanced word with exponential factor complexity, thereby making progress on a question raised in 2025 by Arnoux, Berthé, Minervino, Steiner, and Thuswaldner on the relation between balancedness and discrete spectrum.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03684v1",
    "categories": [
      "math.DG",
      "cs.CG",
      "cs.GR",
      "math.DS",
      "physics.flu-dyn"
    ],
    "authors": [
      "Marcel Padilla"
    ],
    "title": "Point Vortex Dynamics on Closed Surfaces",
    "abstract": "The theory of point vortex dynamics has existed since Kirchhoff's proposal in 1891 and is still under development with connections to many fields in mathematics. As a strong simplification of the concept of vorticity it excels in computational speed for vorticity based fluid simulations at the cost of accuracy. Recent finding by Stefanella Boatto and Jair Koiller allowed the extension of this theory on to closed surfaces. A comprehensive guide to point vortex dynamics on closed surfaces with genus zero and vanishing total vorticity is presented here. Additionally fundamental knowledge of fluid dynamics and surfaces are explained in a way to unify the theory of point vortex dynamics of the plane, the sphere and closed surfaces together with implementation details and supplement material.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03644v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Luca Rossi"
    ],
    "title": "On the criticality and the principal eigenvalue of almost periodic elliptic operators",
    "abstract": "We review the notion and the properties of the generalised \\pe\\ for elliptic operators in unbounded domains, and we relate it with the criticality theory. We focus on operators with almost periodic coefficients. We present a Liouville-type result in dimension $N\\leq2$. Next, we show with a counter-example that criticality is not equivalent to the existence of an almost periodic principal eigenvalue, even for self-adjoint operators. Finally, we exhibit an almost periodic operator which is subcritical but which admits a critical limit operator. This is a manifestation of the instability character of the criticality property in the almost periodic setting.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03628v1",
    "categories": [
      "math.OA",
      "math.FA"
    ],
    "authors": [
      "Maria Joiţa",
      "Gheorghe-Ionuţ Şimon"
    ],
    "title": "The R-Shilov boundary for a local operator space",
    "abstract": "To extend the notion of the injective envelope of a unital operator space to the locally convex case, Dosi (2014) first introduced the notion of the injective R-envelope for a unital operator space and then defined the injective R-envelope for a unital local operator space as the closure of the injective R-envelope for its bounded part. In this paper, we investigate the existence of the Shilov boundary ideal in this context, as defined by Arveson (1969). To do this, by following the conceptual frameworks underlying Hamana's constructions of the injective envelope and the C*-envelope, respectively, we define the notions of the injective R-envelope and the R-C*-envelope for a unital local operator space. Furthermore, we show that the injective R-envelope construction given by us coincides with the one given by Dosi (2014).",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03626v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Rick F. Lu",
      "Asif Zaman",
      "Haonan Zhao"
    ],
    "title": "Numerical Computations Concerning Landau-Siegel Zeros",
    "abstract": "We computationally verify that if $L(s,χ)$ is a quadratic Dirichlet $L$-function modulo $q \\leq 10^{10}$ then $L(σ,χ) \\neq 0$ for real $σ\\ge 1-1/(5\\log q)$. The number of verified moduli exceeds benchmarks due to Watkins (2004), Platt (2016), and Languasco (2023) by a factor between 66 and 25,000. Our new algorithm draws from zero-free region arguments.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03561v1",
    "categories": [
      "math.OA",
      "math-ph",
      "math.FA"
    ],
    "authors": [
      "David P. Blecher"
    ],
    "title": "Regularity of compact convex sets--classical and noncommutative",
    "abstract": "The classical theory of regularity of embeddings of compact convex sets was developed in the 1970s, exclusively in the real case, and even there it does not appear to have been stated in its simplest form. We begin by revisiting this setting, showing that under a reasonable condition, every locally convex topological vector space $E$ that contains and is spanned by a compact convex set lying in a hyperplane not passing through the origin, is a (specific) dual Banach space equipped with the weak* topology. Second, we establish the corresponding regularity theory for convex sets in complex LCTVS's. Third, we develop a theory of regular embeddings for complex noncommutative convex sets, in the sense of Davidson and Kennedy. Finally, we use the complex theory to derive a theory of regular embeddings for real noncommutative convex sets. Interestingly, at present there appears to be no direct route to the latter.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03559v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tao Feng",
      "Minbo Yang",
      "Xianmei Zhou"
    ],
    "title": "Asymptotic behavior of solutions to a planar Hartree equation with isolated singularities",
    "abstract": "In this paper we investigate the isolated singularities of the Hartree type equation\n  \\begin{equation*}\n  -Δu (x)= \\left(\\frac{1}{|x|^α}*e^u\\right)e^{u(x)}\\quad \\text{in } B_{1}\\setminus\\{0\\} ,\n  \\end{equation*}\n  where $α>0$, $\\displaystyle \\frac{1}{|x|^α}*e^u\\triangleq\\int_{B_{1} \\setminus \\{0\\}}\\frac{e^u(y)}{|x-y|^α}dy$, and the punctured ball $B_{1}\\setminus\\{0\\}\\subset \\mathbb{R}^2$. Under the finite total curvature condition, by establishing a representation formula for singular solutions, we obtain the asymptotic behavior of the solutions near the origin. We also extend this asymptotic behavior results to the case with a general non-negative coefficient $K(x)$, and to the higher-order Hartree-type equations in any dimension $n \\geq 3$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03513v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Filip Najman"
    ],
    "title": "Torsion groups of elliptic curves that appear infinitely often over septic fields",
    "abstract": "In this short note we determine the set $Φ^\\infty(7)$ of Abelian groups that appear as torsion groups of infinitely many elliptic curves (up to $\\overline \\mathbb Q$-isomorphism) over number fields of degree 7.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03505v1",
    "categories": [
      "cs.IT",
      "cs.AI",
      "cs.LG"
    ],
    "authors": [
      "Saeed R. Khosravirad",
      "Ahmed Alkhateeb",
      "Ingrid van de Voorde"
    ],
    "title": "Generative Decompression: Optimal Lossy Decoding Against Distribution Mismatch",
    "abstract": "This paper addresses optimal decoding strategies in lossy compression where the assumed distribution for compressor design mismatches the actual (true) distribution of the source. This problem has immediate relevance in standardized communication systems where the decoder acquires side information or priors about the true distribution that are unavailable to the fixed encoder. We formally define the mismatched quantization problem, demonstrating that the optimal reconstruction rule, termed generative decompression, aligns with classical Bayesian estimation by taking the conditional expectation under the true distribution given the quantization indices and adapting it to fixed-encoder constraints. This strategy effectively performs a generative Bayesian correction on the decoder side, strictly outperforming the conventional centroid rule. We extend this framework to transmission over noisy channels, deriving a robust soft-decoding rule that quantifies the inefficiency of standard modular source--channel separation architectures under mismatch. Furthermore, we generalize the approach to task-oriented decoding, showing that the optimal strategy shifts from conditional mean estimation to maximum a posteriori (MAP) detection. Experimental results on Gaussian sources and deep-learning-based semantic classification demonstrate that generative decompression closes a vast majority of the performance gap to the ideal joint-optimization benchmark, enabling adaptive, high-fidelity reconstruction without modifying the encoder.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03500v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Risto Korhonen",
      "Chengliang Tan"
    ],
    "title": "n-th Tropical Nevanlinna Theory",
    "abstract": "In this paper, the tropical Nevanlinna theory is extended for piecewise polynomial continuous functions. By constructing the $n$-th Poisson-Jensen formula, the $n$-th tropical counting, proximity, and characteristic functions are introduced, which have some different properties compared to the classical tropical setting. Then, not only is the $n$-th version of the second main theorem for tropical homogeneous polynomials obtained, but also a tropical second main theorem for ordinary Fermat type polynomials is acquired. Moreover, by estimating the tropical logarithmic derivative with a growth assumption pointwise, a strong equality is proved. This equality illustrates the relationship between $\\sum_{i=0}^{m}N(r, 1_{0}\\oslash f_{i})$ and the ramification term $N(r, C_{0}(f_{0}, \\cdots, f_{m}))$, implying that there is no natural tropical truncated version of the second main theorem for shift operators.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03492v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Mikhail Menshikov",
      "Serguei Popov",
      "Andrew Wade"
    ],
    "title": "Dynamics of the leftmost particle in heterogeneous semi-infinite exclusion systems",
    "abstract": "We study the behaviour of the leftmost particle in a semi-infinite particle system on $\\mathbb{Z}$, where each particle performs a continuous-time nearest-neighbour random walk, with particle-specific jump rates, subject to the exclusion interaction (i.e., no more than one particle per site). We give conditions, in terms of the jump rates on the system, under which the leftmost particle is recurrent or transient, and develop tools to study its rate of escape in the transient case, including by comparison with an $M/G/\\infty$ queue. In particular we show examples in which the leftmost particle can be null recurrent, positive recurrent, ballistically transient, or subdiffusively transient. Finally we indicate the role of the initial condition in determining the dynamics, and show, for example, that sub-ballistic transience can occur started from close-packed initial configurations but not from stationary initial conditions.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03460v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Julia Adlercreutz",
      "Richard Pates"
    ],
    "title": "Cholesky factorisation, and intrinsically sparse linear quadratic regulation",
    "abstract": "We classify a family of matrices of shift operators that can be factorised in a computationally tractable manner with the Cholesky algorithm. Such matrices arise in the linear quadratic regulator problem, and related areas. We use the factorisation to uncover intrinsic sparsity properties in the control laws for transportation problems with an underlying tree structure. This reveals that the optimal control can be applied in a distributed manner that is obscured by standard solution methods.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03450v1",
    "categories": [
      "math.KT",
      "math.DG"
    ],
    "authors": [
      "Bo Liu",
      "Xiaonan Ma"
    ],
    "title": "$λ$-ring structure in differential K-theory",
    "abstract": "We establish the splitting principle for differential K-theory, a refinement of topological K-theory that incorporates geometric data via differential forms. Using this principle, we prove that the differential $K^0$-ring associated to closed smooth manifolds admits a $λ$-ring structure. This structure enables a concrete construction of the Adams operations in differential K-theory introduced by Bunke. At last, we extend all these results to an equivariant setting associated with a compact Lie group action.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03833v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Quentin Claus",
      "Jędrzej Hodor",
      "Gwenaël Joret",
      "Pat Morin"
    ],
    "title": "Excluding an apex-forest or a fan as quickly as possible",
    "abstract": "We show that every graph $G$ excluding an apex-forest $H$ as a minor has layered pathwidth at most $|V(H)|-2$, and that every graph $G$ excluding an apex-linear forest (such as a fan) $H$ as a minor has layered treedepth at most $|V(H)|-2$. We further show that both bounds are optimal. These results improve on recent results of Hodor, La, Micek, and Rambaud (2025): The first result improves the previous best-known bound by a multiplicative factor of $2$, while the second strengthens a previous quadratic bound. In addition, we reduce from quadratic to linear the bound on the $S$-focused treedepth $\\mathrm{td}(G,S)$ for graphs $G$ with a prescribed set of vertices $S$ excluding models of paths in which every branch set intersects~$S$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03832v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Daniele Garzoni",
      "Robert M. Guralnick",
      "Martin W. Liebeck"
    ],
    "title": "On a conjecture of Peter Neumann on fixed points in permutation groups",
    "abstract": "We prove a conjecture of Peter Neumann from 1966, predicting that every finite non-regular primitive permutation group of degree $n$ contains an element fixing at least one point and at most $n^{1/2}$ points. In fact, we prove a stronger version, where $n^{1/2}$ is replaced by $n^{1/3}$, and this is best possible. The case where $G$ is affine was proved by Guralnick and Malle; in this paper we address the case where $G$ is non-affine.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03830v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Jiaping Lu"
    ],
    "title": "Generation of Iterated Wreath Products Constructed from Almost Simple Groups",
    "abstract": "Let G1, G2, ... be a sequence of almost simple groups and construct a sequence (Wi) of wreath products via W1 = G1 and, for each i > 1, Wi+1 = Gi+1 wr Wi via the regular action of each Gi. We determine the minimum number d(Wi) of generators required for each wreath product in this sequence.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03807v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Isabel Hubard",
      "Micael Toledo"
    ],
    "title": "Highly symmetric unstable maniplexes",
    "abstract": "A maniplex of rank n s an n-valent properly edge-coloured graph that generalises, simultaneously, maps on surfaces and abstract polytopes. The problem of stability in maniplexes is a natural variant of the problem of stability in graphs. A maniplex is stable if every automorphism of its canonical double cover is a lift of some automorphism of the original maniplex. Due to their very rich structure, regular (maximally symmetric) maniplexes are always stable. It is thus natural to ask what is the maximum possible degree of symmetry that a maniplex that is not stable can admit. Symmetry in maniplexes is usually measured by the number of orbits on flags (nodes) of their automorphism group. A few families of unstable maniplexes with 4 flag-orbits are known for rank 3. In this paper, we show that 2-orbit maniplexes exist for every rank n > 2$.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03758v1",
    "categories": [
      "math.CO",
      "math.AC"
    ],
    "authors": [
      "Pintu Debnath"
    ],
    "title": "A concept of largeness of monochromatic sums and products in large ideal domain",
    "abstract": "An infinite integral domain $R$ is called a large ideal domain (LID) if every nontrivial ideal of $R$ has finite index in $R$. Recently, N. Hindman and D. Strauss have established a refinement of Moreira's theorem for the set of natural numbers and infinite fields. In this article, we prove the same result of N. Hindman and D. Strauss for large ideal domains (LID) and a polynomial extension.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03715v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Jérôme Le Rousseau",
      "Jeffrey B. Rauch"
    ],
    "title": "Timelike curves: homotopies and domain of determinacy",
    "abstract": "This paper studies domains of determination of linear strictly hyperbolic second order operators $P$. For an open set $\\mathcal O$, a set $Z$ is a domain of determination when the values of solutions of the differential equation $Pu=0$ are determined on $Z$ by their values in $\\mathcal O$. Fritz John's global Hölmgren theorem implies that points that can be reached by deformations of noncharacteristic hypersufaces with initial surface and boundaries in $\\mathcal O$ belong to a domain of determination provided that local uniqueness holds at noncharacteristic surfaces. Using spacelike hypersurfaces yields sharp finite speed results whose domains of determination are described in terms of influence curves that never exceed the local speed of propagation. This paper studies deformations of noncharacteristic nonspacelike hypersurfaces. We prove that points reachable by (repeated) deformations by noncharacteristic nonspacelike hypersurfaces coincide exactly with the set of points reachable by (repeated) homotopies of timelike arcs whose initial curves and endpoints belong to $\\mathcal O$. When the set $\\mathcal O$ is a small neighborhood of a forward timelike arc connecting $a$ to $b$, a natural candidate for $Z$ is the intesection of the future of $a$ with the past of $b$. This candidate is exact for D'Alembert's equation. We prove that it is also exact when $a,b$ are points close together on a fixed timelike arc. The timelike homotopy criterion fuels the construction of surprising examples for which the domain of determination is strictly larger (resp. strictly smaller) than the future-intersect-past candidate.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03705v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Simone Fabbri",
      "Vieri Mastropietro",
      "Bruno Renzi"
    ],
    "title": "Non-perturbative renormalization for lattice massive QED$_2$: the ultraviolet problem",
    "abstract": "We consider a lattice regularization, preserving Ward Identities (WI) and with a Wilson term, of the Massive QED$_2$, describing a fermion with mass $m$ and charge $\\mathsf{e}$ interacting with a vector field with mass $M$, in the regime $m\\ll M\\ll a^{-1}$ ($a$ being the lattice spacing) which is the suitable one to mimic a realistic 4d massive gauge theory like the Electroweak sector. The presence of the lattice and of the mass $m$ breaks any solvability property. In this paper we prove that the effective action obtained after the integration of the ultraviolet degrees of freedom is expressed by expansions which are convergent for values of the coupling $|\\mathsf{e}|\\le \\mathsf{e}_0$, with $\\mathsf{e}_0$ independent on $a$ and $m$, and with cut-off-independent bare parameters. By combining this result with the analysis of the infrared part in previous papers we get a complete construction of the model and a number of properties whose analogous are expected to hold in 4d. The analysis is done by integrating out the bosons and reducing to a fermionic theory; however, with respect to the case with momentum regularizations (which break essential features like the WI), the resulting effective fermionic action has not a simple form and this requires the developments of new methods to get the necessary bounds.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03694v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "Ved Prakash Gupta",
      "Deepika Sharma"
    ],
    "title": "Angles Between Intermediate Operator Subalgebras",
    "abstract": "Motivated by [2] and [5], the notions of interior and exterior angles between a pair of compatible intermediate W*-subalgebras of an inclusion of W*-algebras with a normal conditional expectation with finite probabilistic index are introduced. This is then employed effectively to define the interior angle between a pair of compatible intermediate C*-subalgebras of an inclusion of non-unital C*-algebras with a conditional expectation with finite Watatani index. It is also shown that the interior angle is stable under the minimal tensor product of unital C*-algebras.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03610v1",
    "categories": [
      "math.DS",
      "math-ph"
    ],
    "authors": [
      "Vesselin Petkov"
    ],
    "title": "Length spectrum of periodic rays for billard flow",
    "abstract": "We study for several compact strictly convex disjoint obstacles the length spectrum $\\mathcal L$ formed by the lengths of all primitive periodic reflecting rays. We prove the existence of sequences $\\{\\ell_j\\},\\: \\{m_j\\}$ with $\\ell_j \\in \\mathcal L,\\: m_j \\in \\mathbb N$ such that the condition (LB) related to the dynamical zeta function $η_D(s)$ is satisfied. This condition implies the existence of lower bounds for the number of the scattering resonances for Dirichlet Laplacian. We construct such sequences under some separation condition for a small subset of $\\mathcal L$ corresponding to lengths of the periodic rays with even reflexions. Our separation condition is weaker than the assumption of exponentially separated length spectrum $\\mathcal L.$ Moreover, we show that the periodic orbits in the phase space are exponentially separated.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03602v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Wei Wang",
      "Jun Ge"
    ],
    "title": "On enumeration of spanning trees of complete multipartite graphs containing a fixed spanning forest",
    "abstract": "We present a determinantal formula for the number of spanning trees of a complete multipartite graph containing a given spanning forest $F$. Our approach relies on the Generalized Matrix Determinant Lemma and Jacobi's formula for the derivative of a determinant. This work generalizes known results for complete bipartite graphs and offers an algebraic perspective on the problem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03601v1",
    "categories": [
      "math.CA",
      "math.AG"
    ],
    "authors": [
      "Shihao Wang",
      "Chenglong Yu",
      "Zhiwei Zheng"
    ],
    "title": "Double integrals and transformation formulas for Appell--Lauricella hypergeometric functions $F_D$",
    "abstract": "The monodromy of hypergeometric functions can govern the properties of the functions themselves. Previously, the second and third authors studied the commensurability relations among monodromy groups of the Appell--Lauricella hypergeometric functions using Deligne--Mostow theory and the geometric correspondence between curves and surfaces. In this paper, we apply the same construction to obtain transformation formulas among these hypergeometric functions. This also provides an alternative approach to some of Goursat's quadratic transformations via double integrals and Fubini's theorem.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03579v1",
    "categories": [
      "cs.IT",
      "cs.CR"
    ],
    "authors": [
      "Anjali Padmanabhan",
      "Danya Arun Bindhu",
      "Nujoom Sageer Karat",
      "Shanuja Sasi"
    ],
    "title": "Secure Decentralized Pliable Index Coding for Target Data Size",
    "abstract": "Decentralized Pliable Index Coding (DPIC) problem addresses efficient information exchange in distributed systems where clients communicate among themselves without a central server. An important consideration in DPIC is the heterogeneity of side-information and demand sizes. Although many prior works assume homogeneous settings with identical side-information cardinality and single message demands, these assumptions limit real-world applicability where clients typically possess unequal amounts of prior information. In this paper, we study DPIC problem under heterogeneous side-information cardinalities. We propose a transmission scheme that coordinates client broadcasts to maximize coding efficiency while ensuring that each client achieves a common target level $T$. In addition, we impose a strict security constraint that no client acquires more than the target $T$ number of messages, guaranteeing that each client ends up with exactly $T$ messages. We analyze the communication cost incurred by the proposed scheme under this security constraint.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03519v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Deniz Yeral"
    ],
    "title": "Open modular functors from non-finite tensor categories",
    "abstract": "We show that a compact rigid balanced braided monoidal category with enough compact projective objects gives rise to a system of mapping class group representations compatible with the gluing along marked intervals. A motivation to consider non-finite tensor categories is the theory of vertex operator algebras where such categories arise as categories of modules. The mapping class group representations presented in this article admit a factorization homology description. In other words, they are of three-dimensional origin and hence obey a holographic principle. A compact projective symmetric Frobenius algebra endows the representations with a pointing that is mapping class group invariant and compatible with the gluing along intervals. This shows that, at least to some extent, many of the tools for the construction and study of spaces of conformal blocks and correlators remain available in a non-finite, but rigid setting.",
    "date": "02-04"
  },
  {
    "link": "https://arxiv.org/pdf/2602.03508v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Galina Sidorenko",
      "Johan Thunberg"
    ],
    "title": "A necessary and sufficient condition for discrete-time consensus on star boundaries",
    "abstract": "It is intuitive and well known, that if agents in a multi-agent system iteratively update their states in the Euclidean space as convex combinations of neighbors' states, all states eventually converge to the same value (consensus), provided the interaction graph is sufficiently connected. However, this seems to be also true in practice if the convex combinations of states are mapped or radially projected onto any unit $l_p$-sphere or even boundaries of star-convex sets, herein referred to as star boundaries. In this paper, we present insight into this matter by providing a necessary and sufficient condition for asymptotic consensus of the normalized states (directions) for strongly connected directed graphs, which is equivalent to asymptotic consensus of states when the star boundaries are the same for all agents. Furthermore, we show that when asymptotic consensus occurs, the states converge linearly and the point of convergence is continuous in the initial states. Assuming a directed strongly connected graph provides a more general setting than that considered, for example, in gradient-based consensus protocols, where symmetric graphs are assumed. Illustrative examples and a vast number of numerical simulations showcase the theoretical results.",
    "date": "02-04"
  }
]