[
  {
    "link": "https://arxiv.org/pdf/2602.09729v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Chaoyi Cai",
      "Qiqin Cheng",
      "Di Wu",
      "Jianxian Qiu"
    ],
    "title": "Beyond Free-Stream Preservation: Transport Polynomial Exactness for Moving-Mesh Methods under Arbitrary Mesh Motion",
    "abstract": "High-order moving-mesh methods can effectively reduce numerical diffusion, but their formal accuracy typically relies on the regularity of the mesh velocity. This dependency creates a fundamental conflict in the numerical solution of hyperbolic conservation laws, where solution-driven adaptation may induce nonsmooth mesh motion, thereby degrading convergence order. We introduce \\emph{transport polynomial exactness} (TPE($k$)), a mesh-motion-independent criterion that generalizes classical free-stream preservation (TPE(0)) to the exact advection of degree-$k$ polynomials. We show that the classical geometric conservation law (GCL) is insufficient to ensure TPE($k$) for $k \\ge 1$ due to mismatches in higher-order geometric moments. To resolve this, we propose \\emph{evolved geometric moments} (EGMs), obtained by solving auxiliary transport equations discretized compatibly with the physical variables. We rigorously prove that second-degree EGMs evolved via the third-order strong stability preserving Runge--Kutta (SSPRK3) method coincide with the exact geometric moments. This exactness arises from a \\emph{superconvergence} mechanism wherein SSPRK3 reduces to Simpson's rule for EGM evolution. Leveraging this result, we construct a third-order conservative finite-volume rezoning moving-mesh scheme. The scheme satisfies the TPE(2) property for \\emph{arbitrary mesh motion} and \\emph{any pseudo-time step size}, thereby naturally accommodating spatiotemporally discontinuous mesh velocity. Crucially, this \\emph{breaks the efficiency bottleneck} in the conventional advection-based remapping step and reduces the required pseudo-time levels from $\\mathcal{O}(h^{-1})$ to $\\mathcal{O}(1)$ under bounded but discontinuous mesh velocity. Numerical experiments verify exact quadratic transport and stable third-order convergence under extreme mesh deformation, demonstrating substantial efficiency gains.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09643v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Nils Lid Hjort"
    ],
    "title": "A simple proof of the discreteness of Dirichlet processes",
    "abstract": "That Dirichlet processes are discrete with probability 1 is demonstrated once more. And yes, these two pages spent fifty years in Norwegian.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09607v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Andreea I. Bordianu",
      "Mircea Cimpoeas"
    ],
    "title": "On the Hilbert depth of the quotient ring of the edge ideal of a complete bipartite graph",
    "abstract": "Let $n\\geq m$ be two positive integers, $S_{n,m}=K[x_1,\\ldots,x_n,y_1,\\ldots,y_m]$ and $I_{n,m}=(x_iy_j\\;:\\;1\\leq i\\leq n,1\\leq j\\leq m)\\subset S_{n,m}$ the edge ideal of a complete bipartite graph. Denote $h(n,m)=\\operatorname{hdepth}(S_{n,m}/I_{n,m})$. We prove that $h(n,m)\\geq \\left\\lceil \\frac{n}{2} \\right\\rceil$ and the equality holds if $m$ belong to a certain interval centered in $\\left\\lceil \\frac{n} {2} \\right\\rceil$. Also, we find some tight bounds for $h(n,n)$ and we prove several inequalities between $h(n,m)$ and $h(n,m')$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09603v1",
    "categories": [
      "math.QA",
      "hep-th",
      "math-ph"
    ],
    "authors": [
      "Michel Dubois-Violette",
      "Blas Torrecillas"
    ],
    "title": "Clifford algebras, meson algebras and higher order generalisations",
    "abstract": "We analyse the homogeneous parts of Clifford and meson algebras and point out that for the Clifford algebra it is related to fermionic statistics, that is, to fermionic parastatistics of order 1 while for the meson algebra it is related to fermionic parastatistics of order 2. We extend these homogeneous algebras into corresponding algebras related to fermionic parastatistics of all orders. We then define correspondingly higher order generalizations of Clifford and meson algebras.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09539v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Susana Lopez-Moreno",
      "June-Ho Lee",
      "Taehyeong Kim"
    ],
    "title": "Tensor CUR Decomposition under the Linear-Map-Based Tensor-Tensor Multiplication",
    "abstract": "The factorization of three-dimensional data continues to gain attention due to its relevance in representing and compressing large-scale datasets. The linear-map-based tensor-tensor multiplication is a matrix-mimetic operation that extends the notion of matrix multiplication to higher order tensors, and which is a generalization of the T-product. Under this framework, we introduce the tensor CUR decomposition, show its performance in video foreground-background separation for different linear maps and compare it to a robust matrix CUR decomposition, another tensor approximation and the slice-based singular value decomposition (SS-SVD). We also provide a theoretical analysis of our tensor CUR decomposition, extending classical matrix results to establish exactness conditions and perturbation bounds.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09527v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Evangelos Papoutsellis",
      "Zeljko Kereta",
      "Kostas Papafitsoros"
    ],
    "title": "Split, Skip and Play: Variance-Reduced ProxSkip for Tomography Reconstruction is Extremely Fast",
    "abstract": "Many modern iterative solvers for large-scale tomographic reconstruction incur two major computational costs per iteration: expensive forward/adjoint projections to update the data fidelity term and costly proximal computations for the regulariser, often done via inner iterations. This paper studies for the first time the application of methods that couple randomised skipping of the proximal with variance-reduced subset-based optimisation of data-fit term, to simultaneously reduce both costs in challenging tomographic reconstruction tasks. We provide a series of experiments using both synthetic and real data, demonstrating striking speed-ups of the order 5x--20x compared to the non-skipped counterparts which have been so far the standard approach for efficiently solving these problems. Our work lays the groundwork for broader adoption of these methods in inverse problems.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09511v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Laurent Clozel",
      "Arno Kret",
      "Olivier Taïbi"
    ],
    "title": "Invariance Galoisienne des zéros centraux de fonctions L",
    "abstract": "Nous démontrons l'invariance Galoisienne de la propriété d'annulation en $1/2$ des fonctions L standard ou de Rankin-Selberg pour certaines représentations automorphes cuspidales algébriques régulières autoduales ou autoduales conjuguées de groupes linéaires sur un corps de nombres arbitraire. La démonstration repose sur l'utilisation de la cohomologie pondérée de Goresky-Harder-MacPherson et sur la construction de certaines représentations automorphes discrètes pour les groupes classiques comme résidus de séries d'Eisenstein. L'abandon de l'hypothèse ``$F$ totalement réel'' introduit de nouvelles difficultés concernant certains opérateurs d'entrelacement. Celles-ci sont résolues grâce à l'appendice, rédigé par J.-L. Waldspurger et l'un d'entre nous, démontrant l'holomorphie et la non-annulation de certains opérateurs d'entrelacement normalisés. Nous démontrons également l'invariance Galoisienne des facteurs epsilon correspondants, impliquant l'invariance Galoisienne de la parité de l'ordre d'annulation en $1/2$ de ces fonctions $L$. -- We prove the invariance under the Galois group of the vanishing at $1/2$ of standard and Rankin-Selberg L-functions for certain self-dual or conjugate self-dual algebraic cuspidal automorphic representations for general linear groups over an arbitrary number field. The proof uses Goresky-Harder-MacPherson weighted cohomology and the construction of certain discrete automorphic representations for classical groups as residues of Eisenstein series. New difficulties appear concerning certain intertwining operators. These are solved in the appendix by J.-L. Waldspurger and O. Taïbi proving the holomorphy and non-vanishing of these operators. We also prove the Galois invariance of epsilon factors, implying Galois invariance of the parity of the order at $1/2$ of L-functions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09376v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Masahiro Kaminaga"
    ],
    "title": "Schrödinger operators with concentric $δ$--shell interactions",
    "abstract": "We study Schrödinger operators on $\\mathbb R^3$ with finitely many concentric spherical $δ$--shell interactions. The operators are defined by the quadratic form method and are described by continuity across each shell together with the usual jump condition for the radial derivative. Using a boundary integral approach based on the free Green kernel and single--layer potentials, we derive an explicit resolvent representation for an arbitrary number of shells with bounded coupling strengths. This yields a concrete Kreĭn--type formula and a boundary operator whose noninvertibility characterizes the discrete spectrum, and it is compatible with a partial--wave reduction under rotational symmetry.\n  We then specialize to the two--shell case with constant couplings and obtain a detailed description of the negative spectrum. In particular, we show that the ground state (when it exists) lies in the $s$--wave sector and derive an explicit secular equation for bound states. For large shell separation, each bound level approaches the corresponding single--shell level with exponentially small corrections, while a genuine tunneling splitting appears when the single--shell levels are tuned to coincide. As a simple calibration, we relate the two--shell parameters to representative core--shell quantum dot scales. At the level of order--of--magnitude and qualitative trends, Type~I configurations yield a relatively strongly confined state, whereas Type~II configurations produce a comparatively shallow outer--shell state.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09359v1",
    "categories": [
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Yukinobu Toda"
    ],
    "title": "A proof of Dolbeault geometric Langlands for $\\GL_2$ with reduced spectral curves",
    "abstract": "In our previous paper with Tudor Pădurariu, we introduced the notion of limit categories for moduli stacks of Higgs bundles and formulated the Dolbeault geometric Langlands correspondence. These limit categories are expected to provide an effective ``classical limit'' of the categories of D-modules on the moduli stack of bundles, and our formulation links categorical Donaldson-Thomas theory with the geometric Langlands correspondence.\n  In this paper, we prove the above Dolbeault geometric Langlands correspondence for $\\GL_2$ over the locus in the Hitchin base where the spectral curves are reduced. This is the first non-trivial case in which the relevant moduli stacks are not quasi-compact, and the use of limit categories is essential to the formulation and proof of the correspondence.\n  Our approach also outlines a strategy for proving the correspondence in greater generality and explains the current obstructions to such an extension.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09344v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Cheng Liao"
    ],
    "title": "Stable Canonical Rules for Intuitionistic Modal Logics",
    "abstract": "This paper develops stable canonical rules for intuitionistic modal logics, which were first introduced for superintuitionistic logics and transitive nor mal modal logics in [1] and [2] respectively. We first prove that every in tuitionistic modal multi-conclusion consequence relation is axiomatizable by stable canonical rules. This allows us to assume, without loss of generality, that rules considered by us are stable canonical ones. The idea turns out to be useful. In particular, using stable canonical rules, we get an alterna tive proof of the Blok-Esakia theorem for intuitionistic modal logics which was first proved in [3] and generalize it to multi-conclusion consequence re lations. We also prove the Dummett-Lemmon conjecture for intuitionistic modal multi-conclusion consequence relations, which, as far as we know, is a new result.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09342v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Kohki Iba"
    ],
    "title": "Hitting Probabilities of Finite Points for One-Dimensional Lévy Processes",
    "abstract": "For a one-dimensional Lévy process, we derive an explicit formula for the probability of first hitting a specified point among a fixed finite set. Moreover, using this formula, we obtain an explicit expression for each entry of the $Q$-matrix of the trace process on the finite set. These formulas involve solely the renormalized zero resolvent.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09285v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Alen Alexanderian",
      "Steven Maio"
    ],
    "title": "Submodularity of the expected information gain in infinite-dimensional linear inverse problems",
    "abstract": "We consider infinite-dimensional linear Gaussian Bayesian inverse problems with uncorrelated sensor data, and focus on the problem of finding sensor placements that maximize the expected information gain (EIG). This study is motivated by optimal sensor placement for linear inverse problems constrained by partial differential equations (PDEs). We consider measurement models where each sensor collects a single-snapshot measurement. This covers sensor placement for inverse problems governed by linear steady PDEs or evolution equations with final-in-time observations. It is well-known that in the finite-dimensional (discretized) formulations of such inverse problems, EIG is a monotone submodular function. This also entails a theoretical guarantee for greedy sensor placement in the discretized setting. We extend the result on submodularity of the EIG to the infinite-dimensional setting, proving that the approximation guarantee of greedy sensor placement remains valid in the infinite-dimensional limit. We also discuss computational considerations and present strategies that exploit problem structure and submodularity to yield an efficient implementation of the greedy procedure.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09265v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Thomas Führer",
      "Gregor Gantner",
      "Norbert Heuer"
    ],
    "title": "Boundary elements for clamped Kirchhoff--Love plates",
    "abstract": "We present a Galerkin boundary element method for clamped Kirchhoff--Love plates with piecewise smooth boundary. It is a direct method based on the representation formula and requires the inversion of the single-layer operator and an application of the double-layer operator to the Dirichlet data. We present trace approximation spaces of arbitrary order, required for both the Dirichlet data and the unknown Neumann trace. Our boundary element method is quasi-optimal with respect to the natural trace norm\n  and achieves optimal convergence order under minimal regularity assumptions. We provide explicit representations of both boundary integral operators and discuss the implementation of the appearing integrals. Numerical experiments for smooth and non-smooth domains confirm predicted convergence rates.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09242v1",
    "categories": [
      "math.HO",
      "cs.CY"
    ],
    "authors": [
      "Felix De la Cruz Serrano"
    ],
    "title": "Open Mathematical Tasks as a Didactic Response to Generative Artificial Intelligence in Post-AI Contexts",
    "abstract": "The widespread availability of generative artificial intelligence tools poses new challenges for school mathematics education, particularly regarding the formative role of traditional mathematical tasks. In post-AI educational contexts, many activities can be solved automatically, without engaging students in interpretation, decision-making, or mathematical validation processes.\n  This study analyzes a secondary school classroom experience in which open mathematical tasks are implemented as a didactic response to this scenario, aiming to sustain students' mathematical activity. Adopting a qualitative and descriptive-interpretative approach, the study examines the forms of mathematical work that emerge during task resolution, mediated by the didactic regulation device COMPAS.\n  The analysis is structured around four analytical axes: open task design in post-AI contexts, students' mathematical agency, human-AI complementarity, and modeling and validation practices. The findings suggest that, under explicit didactic regulation, students retain epistemic control over mathematical activity, even in the presence of generative artificial intelligence.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09201v1",
    "categories": [
      "math.AG",
      "math.AC"
    ],
    "authors": [
      "Yairon Cid-Ruiz",
      "Anurag K. Singh"
    ],
    "title": "Generic flatness of the cohomology of thickenings",
    "abstract": "Given a set of $m$ distinct points in projective space over a field, and $t$ a positive integer, a classical question asks for the least degree of a hypersurface that passes through each point with multiplicity at least $t$. Related to this, it remains unresolved whether there exists a dense open set of $m$-tuples of points for which this least degree is constant for each $t\\ge 1$. We formulate a conjecture regarding the generic freeness of certain local cohomology modules that would answer this in the affirmative; we then prove this conjecture for up to $n+2$ points in projective $n$-space over a field. In a related direction, we prove a generic flatness result for the cohomology of thickenings of a closed subscheme of projective space over an integral domain.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09152v1",
    "categories": [
      "math.SP",
      "math-ph",
      "math.CA"
    ],
    "authors": [
      "Steven Redolfi",
      "Rudi Weikard"
    ],
    "title": "Self-adjoint extensions of symmetric relations associated with systems of ordinary differential equations with distributional coefficients",
    "abstract": "We study the extension theory for the two-dimensional first-order system $Ju' +qu = wf$ of differential equations on the real interval $(a,b)$ where $J$ is a constant, invertible, skew-hermitian matrix and $q$ and $w$ are matrices whose entries are real distributions of order $0$ with $q$ hermitian and $w$ non-negative. Specifically, we characterize the boundary conditions for solutions $u$ in the closure of the minimal relation, as well as describe the properties of quasi-boundary conditions which yield self-adjoint extensions. We then apply these ideas to a popular extension of non-negative minimal relations: the Krein-von Neumann extension. For more context on how the Krein-von Neumann is defined, an appendix shows a construction of the Friedrichs extension from which the Krein-von Neumann is traditionally defined.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09151v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Philippe Bouafia"
    ],
    "title": "Non-absolute integration and application to Young geometric integration",
    "abstract": "We survey several non-absolutely convergent integrals, including the Henstock-Kurzweil and Pfeffer integrals, and use ideas from these theories to investigate the problem of multidimensional Young integration. We further present results on Young geometric integration, namely the integration of certain generalized differential forms over $m$-dimensional subsets of $\\mathbb{R}^d$. This is achieved by introducing appropriate notions of chains and cochains, in the spirit of Whitney's geometric integration theory.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09143v1",
    "categories": [
      "math.FA",
      "math.GN",
      "math.LO"
    ],
    "authors": [
      "Maciej Korpalski",
      "Piotr Koszmider",
      "Witold Marciszewski"
    ],
    "title": "Counting spaces of functions on separable compact lines",
    "abstract": "We investigate the following general problem, closely related to the problem of isomorphic classification of Banach spaces $C(K)$ of continuous real-valued functions on a compact space $K$, equipped with the standard supremum norm:Let $\\mathcal{K}$ be a class of compact spaces. How many isomorphism types of Banach spaces $C(K)$ of real-valued continuous functions on $K$ are there, for $K\\in \\mathcal{K}$?\n  We prove that for any uncountable regular cardinal number $κ$, there exist exactly $2^κ$ isomorphism types of spaces $C(K)$ for compact spaces of weight $κ$.\n  We show that, for the class $\\mathcal{L}_{ω_1}$ of separable compact linearly ordered spaces of weight $ω_1$, the answer to the above question depends on additional set-theoretic axioms. In particular, assuming the continuum hypothesis, there are $2^{2^ω}$ isomorphism types of $C(L)$, for $L\\in \\mathcal{L_{ω_1}}$, and assuming a certain axiom proposed by Baumgartner, there is only one type.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09122v1",
    "categories": [
      "math.DG",
      "math-ph"
    ],
    "authors": [
      "Adam Lindström",
      "Marko Sobak"
    ],
    "title": "Spherically symmetric Dirac-Yang-Mills pairs on Riemannian 3-manifolds",
    "abstract": "In this paper we construct examples of spherically symmetric Dirac-Yang-Mills pairs on Riemannian 3-manifolds with the structure group SU(2). This approach yields coupled solutions (i.e. the connection is not a Yang-Mills connection) and among them are solutions on S^1(r_1) x S^2(r_2) for certain radii r_1 and r_2. These are, to the authors' best knowledge, the first examples of coupled Dirac-Yang-Mills pairs on a closed Riemannian spin manifold.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09106v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "William B. Johnson",
      "Tomasz Kania"
    ],
    "title": "Uniform Property (S)",
    "abstract": "We introduce and investigate a quantitative version of Steinhaus' property $(S)$ for Banach spaces, called the uniform property $(S)$. A Banach space $X$ is said to have uniform $(S)$ if for every pair of distinct unit vectors $x,y\\in X$ and every $a>0$, the difference of the perturbed norms \\[\n  \\sup_{\\|z\\|\\le a}\\big|\\|x+z\\|-\\|y+z\\|\\big| \\] is bounded below by a positive function of $a$ and $\\|x-y\\|$. We compute this modulus exactly for the spaces $L_1(μ)$ with atomless measure $μ$, \\[\n  U_{L_1(μ)}(d;a)=\\Big(\\tfrac{4a}{2+d}\\wedge 1\\Big)d, \\] The class of spaces with uniform $(S)$ is stable under ultrapowers, Bochner-$L_1$ constructions, and contains all Gurariĭ spaces as well as Banach lattices of almost universal disposition. In particular, every Banach space embeds isometrically into a non-strictly convex Banach space of the same density having uniform $(S)$. We further exhibit an explicit equivalent renorming of $\\ell_1(Γ)$, \\[\n  \\|x\\|_S=\\big(\\|x\\|_1^2+\\|x\\|_2^2\\big)^{1/2}, \\] which endows $\\ell_1(Γ)$ and all its ultrapowers with uniform $(S)$. These results settle, in ZFC, several open questions about the quantitative geometry of property $(S)$ posed by Kochanek and the second-named author.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09073v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Sagar Mandal",
      "Neetu"
    ],
    "title": "Exact and Asymptotic Counts of MSTD, MDTS, and Balanced Sets in Dicyclic Groups",
    "abstract": "We investigate the relationship between the sizes of the sum and difference sets of the Dicyclic Group $\\mathrm{Dic}_{4n}$. We first determine the exact numbers of MSTD (more sums than differences), MDTS (more differences than sums), and balanced subsets of size two. As a consequence, we show that the numbers of MSTD and balanced subsets of size two are asymptotically equal as $n \\to \\infty$. For odd $n$, we then obtain exact counts of MSTD, MDTS, and balanced subsets of size three, with the results depending on whether $n$ is divisible by $3$. In this case, we establish that asymptotically the number of MSTD subsets of size three is six times the number of MDTS subsets and also six times the number of balanced subsets. Finally, we establish a lower bound for the number of MSTD, MDTS, and balanced subsets of $\\mathrm{Dic}_{4n}$ corresponding to the boundary case of size $2n$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09057v1",
    "categories": [
      "math.NA",
      "cs.LG",
      "math.OC"
    ],
    "authors": [
      "Zhipeng Chang",
      "Wenrui Hao",
      "Nian Liu"
    ],
    "title": "SVD-Preconditioned Gradient Descent Method for Solving Nonlinear Least Squares Problems",
    "abstract": "This paper introduces a novel optimization algorithm designed for nonlinear least-squares problems. The method is derived by preconditioning the gradient descent direction using the Singular Value Decomposition (SVD) of the Jacobian. This SVD-based preconditioner is then integrated with the first- and second-moment adaptive learning rate mechanism of the Adam optimizer. We establish the local linear convergence of the proposed method under standard regularity assumptions and prove global convergence for a modified version of the algorithm under suitable conditions. The effectiveness of the approach is demonstrated experimentally across a range of tasks, including function approximation, partial differential equation (PDE) solving, and image classification on the CIFAR-10 dataset. Results show that the proposed method consistently outperforms standard Adam, achieving faster convergence and lower error in both regression and classification settings.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09027v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Bin Chen",
      "Pan Feng"
    ],
    "title": "Entropy-Based Evidence for Bitcoin's Discrete Time Mechanism",
    "abstract": "Bitcoin derives a verifiable temporal order from probabilistic block discovery and cumulative proof-of-work rather than from a trusted global clock. We show that block arrivals exhibit stable exponential behavior across difficulty epochs, and that the proof-of-work process maintains a high-entropy search state that collapses discretely upon the discovery of a valid block. This entropy-based interpretation provides a mechanistic account of Bitcoin's non-continuous temporal structure. In a distributed network, however, entropy collapse is not completed instantaneously across all participants. Using empirical observations of temporary forks, we show that collapse completion unfolds over a finite propagation-bounded interval, while remaining rapid in practice.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09117v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Siddarth Kannan"
    ],
    "title": "Euler characteristics of the universal Picard stack",
    "abstract": "We study $\\mathbb{S}_n$-equivariant topological and weight-graded compactly-supported Euler characteristics of the universal Picard stack $\\mathrm{Pic}_{g, n}^d \\to \\mathcal{M}_{g, n}$ of degree-$d$ line bundles over $\\mathcal{M}_{g, n}$. We prove that in the weight-zero and topological cases, the generating function for Euler characteristics of $\\mathrm{Pic}_{g, n}^d$ is obtained from the corresponding one for $\\mathcal{M}_{g, n}$ by an extremely simple combinatorial transformation. This lets us deduce closed formulas for the two generating functions, taking as input the Chan--Faber--Galatius--Payne formula in the weight-zero case and Gorsky's formula in the topological case. As a corollary, we also obtain a closed formula for the topological Euler characteristic of $\\mathrm{Pic}^d_g$. Our weight-zero calculation is a corollary of a general result passing from the weight-graded Euler characteristics of $\\mathcal{M}_{g, n}$ to those of $\\mathrm{Pic}_{g,n}^d$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09048v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "N. A. Carella"
    ],
    "title": "Equidistribution of Primitive Normal Elements in Finite Fields",
    "abstract": "Let $q=p^k$ be a prime power, let $n\\geq2$ be an integer and let $\\mathbb{F}_{q^n}$ be a finite field. It is shown that the set of primitive normal elements is a Salem set. Furthermore, it is proved that this set is strongly equidistributed in the finite field. Similar results are proved for the set of quadratic residues and the set of primitive roots modulo a large prime $p\\geq 3$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09029v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Alex Shvets"
    ],
    "title": "Universal Asymptotics for Jensen--Shannon Divergence under Shuffling",
    "abstract": "We study the Jensen--Shannon divergence (JSD) between transcript distributions induced by neighboring datasets in the shuffle model when each user applies a fixed local randomizer and a trusted shuffler releases the output histogram. Under a mild positivity assumption, we prove an explicit two-term asymptotic expansion where the leading term is chi-squared divergence divided by 8n. Binary randomized response and k-ary randomized response follow as corollaries. For multi-message protocols based on independent repetition, the leading coefficient becomes (1 + chi-squared)^m - 1. A fully explicit remainder control is provided in the appendix.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09592v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Saharon Shelah"
    ],
    "title": "Super Black Boxes Revisited",
    "abstract": "Let $ κ, θ< λ$ be cardinals, with $λ$ and $κ$ regular. Concentrating on a simple case, we say that the triple $(λ,κ,θ)$ has a Super Black Box when the following holds.\n  For some stationary $S \\subseteq \\{δ< λ: cf(δ) = κ\\}$ and $\\overline C = \\langle C_δ: δ\\in S \\rangle$, where $C_δ$ is a club of $δ$ of order type $κ$, for every coloring $\\overline F = \\langle F_δ: δ\\in S \\rangle$ with $F_δ: {}^{C_δ}λ\\to θ$, there exists $\\langle c_δ: δ\\in S\\rangle \\in {}^S\\!θ$ such that for every $f : λ\\to θ$, for stationarily many $δ\\in S$, we have $F_δ(f \\upharpoonright C_δ) = c_δ$.\n  In an earlier work, it was proved (along with much more) that for a class of cardinals $λ$ this holds for many pairs $(κ,θ)$. E.g.~$κ< \\aleph_ω$ is large enough, and $\\beth_ω(θ) < λ$. However, the most interesting cases (at least with regards to Abelian groups) are $κ= \\aleph_0,\\aleph_1$ (which have not been covered yet).\n  Here we restrict ourselves to the case where $\\overline F$ is a {so-called} \\emph{continuous coloring}, which includes the case where $F_δ$ is computed from some $$ \\big\\langle F_{δ,β}'(f \\upharpoonright (C_δ\\cap β)) : β\\in C_δ\\big\\rangle. $$\n  This covers the cases we have in mind. We mainly prove results without any other caveats: e.g.\n  For every regular $κ$ and $θ$ there exists such a $λ$.\n  We also deal with having multiple {$\\bar C$-s}, and the existence of quite free subsets of ${}^κμ$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09560v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Nguyen Nang Thieu",
      "Nguyen Dong Yen"
    ],
    "title": "Optimization Problems with Nearly Convex Objective Functions and Nearly Convex Constraint Sets",
    "abstract": "To every nearly convex optimization problem, that is a minimization problem with a nearly convex objective function and a nearly convex constraint set, we associate a uniquely defined convex optimization problem with a lower semicontinuous objective function and a closed constraint set. Interesting relationships between the original nearly convex problem and the associated convex problem are established. Optimality conditions in the form of Fermat's rules are obtained for both problems. We then get a Lagrange multiplier rule for a nearly convex optimization problem under a geometrical constraint and functional constraints from the Kuhn-Tucker conditions for the associated convex optimization problem. The obtained results are illustrated by concrete examples.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09559v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Tomasz Brzeziński",
      "A. T. M. West"
    ],
    "title": "Ore meets homothetic extensions",
    "abstract": "Sufficient and necessary conditions for an extension of a skew-derivation $(δ_R,α_R)$ of an associative $\\mathbb{F}$-algebra $R$ to a skew derivation $(δ_S,α_S)$ on an extension $S$ of $R$ by $\\mathbb{F}$ or a {\\em homothetic extension $S$ of $R$ by $\\mathbb{F}$} are derived. It is then shown that this yields the unique extension of the Ore extension $R[x;α_R,δ_R]$ of $R$ by $\\mathbb{F}$ that embeds in the Ore extension $S[x;α_S,δ_S]$ of $S$ by the extended skew-derivation.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09481v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Somdatta Barik",
      "Anirban Sen",
      "Kallol paul"
    ],
    "title": "Numerical range and Berezin range of weighted composition operators on weighted Dirichlet spaces",
    "abstract": "We investigate the numerical ranges of weighted composition operators on weighted Dirichlet spaces, focusing on the properties of the inducing functions. We identify conditions on these functions under which the origin lies in the interior of the numerical range. The geometric structure of the numerical range is also analyzed, determining when it contains a circular or elliptical disc and computing the corresponding radius. Next, we introduce a class of Weyl-type weighted composition operators and obtain their Berezin range and Berezin number. Finally, we characterize the convexity of the Berezin range for weighted composition operators on these spaces.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09436v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Hao Wu",
      "Wan-Tong Li",
      "Jian-Wen Sun",
      "Hoang-Hung Vo"
    ],
    "title": "Principal spectral theory and asymptotic analysis for time-periodic cooperative systems with temporally nonlocal dispersal",
    "abstract": "This paper investigates the principal spectral theory and the asymptotic behavior of the principal spectrum point for a class of time-periodic cooperative systems with nonlocal dispersal operators, incorporating both coupled and uncoupled nonlocal terms. By applying the theory of resolvent positive operators and their perturbations, we first establish criteria for the existence of the principal eigenvalue. We then construct sequences of smooth upper and lower approximating matrix-valued functions, each of whose corresponding operators satisfies the principal eigenvalue existence condition. This approximation framework allows the principal spectrum point to effectively substitute for the principal eigenvalue in characterizing the global dynamics of the nonlinear system. Moreover, it facilitates the study of the asymptotic behavior of the principal spectrum point with respect to parameters under fairly general assumptions. Subsequently, for systems with both coupled and uncoupled nonlocal terms, we analyze the asymptotic behavior of the principal spectrum point in terms of the dispersal rate, dispersal range, and frequency. Finally, we illustrate the applicability of our theoretical results through a Zika virus model and a stem cell model.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09356v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Dimitri Konen",
      "Gilles Stupfler"
    ],
    "title": "Regularized geometric quantiles and universal linear distribution functionals",
    "abstract": "Geometric quantiles are popular location functionals to build rank-based statistical procedures in multivariate settings. They are obtained through the minimization of a non-smooth convex objective function. As a result, the singularity of the directional derivatives leads to numerical instabilities and poor sample properties as well as surprising `phase transitions' from empirical to population distributions. To solve these issues, we introduce a regularized version of geometric distribution functions and quantiles that are provably close to the usual geometric concepts and share their qualitative properties, both in the empirical and continuous case, while allowing for a much broader applicability of asymptotic results without any moment condition. We also show that any linear assignment of probability measures (such as the univariate distribution function), that is also translation- and orthogonal-equivariant, necessarily coincides with one of our regularized geometric distribution functions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09253v1",
    "categories": [
      "math.GR",
      "math.CV"
    ],
    "authors": [
      "Miroslav Marinov",
      "Nikola Veselinov"
    ],
    "title": "Solvability of meromorphic equations in elementary functions",
    "abstract": "An equation $f(x)=a$, where $f$ is a complex meromorphic function and $a\\in\\mathbb{C}$ is a parameter, is solvable in elementary functions if the inverse map $x=f^{-1}(a)$ can be expressed as a finite composition of arithmetic operations (addition, subtraction, multiplication, and division), the exponential function, the complex logarithm, and constants. Specific functions such as $\\tan x - x$, $\\exp x + x$, $x^x$ have been proven to be unsolvable by Kanel-Belov, Malistov, Zaytsev, while almost all entire surjective functions of at most exponential growth have been covered by Zelenko. All these rely on one-dimensional topological Galois theory, developed by Khovanskii. We generalize to provide a proof for the unsolvability of all elementary meromorphic functions $f$ such that the derivative of $f$ has infinitely many roots $x_i$ and the set of distinct values $f(x_i)$ is infinite.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09228v1",
    "categories": [
      "math.NT",
      "math.DS"
    ],
    "authors": [
      "Hao Cheng",
      "Harold Erazo",
      "Carlos Gustavo Moreira",
      "Thiago Vasconcelos"
    ],
    "title": "On the geometry of the second Lagrange spectra",
    "abstract": "The Lagrange spectrum $L$ is the set of finite values of the best approximation constants $k(α)=\\limsup_{|p|,|q|\\to \\infty}|q(qα-p)|^{-1}$, where $α\\in \\mathbb{R}\\setminus \\mathbb{Q}$. It is a classical result that the pairs $(p,q)$ attaining these approximation constants arise from the convergents $(p_n,q_n)$ of the continued fraction of $α$. Consequently, $k(α)=\\limsup_{n\\to\\infty}|q_n(q_nα-p_n)|^{-1}$. Moreira proved that the function $d(t)=HD(L\\cap(-\\infty,t))$ where $HD$ denotes Hausdorff dimension, is continuous.\n  Second Lagrange spectra are defined analogously to the classical Lagrange spectrum, but are associated with the problem of approximating an irrational number $α$ by rational numbers $\\frac{p}{q}$ that are not convergents of its continued fraction expansion. Two natural definitions arise depending on whether rational multiples $(p,q)=(kp_n,kq_n),k\\geq 2$ which represent the same rational numbers as convergents, are allowed or excluded. Based on this distinction, Moshchevitin introduced two second Lagrange spectra, denoted $L_2$ and $L_2^*$.\n  We prove that the function $d_2(t)=HD(L_2\\cap (-\\infty,t))$ is continuous, whereas $d_2^*(t)=HD(L_2^*\\cap (-\\infty,t))$ is discontinuous and assumes only the values 0 and 1.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09198v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Mauro Bonafini",
      "Davide Torlo",
      "Elena Gaburro"
    ],
    "title": "Stability analysis of Arbitrary-Lagrangian-Eulerian ADER-DG methods on classical and degenerate spacetime geometries",
    "abstract": "In this paper, we present a thorough von Neumann stability analysis of explicit and implicit Arbitrary-Lagrangian-Eulerian (ALE) ADER discontinuous Galerkin (DG) methods on classical and degenerate spacetime geometries for hyperbolic equations. First, we rigorously study the CFL stability conditions for the explicit ADER-DG method, confirming results widely used in the literature while specifying their limitations. Moreover, we highlight under which conditions on the mesh velocity the ALE methods, constrained to a given CFL, are actually stable. Next, we extend the stability study to ADER-DG in the presence of degenerate spacetime elements, with zero size at the beginning and the end of the time step, but with a non zero spacetime volume. This kind of elements has been introduced in a series of articles on direct ALE methods by Gaburro et al. to connect via spacetime control volumes regenerated Voronoi tessellations after a topology change. Here, we imitate this behavior in 1d by fictitiously inserting degenerate elements in between two cells. Then, we show that over this degenerate spacetime geometry, both for the explicit and implicit ADER-DG, the CFL stability constraints remain the same as those for classical geometries, laying the theoretical foundations for their use in the context of ALE methods.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09176v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Eyyup Tasci",
      "Victoria Kostina"
    ],
    "title": "Dispersion of Gaussian Sources with Memory and an Extension to Abstract Sources",
    "abstract": "We consider finite blocklength lossy compression of information sources whose components are independent but non-identically distributed. Crucially, Gaussian sources with memory and quadratic distortion can be cast in this form. We show that under the operational constraint of exceeding distortion $d$ with probability at most $ε$, the minimum achievable rate at blocklength $n$ satisfies $R(n, d, ε)=\\mathbb{R}_n(d)+\\sqrt{\\frac{\\mathbb{V}_n(d)}{n}}Q^{-1}(ε)+O \\left(\\frac{\\log n}{n}\\right)$, where $Q^{-1}(\\cdot)$ is the inverse $Q$-function, while $\\mathbb{R}_n(d)$ and $\\mathbb{V}_n(d)$ are fundamental characteristics of the source computed using its $n$-letter joint distribution and the distortion measure, called the $n$th-order informational rate-distortion function and the source dispersion, respectively. Our result generalizes the existing dispersion result for abstract sources with i.i.d. components. It also sharpens and extends the only known dispersion result for a source with memory, namely, the scalar Gauss-Markov source. The key novel technical tool in our analysis is the point-mass product proxy measure, which enables the construction of typical sets. This proxy generalizes the empirical distribution beyond the i.i.d. setting by preserving additivity across coordinates and facilitating a typicality analysis for sums of independent, non-identical terms.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09747v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Supriyo Jana",
      "Soumen Sarkar"
    ],
    "title": "Darboux first integrals of Kolmogorov systems with invariant $n$-sphere",
    "abstract": "In this paper, we characterize all polynomial Kolmogorov vector fields for which the standard $n$-sphere is invariant. We exhibit completely integrable Kolmogorov vector fields of degree $m$ on $\\mathbb{S}^n$ for any $m >2$. Then, we show that there is no cubic Hamiltonian Kolmogorov vector field that makes an odd-dimensional sphere invariant. We examine the conditions under which a cubic Kolmogorov vector field has a Darboux first integral. In many cases, we determine whether they constitute necessary and sufficient conditions. Moreover, we study the complete integrability of cubic Kolmogorov vector fields having an invariant $n$-sphere.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09742v1",
    "categories": [
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "You-Wei Benson Chen",
      "Alejandro Claros"
    ],
    "title": "Commutators of Fractional Integrals with $\\operatorname{BMO}^β$ Functions",
    "abstract": "We study commutators of the Riesz potential $I_α$ with functions $b$ in the capacitary space $\\mathrm{BMO}^β(\\mathbb{R}^n)$, defined through the Hausdorff content $\\mathcal{H}^β_\\infty$. We prove a Chanillo-type theorem characterising $\\mathrm{BMO}^β(\\mathbb{R}^n)$ via the boundedness of the commutator $[b,I_α]$ on capacitary Lebesgue spaces. In addition, we obtain the endpoint estimate in the form of a capacitary modular weak-type inequality. These results follow from a pointwise estimate for the $β$-dimensional sharp maximal function of the commutator, together with a capacitary Fefferman-Stein inequality recently proved in [CC24].",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09734v1",
    "categories": [
      "math.SP"
    ],
    "authors": [
      "Yannick de Bruijn",
      "Erik Orvehed Hiltunen"
    ],
    "title": "Mathematical Foundation for the Generalised Brillouin zone of m-banded Toeplitz operators",
    "abstract": "We show that the spectrum of the open-boundary limit of banded Toeplitz matrices is real whenever the associated symbol function is real-valued along a closed polar curve. Building on this result, we develop both analytical and numerical methods to symmetrise a class of banded non-Hermitian Toeplitz matrices whose asymptotic spectra are real. Finally, we provide a rigorous mathematical foundation for the generalised Brillouin zone, a concept widely used in non-Hermitian physics, by proving that it coincides with the polar curve on which the symbol function takes real values.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09700v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Zhe Cao",
      "Harold Erazo",
      "Carlos Gustavo Moreira"
    ],
    "title": "On very badly approximable numbers",
    "abstract": "We prove a refined version of Markov's theorem in Diophantine approximation. More precisely, we characterize completely the set of irrationals $x$ such that $\\left|x-\\frac{p}{q}\\right|<\\frac{1}{3q^2}$ has only finitely many rational solutions: their continued fraction is eventually a balanced sequence through a simple coding. As consequence, we show that all such numbers are either quadratic surds or transcendental numbers. In particular, for any algebraic real number $x$ of degree at least $3$ there are infinitely rational numbers $\\frac{p}{q}$ such that $\\left|x-\\frac{p}{q}\\right|<\\frac{1}{3q^2}$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09698v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Áron Világi",
      "Jenő Szirmai"
    ],
    "title": "Power with Respect to Generalized Spheres and Radical Surfaces in $\\mathbf{H}^n$",
    "abstract": "This paper presents a unified theory for the power of a point with respect to generalized spheres (spheres, horospheres, and hyperspheres) in $n$-dimensional hyperbolic space $\\mathbf{H}^n$. By extending the classical secant theorem, we derive a novel formula for hyperspheres and also prove that the radical surface of any two non-concentric generalized spheres is a hyperplane. These results provide tools for constructing power diagrams and studying hyperball packings.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09679v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Chang Qin",
      "Yikun Li",
      "Ru Qian",
      "Jiayi Kang",
      "Yao Mao"
    ],
    "title": "Real time filtering algorithms",
    "abstract": "This paper presents a systematic review of recent advances in nonlinear filtering algorithms, structured into three principal categories: Kalman-type methods, Monte Carlo methods, and the Yau-Yau algorithm. For each category, we provide a comprehensive synthesis of theoretical developments, algorithmic variants, and practical applications that have emerged in recent years. Importantly, this review addresses both continuous-time and discrete-time system formulations, offering a unified review of filtering methodologies across different frameworks. Furthermore, our analysis reveals the transformative influence of artificial intelligence breakthroughs on the entire nonlinear filtering field, particularly in areas such as learning-based filters, neural network-augmented algorithms, and data-driven approaches.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09677v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Carlo Morpurgo",
      "Liuyu Qin"
    ],
    "title": "Sharp Sobolev and Moser-Trudinger inequalities on noncompact Riemannian manifolds with Ricci curvature bounded below",
    "abstract": "We establish Sobolev and Moser-Trudinger inequalities with best constants on noncompact Riemannan manifolds with Ricci curvature bounded below, and positive injectivity radius.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09650v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Majid Rajabzadeh",
      "Moein Khalighi"
    ],
    "title": "LDG method for solving spatial and temporal fractional nonlinear convection-diffusion equations",
    "abstract": "This paper focuses on a nonlinear convection-diffusion equation with space and time-fractional Laplacian operators of orders $1<β<2$ and $0<α\\leq1$, respectively. We develop local discontinuous Galerkin methods, including Legendre basis functions, for a solution to this class of fractional diffusion problem, and prove stability and optimal order of convergence $O(h^{k+1}+(Δt)^{1+\\frac{p}{2}}+p^2)$. This technique turns the equation into a system of first-order equations and approximates the solution by selecting the appropriate basis functions. Regarding accuracy and stability, the basis functions greatly improve the method. According to the numerical results, the proposed scheme performs efficiently and accurately in various conditions and meets the optimal order of convergence.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09711v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Dor Tsur",
      "Oron Sabag",
      "Navin Kashyap",
      "Haim Permuter",
      "Gerhard Kramer"
    ],
    "title": "Directed Information: Estimation, Optimization and Applications in Communications and Causality",
    "abstract": "Directed information (DI) is an information measure that attempts to capture directionality in the flow of information from one random process to another. It is closely related to other causal influence measures, such as transfer entropy, Granger causality, and Pearl's causal framework. This monograph provides an overview of DI and its main application in information theory, namely, characterizing the capacity of channels with feedback and memory. We begin by reviewing the definitions of DI, its basic properties, and its relation to Shannon's mutual information. Next, we provide a survey of DI estimation techniques, ranging from classic plug-in estimators to modern neural-network-based estimators. Considering the application of channel capacity estimation, we describe how such estimators numerically optimize DI rate over a class of joint distributions on input and output processes. A significant part of the monograph is devoted to techniques to compute the feedback capacity of finite-state channels (FSCs). The feedback capacity of a strongly connected FSC involves the maximization of the DI rate from the channel input process to the output process. This maximization is performed over the class of causal conditioned probability input distributions. When the FSC is also unifilar, i.e., the next state is given by a time-invariant function of the current state and the new input-output symbol pair, the feedback capacity is the optimal average reward of an appropriately formulated Markov decision process (MDP). This MDP formulation has been exploited to develop several methods to compute exactly, or at least estimate closely, the feedback capacity of a unifilar FSC. This monograph describes these methods, starting from the value iteration algorithm, to Q-graph methods, and reinforcement learning algorithms that can handle large input and output alphabets.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09706v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Michael Groechenig",
      "Xuanyou Li",
      "Dimitri Wyss",
      "Paul Ziegler"
    ],
    "title": "Twisted Higgs bundles and coendoscopy",
    "abstract": "This short note is devoted to the study of $G$-Higgs bundles twisted by a central gerbe. These objects arise naturally in the decomposition of the inertia stacks of $G$-Higgs bundles in terms of coendoscopic data. We establish that stabilised point-counts and cohomology are insensitive to the central twist. Along the way we show an analogue of Ngô's product formula for twisted Hitchin fibres.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09687v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Saša Novaković"
    ],
    "title": "On a generalization of the Brocard--Ramanujan Diophantine equation",
    "abstract": "Let $Q_1,...,Q_r\\in \\mathbb{Z}[x]$ be polynomials having $0$ as a root. Let $f(x,y)\\in\\mathbb{Z}[x,y]$ be a homogeneous polynomial with factorization $f(x,y)=f_1(x,y)^{e_1}\\cdots f_u(x,y)^{e_u}$, where $f_i(x,y)$ are irreducible homogeneous polynomials of degree $d_i\\geq 2$. Fix some positive integers $A_1,...,A_r$. We show that under certain conditions, the diophantine equation $\\prod_{i=1}^rQ_i(A_i^{n_i}n_i!)=f(x,y)$ has finitely many integer solutions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09659v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Illia Donhauzer"
    ],
    "title": "Asymptotics of multifractal products of spherical random fields",
    "abstract": "The paper studies multifractal random measures on the sphere $\\mathbb{S}^d$ constructed via multifractal products of random fields. It presents new limit theorems for multifractal products of spherical fields and conditions for the non-degeneracy of the limiting measure. The multifractal properties of the limiting measure are investigated, and its Rényi function is derived. Compared to earlier results on multifractal products of spherical fields, the obtained limit theorems hold under general mixing conditions, enabling the consideration of multifractal products of fields from a broad class and the construction of random measures with flexible multifractal properties.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09644v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Nirmali Prabha Das",
      "István Balázs",
      "Bornali Das",
      "Gergely Röst"
    ],
    "title": "Delayed Pattern Formation in Two-Dimensional Domains",
    "abstract": "This study investigates how the interaction between gene expression time delay and domain size governs spatio-temporal pattern formation in a reaction-diffusion system. To investigate these phenomena, we utilize a modified version of the Schnakenberg model called the ligand internalisation (LI) model. In a one-dimensional domain, a linear relationship has been observed between the gene expression time delay and the time it takes for patterns to form. We extend the model to the two-dimensional domain and confirm that a similar relationship holds there as well. However, our exploration reveals a non-monotonic correlation between domain size and the time required for pattern emergence.\n  To unravel these dynamics, we consider a range of initial conditions, including random perturbations of the spatially homogeneous steady state and initial conditions from its unstable manifold. We compute a two-parameter chart of patterns with respect to time delay and domain size.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09371v1",
    "categories": [
      "math.RA",
      "math.CT",
      "math.RT"
    ],
    "authors": [
      "James Gillespie"
    ],
    "title": "Acyclic complexes of FP-injective modules over Ding-Chen rings",
    "abstract": "We present a new method for combining two cotorsion pairs to obtain an abelian model structure and we apply it to construct and study a new model structure on left $R$-modules over a left coherent ring $R$. Its class of fibrant objects is generated by the weakly Ding injective $R$-modules, a class of modules recently studied by Iacob. We give several characterizations of the fibrant modules, one being that they are the cycle modules of certain acyclic complexes of FP-injective (i.e., absolutely pure) $R$-modules. In the case that $R$ is a Ding-Chen ring, we show that they are precisely the modules appearing as cycles of acyclic complexes of FP-injectives. This leads to a new description of the stable module category of a Ding-Chen ring $R$, by way of modules we call Gorenstein FP-pro-injective. These are modules that appear as a cycle module of a totally acyclic complex of FP-projective-injective modules. As a completely separate application of the new model category method, we show that all complete cotorsion pairs, even non-hereditary ones, lift to abelian models for the derived category of a ring.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09365v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Rosa Paten",
      "Dora Woodruff"
    ],
    "title": "Temperley-Lieb Immanants, Key Positivity, and Demazure Crystals",
    "abstract": "The main goal of this paper is to extend three important Schur positivity results to key positivity, replacing all Schur polynomials in relevant expressions with flagged Schur polynomials. Namely, we first show that the Temperley-Lieb immanants of (many) flagged Jacobi-Trudi matrices are key positive. Using this result, we give a combinatorial rule for the key expansion of (most) products of flagged skew Schur polynomials, and also give a log concavity result inspired by that of Lam-Postnikov-Pylyavskyy. The main tools in our proofs are Demazure crystals, and the recently defined shuffle tableaux of Nguyen and Pylyavskyy. In order to prove our main results, we must develop a new characterization of Demazure crystals, which builds off of prior work of Assaf and Gonzalez. This characterization may be useful in other contexts.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09352v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "John M. Campbell",
      "Shaun Cooper",
      "Dongxi Ye"
    ],
    "title": "Quadratic irrational analogues of Ramanujan's series for $1/π$",
    "abstract": "About 40 years ago Jonathan and Peter Borwein discovered the series identity $$ \\sum_{n=0}^\\infty \\frac{(-1)^n(6n)!}{(3n)!(n!)^3} \\frac{(A+nB)}{C^{n+1/2}} = \\frac{1}{12π} $$ where \\begin{align*} A&=1657145277365+212175710912\\sqrt{61},\\cr B&=107578229802750+13773980892672\\sqrt{61},\\cr C&=\\left(5280(236674+30303\\sqrt{61})\\right)^3 \\end{align*} which adds roughly 25 digits of accuracy per term. They noted that if each of the quadratic irrationals $A$, $B$ and $C$ is replaced by their conjugates, that is, each number $a+b\\sqrt{61}$ is changed to $a-b\\sqrt{61}$, then the resulting series also converges to a rational multiple of $1/π$. They gave several other examples of quadratic irrational series for $1/π$, and noted that the conjugate series converges to another rational multiple of $1/π$ or in some cases the conjugate series diverges.\n  The purpose of this work is to provide an explanation and classification of such series. Our classification includes Ramanujan's 17 original series, as well as series of the Borweins, Chudnovskys, Sato and others. We extend the classification to genus-zero subgroups $Γ_0(\\ell)+$, that is, for each $\\ell \\in \\big\\{1,2,3,\\ldots,36,38,39,41,42,44,45,46,47,49,50,51,54,55,56,59,60,62,66,69,70, 71,78,87,92,94,95,105,110,119\\big\\}$ we calculate the Hauptmoduls, associated weight two modular forms, and the corresponding rational and real quadratic irrational series for $1/π$.\n  The classification reveals many interrelations among the different series. For example, we show that the Borweins' series above, and its conjugate, are equivalent by hypergeometric transformation formulas to the level~7 rational series $$ \\sum_{n=0}^\\infty \\left\\{\\sum_{j=0}^n {n \\choose j}^2{2j \\choose n} {n+j \\choose j}\\right\\} (11895n+1286) \\frac{(-1)^n}{22^{3n+3}} = \\frac{1}{π\\sqrt{7}}. $$",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09332v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ling-yun Shou",
      "Zihao Song"
    ],
    "title": "Electrostatic effects on critical regularity and long-time behavior of viscous compressible fluids",
    "abstract": "We consider the compressible Navier-Stokes-Poisson equations in $\\mathbb{R}^d$ ($d\\geq2$), a classical model for barotropic compressible flows coupled with a self-consistent electrostatic potential. We show that the electrostatic coupling has a significant impact on the long-time dynamics of solutions due to its underlying Klein-Gordon structure. As a first result, we prove the global well-posedness of the Cauchy problem with initial data near equilibrium in the full-frequency $L^{p}$-type critical Besov space \\emph{without relying on hyperbolic symmetrization}. Compared with the Poisson-free case studied in several milestone works [Charve and Danchin, Arch. Rational Mech. Anal., 198 (2010), 233-271; Chen, Miao and Zhang, Commun. Pure Appl. Math., 63 (2010), 1173-1224; Haspot, Arch. Rational Mech. Anal., 202 (2011), 427-460], we remove the extra $L^{2}$ assumption in low frequencies and extend the admissible choice of $p$ to the sharp range $1\\leq p<2d$. This is, to the best of our knowledge, the first result in compressible fluids that allows the initial velocity field to be highly oscillatory across all frequencies.\n  Furthermore, stemming from the Poisson coupling, the density and velocity exhibit distinct low-frequency behaviors. Motivated by this feature, we propose a general $L^p$-type low-frequency assumption and establish the optimal convergence rates of global solutions toward equilibrium. For a broad class of indices, this assumption yields faster decay than those obtained under the classical $L^1$ framework. To this end, we develop a time-weighted energy method, which is of interest and enables us to capture maximal decay estimates without additional smallness of initial data.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09322v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Agnid Banerjee",
      "Nicola Garofalo"
    ],
    "title": "A strong unique continuation result for the Baouendi operator",
    "abstract": "We establish a strong unique continuation property for the subelliptic Baouendi operator under the presence of zero-order perturbations satisfying an almost Hardy-type growth condition. In particular, the admissible class includes both $L^\\infty_{\\mathrm{loc}}$ and singular potentials. We prove that any solution vanishing to infinite order at a point of the degeneracy manifold of the operator must be identically zero. The result holds extends to variable-coefficient operators with intrinsic Lipschitz regularity. A notable feature of the proof is that it relies exclusively on $L^2$ Carleman estimates combined with the classical Hardy inequality.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09320v1",
    "categories": [
      "math.GR",
      "math.RA"
    ],
    "authors": [
      "Cindy Tsang"
    ],
    "title": "Skew braces with no proper left ideals",
    "abstract": "A skew brace $A = (A,\\cdot,\\circ)$ is said to be \\textit{left-simple} if $A\\neq1$ and it has no left ideal other than $1$ and $A$. The purpose of this paper is to give a partial classification of the finite left-simple skew braces. A result of Stefanello and Trappeniers implies that finite left-simple skew braces correspond precisely to minimal Hopf--Galois structures on finite Galois extensions of fields.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09215v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Qi Ge",
      "Guangzhao Zhu"
    ],
    "title": "Weil restriction and the motivic cycle class map",
    "abstract": "The etale cycle class map links Chow groups with etale cohomology. Within the framework of motivic cohomology, the motivic cycle class map appears as a comparison morphism relating motivic and Lichtenbaum cohomology. By examining the comparison morphism constructed by Geisser and Levine, we show that the motivic cycle class map is induced by the etale cycle class map. We then study the behavior of cycle class maps under Weil restriction. Extending Karpenko's construction of the Weil restriction for algebraic cycles and Chow groups, we introduce a corresponding Weil restriction for l-adic cohomology and prove its compatibility with the motivic cycle class map. This provides a conceptual explanation for the descent of cycle classes under finite Galois extensions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09177v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Ciro Ciliberto",
      "Concettina Galati"
    ],
    "title": "On nodal deformations of singular surfaces in $\\mathbb P^3$",
    "abstract": "In this paper we study nodal deformations of singular surfaces $S\\subset \\mathbb P^3$. In particular we consider the case in which $S$ has an isolated singularity of multiplicity $m$ and the case in which $S$ has only ordinary singularities along a line.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09626v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Daniele A. Di Pietro",
      "Jerome Droniou",
      "Vito Patierno"
    ],
    "title": "A Reynolds- and Hartmann-semirobust hybrid method for magnetohydrodynamics",
    "abstract": "We propose and analyze a new method for the unsteady incompressible magnetohydrodynamics equations on convex domains with hybrid approximations of both vector-valued and scalar-valued fields. The proposed method is convection-semirobust, meaning that, for sufficiently smooth solutions, one can derive a priori estimates for the velocity and the magnetic field that do not depend on the inverse of the diffusion coefficients. This is achieved while at the same time providing relevant additional features, namely an improved order of convergence for the (asymptotic) diffusion-dominated regime, a small stencil (owing to the absence of inter-element penalty terms), and the possibility to significantly reduce the size of the algebraic problems through static condensation. The theoretical results are confirmed by a complete panel of numerical experiments.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09623v1",
    "categories": [
      "math.CO",
      "math.AC"
    ],
    "authors": [
      "Rakesh Ghosh",
      "S Selvaraja"
    ],
    "title": "Shellability in Clique-Free Complexes of Graphs",
    "abstract": "We study combinatorial and algebraic properties of $t$-clique-free complexes, a family of simplicial complexes associated with finite simple graphs that generalize the classical independence complex. For a graph $G$ and an integer $t \\ge 2$, the $t$-clique-free complex $\\mathsf{CF}_t(G)$ is the simplicial complex on the vertex set of $G$ whose faces are the subsets inducing no cliques of size $t$.\n  Our main results provide sufficient conditions for shellability and related decomposability properties of $t$-clique-free complexes. In particular, we show that if $G$ is a $t$-diamond-free chordal graph (in particular, a block graph), then $\\mathsf{CF}_t(G)$ is $(t-2)$-decomposable and hence shellable. We also investigate how graph modifications via clique attachments influence shellability. Generalizing earlier constructions involving whiskers and clique extensions, we introduce the following operation: given a graph $H$, a subset $S \\subseteq V(H)$, and an integer $t \\ge 2$, we form a graph $\\operatorname{Cl}(H,S,t)$ by attaching to each vertex in $S$ a clique of size at least $t$. We prove that $\\mathsf{CF}_t(H\\setminus S)$ is shellable if and only if $\\mathsf{CF}_t(\\operatorname{Cl}(H,S,t))$ is shellable. This yields a flexible method for constructing shellable complexes, particularly when $S$ is a cycle cover. In addition, we extend the notion of clique whiskering and show that for any graph admitting a clique vertex-partition, the resulting $t$-clique whiskering produces a pure and shellable, and hence Cohen-Macaulay, $t$-clique-free complex.\n  Finally, we establish a Fröberg-type result linking chordality and linear resolutions. We show that for any chordal graph $G$, the edge ideal of the complement $t$-clique clutter $\\overline{\\mathcal{CH}_t(G)}$ admits a $t$-linear resolution over any field.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09613v1",
    "categories": [
      "math.DS",
      "cs.LG"
    ],
    "authors": [
      "Tobias Wöhrer",
      "Christian Kuehn"
    ],
    "title": "Tracking Finite-Time Lyapunov Exponents to Robustify Neural ODEs",
    "abstract": "We investigate finite-time Lyapunov exponents (FTLEs), a measure for exponential separation of input perturbations, of deep neural networks within the framework of continuous-depth neural ODEs. We demonstrate that FTLEs are powerful organizers for input-output dynamics, allowing for better interpretability and the comparison of distinct model architectures. We establish a direct connection between Lyapunov exponents and adversarial vulnerability, and propose a novel training algorithm that improves robustness by FTLE regularization. The key idea is to suppress exponents far from zero in the early stage of the input dynamics. This approach enhances robustness and reduces computational cost compared to full-interval regularization, as it avoids a full ``double'' backpropagation.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09549v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Junxue Zhang",
      "Liwen Zhang"
    ],
    "title": "The minimum spectral radius of $tP_4$-saturated graphs",
    "abstract": "A graph $G$ is called {\\em$F$-saturated} if $G$ does not contain $F$ as a subgraph but adding any missing edge to $G$ creates a copy of $F$. In this paper, we consider the spectral saturation problem for the linear forest $tP_4$, proving that every $n$-vertex $tP_4$-saturated graph $G$ with $t\\geq 2$ and $n\\ge 4t$ satisfies $ρ(G)\\ge \\frac{1+\\sqrt{17}}{2}$, and characterizing all $tP_4$-saturated graphs for which equality holds. Moreover, we obtain that, for $t=2$ with odd $n\\ge 13 $, and for $t\\ge 3$ with $n\\ge 6t+4$, the set of $n$-vertex $tP_4$-saturated graphs minimizing the spectral radius is disjoint from that minimizing the number of edges.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09470v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Mohammad Golshani",
      "Reihane Zoghifard"
    ],
    "title": "Strong Completeness of Provability Logic for Uncountable Languages",
    "abstract": "For an ordinal $λ>0$, we use the Erdős--Rado partition theorem to prove the failure of strong completeness for modal languages of cardinality $(2^{|λ|+\\aleph_0})^{+}$ with respect to models on ordinals equipped with the generalized Icard topologies $\\mathcal{I}_λ$ and ${τ_{c}}_{+λ}$. Specifically, we show that for such languages there exists a consistent set of formulas having neither $(Θ, \\mathcal{I}_λ)$-model nor $(Θ, {τ_{c}}_{+λ})$-model. We also introduce a natural class of topological spaces, called $λ$-bouquet spaces, and prove that they yield strong completeness of $\\mathsf{GL}$ for languages of cardinality $λ$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09114v1",
    "categories": [
      "math.AG",
      "math.CV"
    ],
    "authors": [
      "André Belotto da Silva",
      "Edward Bierstone"
    ],
    "title": "Group-circulant singularities and partial desingularization preserving normal crossings",
    "abstract": "The subject is partial desingularization preserving the normal crossings singularities of an algebraic or analytic variety X (over the complex field or over an uncountable algebraically closed field of characteristic zero, in the algebraic case). Our approach has three parts involving distinct techniques: (1) a formal splitting theorem for regular or analytic functions which satisfy a generic splitting hypothesis; (2) a study of singularities in the closure of the normal crossings locus, based on the combinatorics of G-circulant matrices, where G is a finite abelian group, leading to a theorem on reduction to group-circulant normal form; (3) a partial desingularization theorem, proved using (1) and (2) together with weighted blowings-up of group-circulant singularities. Previous results were for partial desingularization preserving simple normal crossings, or preserving general normal crossings when dim X < 5.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09702v1",
    "categories": [
      "math.AG",
      "cs.SC",
      "math.OC"
    ],
    "authors": [
      "Corentin Cornou",
      "Simone Naldi",
      "Tristan Vaccon"
    ],
    "title": "On semidefinite-representable sets over valued fields",
    "abstract": "Polyhedra and spectrahedra over the real numbers, or more generally their images under linear maps, are respectively the feasible sets of linear and semidefinite programming, and form the family of semidefinite-representable sets. This paper studies analogues of these sets, as well as the associated optimization problems, when the data are taken over a valued field $K$. For $K$-polyhedra and linear programming over $K$ we present an algorithm based on the computation of Smith normal forms. We prove that fundamental properties of semidefinite-representable sets extend to the valued setting. In particular, we exhibit examples of non-polyhedral $K$-spectrahedra, as well as sets that are semidefinite-representable over $K$ but are not $K$-spectrahedra.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09697v1",
    "categories": [
      "math.AP",
      "math.DS"
    ],
    "authors": [
      "Panrui Ni",
      "Jun Yan",
      "Maxime Zavidovique"
    ],
    "title": "Static class-guided selection of elementary solutions in non-monotone vanishing discount problems",
    "abstract": "We study a generalized vanishing discount problem for Hamilton--Jacobi equations, removing the standard monotonicity assumption, either in a global sense or when integrated against all Mather measures. Specifically, we consider \\[ λa(x)u(x)+H(x,Du(x))-Aλ=c_0, \\] with a suitably chosen constant $A>0$. By appropriately changing the signs of the function $a(x)$ on different static classes associated with $H$, we show that the maximal viscosity solution converges uniformly as $λ\\to 0^+$ and that all elementary solutions of the stationary equation \\[ H(x,Du(x))=c_0 \\] can be selected as limits. This provides the first result for selecting multiple viscosity solutions in vanishing discount problems beyond the usual monotonicity and integral assumptions, as long as $a(x)$ is positive on one static class. Our results highlight the crucial role of static classes in controlling the asymptotic behavior of viscosity solutions. Previously, under usual monotonicity assumptions, only a single solution could be selected (as discussed in \\cite{GL}), whereas our approach allows controlled selection of multiple solutions via static class-guided discount coefficients.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09674v1",
    "categories": [
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Léo Hubert"
    ],
    "title": "A homotopical Dold-Kan correspondence for Joyal's category $Θ$ and other test categories",
    "abstract": "We prove that for any test category $A$, in the sense of Grothendieck, satisfying a compatibility condition between homology equivalences and weak equivalences of presheaves, the homotopy category of abelian presheaves on $A$ is equivalent to the non-negative derived category of abelian groups. This provides a homotopical generalization of the Dold-Kan correspondence for presheaves of abelian groups over a wide range of test categories. This equivalence of homotopy categories comes from a Quillen equivalence for a model structure on abelian presheaves that we introduce under these conditions. We then show that this result applies to Joyal's category $Θ$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09671v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yongchun Bi",
      "Jun Zheng",
      "Guchuan Zhu"
    ],
    "title": "Input-to-state stabilization of an ODE cascaded with a parabolic equation involving Dirichlet-Robin boundary disturbances",
    "abstract": "This paper focuses on the input-to-state stabilization problem for an ordinary differential equation (ODE) cascaded by parabolic partial differential equation (PDE) in the presence of Dirichlet-Robin boundary disturbances, as well as in-domain disturbances. For the cascaded system with a Dirichlet pointwise interconnection, the ODE takes the value of a Robin boundary condition at the ODE-PDE interface as its direct input, and the PDE is driven by a Dirichlet boundary input at the opposite end. We first employ the backstepping method to design a boundary controller and to decouple the cascaded system. This decoupling facilitates independent stability analysis of the PDE and ODE systems sequentially. Then, to address the challenges posed by Dirichlet boundary disturbances to the application of the classical Lyapunov method, we utilize the generalized Lyapunov method to establish the ISS in the max-norm for the cascaded system involving Dirichlet boundary disturbances and two other types of disturbances. The obtained result indicates that even in the presence of different types of disturbances, ISS analysis can still be conducted within the framework of Lyapunov stability theory. For the well-posedness of the target system, it is conducted by using the technique of lifting and the semigroup method. Finally, numerical simulations are conducted to illustrate the effectiveness of the proposed control scheme and ISS properties for a cascaded system with different disturbances.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09669v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Sidy M. Djitte",
      "Franck Sueur"
    ],
    "title": "A Lions' type formula for some reproducing kernel Hilbert spaces of fractional harmonic functions",
    "abstract": "In \\cite{Lions}, J. L. Lions considered a reproducing kernel Hilbert space (RKHS) of harmonic functions on a regular domain with Sobolev traces and obtained a formula that expresses the kernel of this space as an integral on the boundary of some derivatives of the Green function associated with the Laplace operator and the homogeneous Dirichlet boundary condition. This result was simplified and extended later by Englis, Lukkassen, Peetre, and Persson in \\cite{ELPL} to more general elliptic systems of even orders. In particular, they emphasized that the resemblance between Lions' type formula and the Hadamard variational formula only appears when the operator is of order $2$. In this paper, we investigate some RKHS of $a$-harmonic functions, where $a$ in $(0,1)$ refers to a fractional exponent of the Laplace operator. For such fractional order pseudo-differential operators, the local nonhomogeneous Dirichlet problem can be addressed by means of some $a$-transmission Sobolev spaces, which were introduced by Hörmander in the sixties and recently developed by Grubb in a series of papers. We deduce from these works a fractional Poisson formula, which is applied to obtain a Lions' type formula. We observe, in particular, that despite the order of the operator not being $2$, this formula resembles the Hadamard variational formula that we prove in the companion paper \\cite{sidy-franck_1}. As a complementary remark, we observe that for a family of RKHS associated with the steady Stokes system, a second order system, there is also a Lions' type formula for their two-point kernels, which turn out not to be similar to the corresponding Hadamard variation formula.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09585v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Aryan Sanghi",
      "Anubhav Dhar",
      "Sudeshna Kolay"
    ],
    "title": "On Euler Paths and the Maximum Degree Growth of Iterated Higher Order Line Graphs",
    "abstract": "Given a simple graph $G$, its line graph, denoted by $L(G)$, is obtained by representing each edge of $G$ as a vertex, with two vertices in $L(G)$ adjacent whenever the corresponding edges in $G$ share a common endpoint. By applying the line graph operation repeatedly, we obtain higher order line graphs, denoted by $L^{r}(G)$. In other words, $L^{0}(G) = G$, and for any integer $r \\ge 1$, $L^{r}(G) = L(L^{r-1}(G))$.\n  Given a graph $G$ on $n$ vertices, we wish to efficiently find out (i) if $L^k(G)$ has an Euler path, (ii) the value of $Δ(L^k(G))$. Note that the size of a higher order line graph could be much larger than that of $G$.\n  For the first question, we show that for a graph $G$ with $n$ vertices and $m$ edges the largest $k$ where $L^k(G)$ has an Euler path satisfies $k = \\mathcal O(nm)$. We also design an $\\mathcal{O}(n^2m)$-time algorithm to output all $k$ such that $L^k(G)$ has an Euler path.\n  For the second question, we study the growth of maximum degree of $L^k(G)$, $k \\ge 0$. It is easy to calculate $Δ(L^k(G))$ when $G$ is a path, cycle or a claw. Any other connected graph is called a prolific graph and we denote the set of all prolific graphs by $\\mathcal G$. We extend the works of Hartke and Higgins to show that for any prolific graph $G$, there exists a constant rational number $dgc(G)$ and an integer $k_0$ such that for all $k \\ge k_0$, $Δ(L^k(G)) = dgc(G) \\cdot 2^{k-4} + 2$. We show that $\\{dgc(G) \\mid G \\in \\mathcal G\\}$ has first, second, third, fourth and fifth minimums, namely, $c_1 = 3$, $c_2 = 4$, $c_3 = 5.5$, $c_4 = 6$ and $c_5=7$; the third minimum stands out surprisingly from the other four. Moreover, for $i \\in \\{1, 2, 3, 4\\}$, we provide a complete characterization of $\\mathcal G_i = \\{dgc(G) = c_i \\mid G \\in \\mathcal G \\}$. Apart from this, we show that the set $\\{dgc(G) \\mid G \\in \\mathcal G, 7 < dgc(G) < 8\\}$ is countably infinite.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09579v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Jinghao Huang",
      "Fedor Sukochev",
      "Zhizheng Yu"
    ],
    "title": "Arazy-type decomposition theorem for bounded linear operators and commutators on the trace class",
    "abstract": "The classical Arazy's decomposition theorem provides a powerful tool in the study of sequences in (and isomorphisms on) a separable operator ideal $\\mathcal C_E$ of the algebra $\\mathcal B(H)$ of all bounded linear operators on the separable infinite-dimensional Hilbert space $H$. In this paper, we extend and strengthen Arazy's decomposition theorem to the setting of general bounded linear operators on a separable (quasi-Banach) operator ideal $\\mathcal C_E$ of $\\mathcal B(H)$. Several applications are given to the study of $\\mathcal C_E$-strictly singular operators, largest proper ideals in the algebra $\\mathcal B(\\mathcal C_E)$ of all bounded linear operators on $\\mathcal C_E$ and complementably homogeneous Banach spaces among others. Our versions of decomposition theorems supply tools for a noncommutative generalization of deep commutator theorems for operators on $\\ell_p$ and $L_p$, $1\\le p <\\infty $, due to Brown and Pearcy, Apostol, and Dosev, Johnson and Schechtman. We are able to characterize commutators on the Schatten-von Neumann class $\\mathcal C_p$, $1\\le p<\\infty $. For the crucial case, $p=1$, we establish that any operator $T\\in\\mathcal B(\\mathcal C_1)$ is a commutator if and only if $T$ is not of the form $λI+K$ for some $λ\\neq 0$ and $\\mathcal C_1$-strictly singular operator $K$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09547v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Benjamin Gess",
      "Daniel Heydecker"
    ],
    "title": "The Porous Medium Equation: Multiscale Integrability in Large Deviations",
    "abstract": "We consider a zero-range process $η^N_t(x)$ with superlinear local jump rate, which in a hydrodynamic-small particle rescaling converges to the porous medium equation $\\partial_t u=\\frac12Δu^α, α>1$. As a main result we obtain a large deviation principle in any scaling regime of vanishing particle size $χ_N\\to 0$. The key challenge is to develop uniform integrability estimate on the nonlinearity $(η^N(x))^α$ in a situation where neither pathwise regularity nor Dirichlet-form based regularity is readily available. We resolve this by introducing a novel multiscale argument exploiting the appearance of pathwise regularity across scales.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09508v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Qiufan Chen",
      "Xiaohan Guo"
    ],
    "title": "2-Local derivations on a Block-type Lie algebra",
    "abstract": "The present paper is devoted to study 2-local derivations on the Block-type Lie algebra which is an infinite-dimensional Lie algebra with some outer derivations. We prove that every 2-local derivation on the Block-type Lie algebra is a derivation.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09505v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Martin Sæbye Carøe",
      "Mirza Karamehmedović",
      "Pierre Maréchal"
    ],
    "title": "Interpolating between Tikhonov regularization and spectral cutoff",
    "abstract": "Regularizing a linear ill-posed operator equation can be achieved by manipulating the spectrum of the operator's pseudo-inverse. Tikhonov regularization and spectral cutoff are well-known techniques within this category. This paper introduces an interpolating formula that defines a one-parameter family of regularizations, where Tikhonov and spectral cutoff methods are represented as limiting cases. By adjusting the interpolating parameter taking into account the specific operator equation under consideration, it is possible to mitigate the limitations associated with both Tikhonov and spectral cutoff regularizations. The proposed approach is demonstrated through numerical simulations in the fields of signal and image processing.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09488v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Helia Karisani",
      "Mohammadreza Daneshvaramoli"
    ],
    "title": "A Combinatorial Proof of Cayley's Formula via Degree Sequences",
    "abstract": "Cayley's formula is a fundamental result in combinatorics that counts the number of labeled trees on n vertices. While existing proofs use approaches such as Prufer sequences and the Matrix-Tree Theorem, we give a combinatorial proof that highlights the role of degree sequences and structural properties of labeled trees. Our goal is to provide an accessible perspective and suggest connections to related enumeration problems.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09454v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Jianfeng Lin",
      "Yi Xie",
      "Boyu Zhang"
    ],
    "title": "Pseudo-isotopies of 3-manifolds with infinite fundamental groups",
    "abstract": "Suppose $Y$ is a compact, connected, oriented 3-manifold possibly with boundary, such that $π_1(Y)$ is infinite. Let $\\operatorname{Diff}_\\partial(I\\times Y)$ denote the group of self-diffeomorphisms of $I\\times Y$ that are equal to the identity near the boundary. Let $\\operatorname{Diff}_{PI}(I\\times Y)$ denote the subgroup of $\\operatorname{Diff}_\\partial(I\\times Y)$ consisting of elements pseudo-isotopic to the identity. Define $\\operatorname{Homeo}_\\partial(I\\times Y)$, $\\operatorname{Homeo}_{PI}(I\\times Y)$ similarly for homeomorphisms. We show that the canonical map $π_0\\operatorname{Diff}_{PI}(I\\times Y) \\to π_0\\operatorname{Homeo}_{PI}(I\\times Y)$ is of infinite rank. As a consequence, $π_0\\operatorname{Diff}_{PI}(I\\times Y)$, $π_0\\operatorname{Diff}_{\\partial}(I\\times Y)$, $π_0\\operatorname{Homeo}_{PI}(I\\times Y)$, $π_0\\operatorname{Homeo}_{\\partial}(I\\times Y)$ are all abelian groups of infinite rank. We also prove that $π_0\\,C(Y)$ contains an abelian subgroup of infinite rank, and $π_0\\,C(I\\times Y)$ admits a surjection to an abelian group of infinite rank, where $C(X)$ denotes the concordance automorphism group $\\operatorname{Diff}(I\\times X, \\{0\\}\\times X\\cup I\\times \\partial X)$ or $\\operatorname{Homeo}(I\\times X, \\{0\\}\\times X\\cup I\\times \\partial X)$. These results are proved by studying the actions of barbell diffeomorphisms on the spaces of embedded arcs and configuration spaces.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09426v1",
    "categories": [
      "math.QA",
      "math.CO"
    ],
    "authors": [
      "Perrine Jouteur",
      "Hoel Queffelec"
    ],
    "title": "q-Rationals, link invariants and webs",
    "abstract": "We investigate the role of q-rationals in the context of link invariants. This leads us to introduce and study web categories that q-deform Deligne's categories.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09417v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Anoosheh Heidarzadeh"
    ],
    "title": "On the Subpacketization Level of the Banawan-Ulukus Multi-Message PIR Scheme",
    "abstract": "This note analyzes a linear recursion that arises in the computation of the subpacketization level for the multi-message PIR scheme of Banawan and Ulukus. We derive an explicit representation for the normalized subpacketization level $L$, whose smallest integer multiple yields the subpacketization level of the scheme, in terms of the number of servers $N$, the total number of messages $K$, and the number of demand messages $D$. The resulting formula shows that $L$ is a polynomial in $N$ with nonnegative coefficients, and its leading term is $N^{K-D+1}/D$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09350v1",
    "categories": [
      "math.RT",
      "math.AG",
      "math.CO",
      "math.GN"
    ],
    "authors": [
      "Xuhua He",
      "Kaitao Xie"
    ],
    "title": "Total positivity in twisted flag varieties",
    "abstract": "Let $G$ be a Kac-Moody group, split over $\\mathbb R$. The totally nonnegative part of $G$ and its (ordinary) flag variety $G/B^+$ was introduced by Lusztig. It is known that the totally nonnegative parts of $G$ and $G/B^+$ have remarkable combinatorial and topological properties.\n  In this paper, we consider the totally nonnegative part of the $J$-twisted flag variety $G/{}^J B^+$, where ${}^J B^+$ is the Borel subgroup opposite to $B^+$ in the standard parabolic subgroup $P_J^+$ of $G$. The $J$-twisted flag varieties include the ordinary flag variety $G/B^+$ as a special case. Our main result show that the totally nonnegative part of $G/{}^J B^+$ decomposes into cells, and the closure of each cell is a regular CW complex. This generalizes the work of Galashin-Karp-Lam \\cite{GKL22} and the joint work of Bao with the first author \\cite{BH24} for ordinary flag varieties.\n  As an application, we deduce that the totally nonnegative part of the double flag variety $G/B^+ \\times G/B^-$ with respect to the diagonal $G$-action has similar nice properties. We also establish some connections between the totally nonnegative part of the double flag with the canonical basis of the tensor product of a lowest weight module with a highest weight module of $G$.\n  As another application, we show that the link of identity in a totally nonnegative reduced double Bruhat cell of $G$ is a regular CW complex. This generalizes the work of Hersh \\cite{Her14} on the link of $U_{\\geq0}^-$ and gives a positive answer to an open question of Fomin and Zelevinsky.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09283v1",
    "categories": [
      "math.LO",
      "math.CT"
    ],
    "authors": [
      "Nathaniel Bannister",
      "Dianthe Basak"
    ],
    "title": "Condensed Sets and the Solovay Model",
    "abstract": "We exhibit a geometric morphism from the Grothendieck topos representing the Solovay model to the $κ$-pyknotic sets of Barwick-Haine and Clausen-Scholze. We then use the properties of this morphism and automatic continuity in the Solovay model to prove Clausen-Scholze's resolution of the Whitehead problem for discrete condensed abelian groups. We also exhibit an analogous internal $Ext$ computation between locally compact abelian groups in the Solovay model.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09241v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Maria Manuel Clementino",
      "Andrea Montoli"
    ],
    "title": "Algebraic exponentiation and action representability for V-groups",
    "abstract": "We show that the category of V-groups, where V is a cartesian quantale, so in particular the category of preordered groups, is locally algebraically cartesian closed with respect to the class of points underlying the product V-category structure. We obtain this by observing that such points correspond to (V-Cat)-enriched functors from a V-group, seen as a one-object V-category, to the category V-Grp of V-groups. Moreover, we show that the actions corresponding to points underlying the product V-category structure are representable.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09212v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Mamadou Niang",
      "Mamadou Pathe LY",
      "Abdoul Aziz Ndiaye",
      "Abdoul Aziz Ndiaye",
      "Mamadou Abdoul Diop"
    ],
    "title": "Controllability of nonautonomous measure driven integrodifferential evolution equations with nonlocal conditions",
    "abstract": "This research delves into the exact controllability of semilinear measure-driven integrodifferential systems in nonlocal settings. We provide sufficient controllability requirements using the measure of noncompactness and the Mönch fixed point theorem without making any assumptions about how compact the evolution system is in relation to the linear part of the measure system. Here, we obtain results that both generalize and improve upon many prior findings.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09200v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "B. A. Omirov",
      "G. O. Solijanova",
      "G. Kh. Urazmatov"
    ],
    "title": "Cohomological rigidity of solvable Lie algebras of maximal ran",
    "abstract": "We study the second cohomology group with coefficients in the adjoint module for a class of solvable Lie algebras $\\mathcal{R}_{\\mathcal{T}}$ that arise as maximal solvable extensions of nilpotent Lie algebras $\\mathcal{N}$ of maximal rank. Under suitable structural assumptions on the root system determined by the action of a maximal torus $\\mathcal{T}$ on $\\mathcal{N}$, we obtain sufficient conditions for the cohomological rigidity of $\\mathcal{R}_{\\mathcal{T}}$. Conversely, we identify explicit configurations of roots that force the second cohomology group to be non-trivial, thereby producing broad families of solvable Lie algebras that are not cohomologically rigid. Our results extend the classical sufficient conditions of Leger and Luks, and they provide a unified and computationally effective framework for determining the cohomological rigidity of a wide class of solvable Lie algebras, including several known results.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09133v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Luke Fina",
      "Christopher Petersen"
    ],
    "title": "Uniting Iteration Limits for Mixed-Integer Quadratic MPC",
    "abstract": "Iteration limited model predictive control (MPC) can stabilize a feedback control system under sufficient conditions; this work explores combining a low iteration limit MPC with a high iteration limit MPC for mixed-integer quadratic programs (MIQPs) where the suboptimality is due to solver iteration limits. To combine the two MPCs a hybrid systems controller is developed that ``unites'' two MIQP-MPC solvers where the iteration limits of interest are the branch-and-bound and quadratic programming iteration limits. Asymptotic stability and robustness of the hybrid feedback control system are theoretically derived. Then an interpretable branch-and-bound algorithm and implementable uniting controller algorithm are developed. Finally, the developed algorithms and varying iteration limits are empirically evaluated in simulation for the switching thruster and minimum thrust spacecraft rendezvous problems.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09072v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Hariprasad Manjunath",
      "Raisa Dsouza"
    ],
    "title": "Circular Super patterns and Zigzag constructions",
    "abstract": "In this article, we introduce the notion of circular k-superpatterns, defined as permutations that contain all length-k patterns up to rotation equivalence.\n  We present a construction of a circular superpattern from a linear (k-1)-superpattern and explicitly derive an upper bound on its length. Motivated by the zigzag framework of Engen and Vatter, we adapt and simplify their score function to the circular setting and analyze its parity properties. For odd k, we propose a candidate zigzag construction for circular superpatterns, supported by computational evidence for small values of k.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09060v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Juno Park"
    ],
    "title": "A Logarithmic Spiral Formed by a Sequence of Regular Polygons",
    "abstract": "When the sequence of regular polygons with consecutively increasing numbers of sides is joined edge-to-edge in a single direction while minimizing bending, the resulting structure assumes the shape of a logarithmic spiral. This paper proves that this spiral takes the form r=exp(4θ/π). Specifically, it is derived that the distances between the curve and the centers of the even-sided and odd-sided regular polygons converge to 5/6 and 7/12, respectively, with the centers extending outward along the inner side of the spiral. A similar analysis applied to the sequence of regular polygons with consecutively increasing odd numbers of sides reveals that it forms the same type of spiral, establishing that the distances to the centers converge to 7/24.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09055v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Sijia Li",
      "Lei Lin",
      "Junliang Lv"
    ],
    "title": "An adaptive perfectly matched layer finite element method for acoustic-elastic interaction in periodic structures",
    "abstract": "This paper considers the scattering of a time-harmonic acoustic plane wave by an elastic body with an unbounded periodic surface. The original problem can be confined to the analysis of the fields in one periodic cell. With the help of the perfectly matched layer (PML) technique, we can truncate the unbounded physical domain into a bounded computational domain. By respectively constructing the equivalent transparent boundary conditions of acoustic and elastic waves simultaneously, the well-posedness and exponential convergence of the solution to the associated truncated PML problem are established. The finite element method is applied to solve the PML problem of acoustic-elastic interaction. To address the singularity caused by the non-smooth surface of the elastic body, we establish a residual-type a posteriori error estimate and develop an adaptive PML finite element algorithm. Several numerical examples are presented to demonstrate the effectiveness of the proposed adaptive algorithm.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09313v1",
    "categories": [
      "math.AT",
      "math.GT"
    ],
    "authors": [
      "Lewis Ghrist",
      "Robert Ghrist"
    ],
    "title": "Impossible by Degrees: Cohomology & Bistable Visual Paradox",
    "abstract": "The Penrose triangle, staircase, and related ``impossible objects'' have long been understood as related to first cohomology $H^1$: the obstruction to extending locally consistent interpretations around a loop. This paper develops a cohomological hierarchy for a class of visual paradoxes. Restricting to systems built from \\emph{bistable} elements -- components admitting exactly two local states, such as the Necker cube's forward/backward orientations, a gear's clockwise/counterclockwise spin, or a rhombic tiling corner's convex/concave interpretation -- allows the use of $\\mathbb{Z}_2$ coefficients throughout, reducing obstruction theory to parity arithmetic. This reveals a hierarchy of paradox classes from $H^0$ through $H^2$, refined at each degree by the relative/absolute distinction, ranging from ambiguity through impossibility to inaccessibility. A discrete Stokes theorem emerges as the central tool: at each degree, the connecting homomorphism of relative cohomology promotes boundary data to interior obstruction, providing the uniform mechanism by which paradoxes ascend the hierarchy.\n  Three paradigmatic systems -- Necker cube fields, gear meshes, and rhombic tilings -- are studied in detail. Throughout, we pair cohomology with imagery and animation. To illuminate the underlying structure, we introduce the \\emph{Method of Monodromic Apertures}, an animation technique that reveals monodromy through a configuration space of local sections.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09293v1",
    "categories": [
      "math.AP",
      "physics.plasm-ph"
    ],
    "authors": [
      "Emeric Roulley"
    ],
    "title": "Ions-electrons-states for the two-component Vlasov-Poisson equation",
    "abstract": "We establish both local and global bifurcation results for traveling periodic solutions of the one-dimensional two-species Vlasov-Poisson equation. These solutions consist of strip-like regions of ions and electrons in phase space that propagate coherently and emerge from spatially homogeneous, velocity-dependent equilibrium layers. Depending on the geometry of the underlying equilibrium and on the selected Fourier mode, the bifurcation diagram exhibits either two or four solution branches. In all cases, the bifurcation is of pitchfork type; in symmetric configurations, the local structure near the equilibrium has a hyperbolic geometry. We further show that these locally constructed branches extend globally. This work extends the previous study by the same author of the purely electronic case, where the ions were modeled as an immobile neutralizing background. Allowing both species to evolve dynamically leads to a more intricate, higher-dimensional analysis. Finally, by means of an affine change of variables, we reveal a connection with the one-dimensional two-component Euler-Poisson system, which in turn enables the construction of traveling periodic waves of both small and large amplitude for that model as well.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09261v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Marina Palaisti"
    ],
    "title": "Composita Stability Theorems for Enhanced Koszul Properties in Galois Cohomology",
    "abstract": "We investigate how enhanced Koszul properties of Galois cohomology behave under composita of fields. Given fields $K_1$ and $K_2$ containing $μ_p$, with intersection $k$ and compositum $K = K_1K_2$, we formulate an abstract composita stability theorem: under a pro-$p$ amalgam decomposition $G_K \\cong G_{K_1} *_{G_k} G_{K_2}$ of maximal pro-$p$ Galois groups, and natural Mayer-Vietoris compatibility assumptions on the mod-$p$ cohomology rings $H^\\bullet(G_{K_1},\\mathbb F_p)$, $H^\\bullet(G_{K_2},\\mathbb F_p)$, and $H^\\bullet(G_k,\\mathbb F_p)$, the quadratic presentation of $H^\\bullet(G_K,\\mathbb F_p)$ arises from a fiber-product construction on degree-$1$ generators and quadratic relations. Assuming stability of universal Koszulity under this quadratic gluing, we obtain that universal Koszulity of $H^\\bullet(G_{K_1},\\mathbb F_p)$ and $H^\\bullet(G_{K_2},\\mathbb F_p)$ implies universal Koszulity of $H^\\bullet(G_K,\\mathbb F_p)$. As a concrete application, we prove a composita stability theorem for certain Pythagorean fields whose maximal pro-$2$ Galois groups decompose as free pro-$2$ products of Demuškin groups and free factors. For suitable composita $K = K_1K_2$ of such fields, the mod-$2$ Galois cohomology ring $H^\\bullet(G_K(2),\\mathbb F_2)$ remains quadratic and universally Koszul. This provides large classes of fields, built from local, global, and Pythagorean base fields by admissible extensions and composita, whose maximal pro-$p$ Galois groups have universally Koszul cohomology, and yields inverse Galois obstructions: any finitely generated pro-$p$ group with nonquadratic or non-universally Koszul mod-$p$ cohomology cannot occur as the maximal pro-$p$ Galois group of a field in these families.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09240v1",
    "categories": [
      "math.ST",
      "cs.IT",
      "cs.LG",
      "math.PR",
      "stat.ML"
    ],
    "authors": [
      "Yihan Zhang",
      "Hong Chang Ji",
      "Ramji Venkataramanan",
      "Marco Mondelli"
    ],
    "title": "Optimal Estimation in Orthogonally Invariant Generalized Linear Models: Spectral Initialization and Approximate Message Passing",
    "abstract": "We consider the problem of parameter estimation from a generalized linear model with a random design matrix that is orthogonally invariant in law. Such a model allows the design have an arbitrary distribution of singular values and only assumes that its singular vectors are generic. It is a vast generalization of the i.i.d. Gaussian design typically considered in the theoretical literature, and is motivated by the fact that real data often have a complex correlation structure so that methods relying on i.i.d. assumptions can be highly suboptimal. Building on the paradigm of spectrally-initialized iterative optimization, this paper proposes optimal spectral estimators and combines them with an approximate message passing (AMP) algorithm, establishing rigorous performance guarantees for these two algorithmic steps. Both the spectral initialization and the subsequent AMP meet existing conjectures on the fundamental limits to estimation -- the former on the optimal sample complexity for efficient weak recovery, and the latter on the optimal errors. Numerical experiments suggest the effectiveness of our methods and accuracy of our theory beyond orthogonally invariant data.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09231v1",
    "categories": [
      "math.AT",
      "math.OC"
    ],
    "authors": [
      "Matija Blagojevic",
      "Christof Schütte"
    ],
    "title": "Existence of Multilateral Nash equilibria for families of games",
    "abstract": "This paper introduces two fundamentally new concepts to game theory: multilateral Nash equilibria and families of games. Starting with non-cooperative games, we show how these notions together seamlessly integrate into and naturally extend the classical theory, and simultaneously enable us to prove a powerful (multilateral) Nash equilibrium existence result with minimal assumptions on the game. Classically, a Nash equilibrium is a global strategy such that whichever player unilaterally deviates from the equilibrium, also reduces his own profit. For a k-lateral Nash equilibrium we now require that whichever group of k players collectively changes their strategies, also reduces all of the deviating players' profits. In this way, we obtain a filtration of equilibria, where the higher-lateral equilibria are less frequent. Furthermore, we derive an existence criterion for multilateral Nash equilibria and demonstrate how it reflects the increasing rarity of higher-lateral equilibria. Additionally, we show that some classical games have higher-lateral Nash equilibria, which in every case reveal the structure of these games from a new point of view. A family of games is a parameterized collection of non-cooperative games, where the parameter affects every aspect of the game. Typically, we assume that this dependence is continuous, thereby introducing a new structure. That way, we can avoid analyzing the games one at a time, and instead treat the family as a whole. This allows the parameter to take a central role in our theory, and shifts our attention from seeking a special strategy to searching for a special game with preferred strategies. Our main result proves the existence of a multilateral equilibrium in a family of games, maintaining minimalistic assumptions on the games individually. Surprisingly, the clique covering number of the Kneser graph makes a central appearance.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09219v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Remo Kretschmann",
      "Han Cheng Lie"
    ],
    "title": "Goodness-of-fit testing for nonlinear inverse problems with random observations",
    "abstract": "This work is concerned with nonparametric goodness-of-fit testing in the context of nonlinear inverse problems with random observations. Bayesian posterior distributions based upon a Gaussian process prior distribution are proven to contract at a certain rate uniformly over a set of true parameters. The corresponding posterior mean is shown to converge uniformly at the posterior contraction rate in the sense of satisfying a concentration inequality. Distinguishability for bounded alternatives separated from a composite null hypothesis at the posterior contraction rate is established using infimum plug-in tests based on the posterior mean and also on maximum a posteriori estimators. The results are applied to a class of inverse problems governed by ordinary differential equation initial value problems that is widely used in pharmacokinetics. For this class, uniform posterior contraction rates are proven and then used to establish distinguishability.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09135v1",
    "categories": [
      "math.GR",
      "math.NT"
    ],
    "authors": [
      "John F. R. Duncan",
      "Holly Swisher"
    ],
    "title": "Modular Functions and the Monstrous Exponents",
    "abstract": "We present a modular function-based approach to explaining, for primes larger than 3, the exponents that appear in the prime decomposition of the order of the monster finite simple group.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09741v1",
    "categories": [
      "math.AP",
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "Weiyi Kong",
      "Dachun Yang",
      "Wen Yuan"
    ],
    "title": "One-Sided and Parabolic BLO Spaces with Time Lag and Their Applications to Muckenhoupt $A_1$ Weights and Doubly Nonlinear Parabolic Equations",
    "abstract": "In this article, we first introduce the one-sided BLO space $\\mathrm{BLO}^+(\\mathbb{R})$ and characterize it, respectively, in terms of the one-sided Muckenhoupt class $A_1^+(\\mathbb{R})$ and the one-sided John--Nirenberg inequality. Using these, we establish the Coifman--Rochberg type decomposition of $\\mathrm{BLO}^+(\\mathbb{R})$ functions and show that $\\mathrm{BLO}^+(\\mathbb{R})$ is independent of the distance between the two intervals, which further induces the characterization of this space in terms of the one-sided BMO space $\\mathrm{BMO}^+(\\mathbb{R})$ (the Bennett type lemma). As applications, we prove that any $\\mathrm{BMO}^+(\\mathbb{R})$ function can split into the sum of two $\\mathrm{BLO}^+(\\mathbb{R})$ functions and we provide an explicit description of the distance from $\\mathrm{BLO}^+(\\mathbb{R})$ functions to $L^\\infty(\\mathbb{R})$. Finally, as a higher-dimensional analogue we introduce the parabolic BLO space $\\mathrm{PBLO}_γ^-(\\mathbb{R}^{n+1})$ with time lag, and we extend all the above one-dimensional results to $\\mathrm{PBLO}_γ^-(\\mathbb{R}^{n+1})$; furthermore, as applications, we not only establish the relationships between $\\mathrm{PBLO}_γ^-(\\mathbb{R}^{n+1})$ and the solutions of doubly nonlinear parabolic equations, but also provide a necessary condition for the negative logarithm of the parabolic distance function to belong to $\\mathrm{PBLO}_γ^-(\\mathbb{R}^{n+1})$ in terms of the weak porosity of the set.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09676v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Michel Mandjes",
      "Daniël Rutgers",
      "Werner Scheinhardt"
    ],
    "title": "Exact analysis of transient behavior of finite-capacity MAP-driven queues",
    "abstract": "This paper studies the workload distribution of a finite-capacity queue driven by a spectrally one-sided Markov additive process (MAP). Our main result provides the Laplace-Stieltjes transform of the workload at an exponentially distributed time, thereby uniquely characterizing its transient distribution. The proposed approach combines several decompositions with established fluctuation-theoretic results for spectrally one-sided Lévy processes. For the special case of Markov-modulated compound Poisson input, we additionally derive results for the idle time and the cumulative amount of lost work. We conclude this paper with a series of numerical experiments.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09646v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Fernando de Ávila Silva",
      "Marco Cappiello",
      "Alexandre Kirilov",
      "Pedro Meyer Tokoro"
    ],
    "title": "Differential Complexes in Time-Periodic Gelfand-Shilov Spaces",
    "abstract": "We study the global solvability of a class of differential complexes on the product manifold $\\mathbb{T}^m \\times \\mathbb{R}^n$ associated with systems of evolution operators of the form $L_r = \\partial_{t_r} + ia_r(t)P(x,D_x), r=1,\\ldots,m,$ where the coefficients $a_r$ are real-valued Gevrey functions on the torus and $P(x,D_x)$ is a globally elliptic normal differential operator on $\\mathbb{R}^n$. Within the framework of time-periodic Gelfand--Shilov spaces, we introduce a natural differential complex generated by these operators and investigate its solvability in both functional and ultradistributional settings. We provide a complete characterization of global solvability in terms of a Diophantine condition involving the constant part of the associated $1$-form and the spectrum of $P$. We also analyze global hypoellipticity of the complex. These results extend previous works on scalar operators and constant coefficient systems to the setting of differential complexes with time-dependent real coefficients.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09602v1",
    "categories": [
      "math.AG",
      "math.SG"
    ],
    "authors": [
      "Ionut Ciocan-Fontanine",
      "Yuki Koto"
    ],
    "title": "A mirror theorem for partial flag bundles",
    "abstract": "We construct a family of points on the Lagrangian cone of a partial flag bundle associated to a (possibly non-split) vector bundle from any Weyl-invariant $I$-function of a prequotient. This result can be seen as the nonabelian analogue of the mirror theorem for projective bundles in arXiv:2307.03696, and generalizes Oh's mirror theorem for split partial flag bundles in arXiv:1607.08326.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09584v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Marina Kleptsyna",
      "Andrey Piatnitski",
      "Alexandre Popier"
    ],
    "title": "Homogenization of nonlocal equations in randomly evolving media. Diffusion approximation",
    "abstract": "The paper deals with homogenization and higher order approximations of solutions to nonlocal evolution equations of convolution type whose coefficients are periodic in the spatial variables and random stationary in time. We assume that the convolution kernel has finite moments up to order three. Under proper mixing assumptions, we study the limit behavior of the normalized difference between solutions of the original and the homogenized problems and show that this difference converges to the solution of a linear stochastic partial differential equation.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09619v1",
    "categories": [
      "math.ST",
      "math.AG"
    ],
    "authors": [
      "Dario Gasbarra",
      "Kaie Kubjas",
      "Sangita Kulathinal",
      "Nataliia Kushnerchuk",
      "Fatemeh Mohammadi",
      "Etienne Sebag"
    ],
    "title": "Discrete-time, discrete-state multistate Markov models from the perspective of algebraic statistics",
    "abstract": "We study discrete-time, discrete-state multistate Markov models from the perspective of algebraic statistics. These models are widely studied in event history analysis, and are characterized by the state space, the initial distribution and the transition probabilities. A finite path under the multistate Markov model is a particular set of states occupied at finite time instances $\\{1, \\dots, n\\}$. The main goal of this paper is to establish a bridge between event history analysis and algebraic statistics. The joint probabilities of finite paths in these models have a natural monomial parametrization in terms of the initial distribution and the transition probabilities. We study the polynomial relations among joint path probabilities. When the statistical constraints on the parameters are disregarded, nonhomogeneous multistate Markov models of arbitrary order can be viewed as slices of decomposable hierarchical models. This yields a complete description of their vanishing ideals as toric ideals generated by explicit families of binomials. Moreover, the variety of this vanishing ideal equals the nonhomogeneous multistate Markov model on the probability simplex. In contrast, homogeneous multistate Markov models exhibit different algebraic behavior, as time homogeneity imposes additional polynomial relations, leading to vanishing ideals that are strictly larger than in the nonhomogeneous case. We also derive families of binomial relations that vanish on homogeneous multistate Markov models. We investigate maximum likelihood estimation from statistical and algebraic perspectives. For nonhomogeneous models, classical and algebraic formulas agree; in the homogeneous case, the algebraic approach is more complex. Lastly, we provide data applications where we demonstrate the statistical theory to obtain the maximum likelihood estimates of the parameters under specific multistate Markov models.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09028v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kanta Tochigi"
    ],
    "title": "Non-existence of Information-Geometric Fermat Structures: Violation of Dual Lattice Consistency in Statistical Manifolds with $L^n$ Structure",
    "abstract": "This paper reformulates Fermat's Last Theorem as an embedding problem of information-geometric structures. We reinterpret the Fermat equation as an $n$-th moment constraint, constructing a statistical manifold $\\mathcal{M}_n$ of generalized normal distributions via the Maximum Entropy Principle. By Chentsov's Theorem, the natural metric is the Fisher information metric ($L^2$); however, the global structure is governed by the $L^n$ moment constraint. This reveals a discrepancy between the local quadratic metric and the global $L^n$ structure. We axiomatically define an \"Information-Geometric Fermat Solution,\" postulating that the lattice structure must maintain \"dual lattice consistency\" under the Legendre transform. We prove the non-existence of such structures for $n \\ge 3$. Through the Poisson Summation Formula and Hausdorff-Young Inequality, we demonstrate that the Fourier transform induces an alteration of the function family ($L^n \\to L^q$, where $1/n + 1/q = 1$), rendering dual lattice consistency analytically impossible. This identifies a geometric obstruction where integer and energy structures are incompatible within a dually flat space. We conclude by discussing the correspondence between this model and elliptic curves.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09879v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Lingguang Li",
      "Hongyi Zhang"
    ],
    "title": "Hecke curves in Frobenius strata of moduli space of rank 2 vector bundles",
    "abstract": "Let $k$ be an algebraically closed field with characteristic $2$, and let $X$ be a smooth projective algebraic curve of genus $g \\geqslant 2$ over $k$. Let $\\mathcal{M}^s_X(2,\\mathcal{L})$ be the moduli space of rank $2$ stable vector bundles with determinant $\\mathcal{L}$ on $X$. The Frobenius stratification measures the instability of bundles in $\\mathcal{M}^s_X(r,\\mathcal{L})$ under pullback by the Frobenius map. We show that there exists a Frobenius stratum in $\\mathcal{M}^s_X(2,\\mathcal{L})$ which is covered by Hecke curves.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09859v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Duncan Dauvergne",
      "Oliver Scott Pankratz"
    ],
    "title": "Geodesic networks and the disjointness gap in the directed landscape",
    "abstract": "The directed landscape is a random directed metric on the plane that arises as the scaling limit of metric models in the KPZ universality class. For a pair of points p, q, the disjointness gap G(p; q) measures the shortfall when we optimize length over pairs of disjoint paths from p to q versus optimizing over all pairs of paths. Any spatial marginal of G is simply the gap between the top two lines in an Airy line ensemble. In this paper, we show that when the start and end time are fixed, the disjointness gap fully encodes the set of exceptional geodesic networks. The correspondence uses simple features of the disjointness gap, e.g. zeroes, local minima. We give a similar correspondence relating semi-infinite geodesic networks to a Busemann gap function. The proofs are deterministic given a list of soft properties related to the coalescent geometry of the directed landscape.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09853v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Lixin Cheng",
      "Chulei Liu",
      "Wen Zhang"
    ],
    "title": "An Extension and Refinement of the Brouwer-Schauder-Tychonoff Fixed Point Theorem",
    "abstract": "In this paper, we present the Brouwer-Schauder-Tychonoff fixed point theorem on locally convex spaces as the following extension and improvement:\n  Suppose that S is a compact star-shaped subset with respect to p in S with its convexity index alpha(p)>0. Then every continuous self-mapping f has one of the following two properties:\n  (a) The point p is a fixed point of f;\n  (b) f has uncountably many different eigenvalues and eigenvectors.\n  Note that a closed bounded star-shaped set in a locally convex space is convex if and only if alpha=1, and we extend a Brouwer's type fixed-point theorem on compact star-shaped sets in Banach spaces in a more concise manner to locally convex spaces, thereby this is a simplification and an improvement of the Tychonoff fixed-point theorem to compact star-shaped sets.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09840v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Hongye Wang",
      "Chang He",
      "Bo Jiang"
    ],
    "title": "Adaptive Single-Loop Methods for Stochastic Minimax Optimization on Riemannian Manifolds",
    "abstract": "Stochastic minimax optimization on Riemannian manifolds has recently attracted significant attention due to its broad range of applications, such as robust training of neural networks and robust maximum likelihood estimation. Existing optimization methods for these problems typically require selecting stepsizes based on prior knowledge of specific problem parameters, such as Lipschitz-type constants and (geodesic) strong concavity constants. Unfortunately, these parameters are often unknown in practice. To overcome this issue, we develop single-loop adaptive methods that automatically adjust stepsizes using cumulative Riemannian (stochastic) gradient norms. We first propose a deterministic single-loop Riemannian adaptive gradient descent ascent method and show that it attains an $ε$-stationary point within $O(ε^{-2})$ iterations. This deterministic method is of independent interest and lays the foundation for our subsequent stochastic method. In particular, we propose the Riemannian stochastic adaptive gradient descent ascent method, which finds an $ε$-stationary point in $O(ε^{-6})$ iterations. Under additional second-order smoothness, this iteration complexity is further improved to $O(ε^{-4})$, which even outperforms the corresponding complexity result in Euclidean space. Some numerical experiments on real-world applications are conducted, including the regularized robust maximum likelihood estimation problem, and the robust training of neural networks with orthonormal weights. The results are encouraging and demonstrate the effectiveness of adaptivity in practice.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09830v1",
    "categories": [
      "math.LO",
      "math.CO"
    ],
    "authors": [
      "Alakh Dhruv Chopra",
      "Fedor Pakhomov"
    ],
    "title": "Well-quasi-orders on finite trees and transfinite sequences",
    "abstract": "We study the well-quasi-order (wqo) consisting of the set of finite trees with leaf labels coming from an arbitrary wqo $Q$, ordered by tree homomorphisms which respect the order on the labels. This is a variant of the usual Kruskal tree ordering without infima preservation. We calculate the precise maximal order types of this class of wqos as a function of the maximal order type of the labels $Q$. In the process, we sharpen some recent results of Friedman and Weiermann. Furthermore, we show a correspondence with indecomposable transfinite sequences with finite range, over elements of the wqo $Q$, of length less than $ω^ω$. Nash-Williams proved that arbitrary transfinite sequences with finite range are also well-quasi-ordered, but there are no known methods to extract bounds on the maximal order type from the proof. More concrete proofs for sequences of length less than $α$ for some $α< ω^ω$ were given by Erdős and Rado. Using the correspondence, we obtain precise bounds for the entire collection of transfinite sequences with finite range of length less than $ω^ω$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09815v1",
    "categories": [
      "math.AT",
      "math.GN"
    ],
    "authors": [
      "Jānis Lazovskis"
    ],
    "title": "Simple connectedness of the Ran space",
    "abstract": "The space of all finite non-empty subsets of a topological space $X$, also known as the Ran space of $X$, is weakly contractible for $X$ path connected. We consider subspaces $\\mathrm{Ran}_{\\leqslant n}(X)$ of the Ran space given by all subsets of $X$ of size at most $n$, and present results on their first homotopy groups. In particular, we show that the induced map $π_1(\\mathrm{Ran}_{\\leqslant n}(X)) \\to π_1(\\mathrm{Ran}_{\\leqslant n+2}(X))$ is trivial for all positive integers $n$, and even more, show that $π_1(\\mathrm{Ran}_{\\leqslant n}(X)) = 0$ for all $n\\geqslant 4$, by explicitly drawing the path homotopies that contract any loop to a point.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09811v1",
    "categories": [
      "math.CO",
      "math.GR"
    ],
    "authors": [
      "Jan Kurkofka",
      "Tim Planken"
    ],
    "title": "A characterisation of all vertex-transitive finite graphs of connectivity < 5",
    "abstract": "We characterise all vertex-transitive finite connected graphs as essentially 5-connected or on a short list of explicit graph-classes. Our proof heavily uses Tutte-type canonical decompositions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09803v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Yixin He",
      "Quanyu Tang"
    ],
    "title": "An Erdős--Trotter problem on antichains with multiplicity $r$ on each occurring level",
    "abstract": "Fix an integer $r\\ge2$. For each $n$ we consider families $\\mathcal F\\subseteq 2^{[n]}$ that form an antichain and have the property that, for every $t$, if there exists $A\\in\\mathcal F$ with $|A|=t$ then there exist at least $r$ members of $\\mathcal F$ of size $t$. A problem of Erdős and Trotter asserts that, for each fixed $r$, there exists a threshold $n_0(r)$ such that whenever $n>n_0(r)$ one can achieve $n-3$ distinct set sizes in such a family, and asks for estimates on $n_0(r)$. We compute that $n_0(2)=3$ and $n_0(3)=8$. For all $r\\ge4$ we prove matching linear bounds up to lower-order terms, namely $$ 2r+2 \\le n_0(r) \\le 2r+2\\log_2 r + O(\\log_2\\log_2 r). $$",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09778v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Shun Li",
      "Yong Yu"
    ],
    "title": "Phase Transition With Rapini-Papoular Surface Anchoring",
    "abstract": "We analyze the dynamical (in)stability of nematic liquid crystals in the presence of external magnetic fields and Rapini-Papoular surface potential. The P-HAN transition is investigated using a simplified 3D Ericksen-Leslie system. We find the thickness threshold of the P-HAN transition. If the thickness of the nematic layer exceeds this threshold, there is a global-in-time suitable weak solution converging exponentially to a nontrivial equilibrium state as time tends to infinity. If the thickness is no more than the threshold, the global-in-time suitable weak solution has a trivial long-time asymptotic limit. Our results rigorously justify the P-HAN transition discussed in the physics literature.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10103v1",
    "categories": [
      "math.ST",
      "math.PR"
    ],
    "authors": [
      "Frédéric Ouimet"
    ],
    "title": "Minimax properties of gamma kernel density estimators under $L^p$ loss and $β$-Hölder smoothness of the target",
    "abstract": "This paper considers the asymptotic behavior in $β$-Hölder spaces, and under $L^p$ loss, of the gamma kernel density estimator introduced by Chen [Ann. Inst. Statist. Math. 52 (2000), 471-480] for the analysis of nonnegative data, when the target's support is assumed to be upper bounded. It is shown that this estimator can achieve the minimax rate asymptotically for a suitable choice of bandwidth whenever $(p,β)\\in [1,3)\\times(0,2]$ or $(p,β)\\in [3,4)\\times ((p-3)/(p-2),2]$. It is also shown that this estimator cannot be minimax when either $p\\in [4,\\infty)$ or $β\\in (2,\\infty)$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10020v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Qianru Yu",
      "Tianji Yang",
      "Jingfan Meng",
      "Jun Xu"
    ],
    "title": "METTLE: Efficient Streaming Erasure Code with Peeling Decodability",
    "abstract": "In this work, we solve a long-standing open problem in coding theory with broad applications in networking and systems: designing an erasure code that simultaneously satisfies three requirements: (1) high coding efficiency, (2) low coding complexity, and (3) being a streaming code (defined as one with low decoding latency). We propose METTLE (Multi-Edge Type with Touch-less Leading Edge), the first erasure code to meet all three requirements. Compared to \"streaming RaptorQ\" (RaptorQ configured with a small source block size to ensure a low decoding latency), METTLE is only slightly worse in coding efficiency, but 47.7 to 84.6 times faster to decode.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09966v1",
    "categories": [
      "math.AG",
      "math.AC"
    ],
    "authors": [
      "Alexandru Dimca",
      "Gabriel Sticlaru"
    ],
    "title": "Graded Betti numbers of the Jacobian algebra of surfaces in $\\mathbb P^3$",
    "abstract": "We compute an explicit closed formula for the Hilbert polynomial of the Jacobian algebra $M(f)$ of a reduced surface $X:f=0$ in $\\mathbb P^3$ in terms of the graded Betti numbers of the algebra $M(f)$. When $X$ has only isolated singularities, a result by A. du Plessis and C. T. C. Wall yields new necessary condition for a set of positive integers to be the graded Betti numbers of the Jacobian algebra of such a surface. The comparison with the plane curve case is discussed in detail and additional information is given in the case of nodal surfaces.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09899v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Mohsen Asgharzadeh",
      "Elham Mahdavi"
    ],
    "title": "Remarks on modules of finite projective dimension",
    "abstract": "We investigate homological and depth-theoretic properties of finitely generated modules of finite projective dimension over Noetherian local rings. A central theme is the study of criteria for freeness and reflexivity derived from the torsion-freeness or reflexivity of tensor products of the form \\( M \\otimes_R M \\) and \\( M \\otimes_R M^* \\). Under mild homological assumptions, we prove that such properties of these tensor products impose strong structural constraints on \\( M \\), often forcing it to be free. These results generalize classical theorems of Auslander beyond the regular case and contribute to the broader understanding of rigidity phenomena in commutative algebra.\n  The second part of the paper is devoted to the dimension and support of Ext-modules, particularly \\( {Ext}^i_R(M, R) \\) for critical values of i, when \\( M \\) has finite projective dimension. We establish sharp bounds on their Krull dimensions, analyze their behavior for prime and equidimensional modules, and relate these findings to the grade conjecture and other homological conjectures. Applications include new cases of a question of Jorgensen, which asks whether \\( {pd}(M) < i \\) whenever \\({Ext}^i_R(M, M) = 0 \\) and M has finite projective dimension over a complete intersection ring.\n  Finally, we examine the projective dimension of prime ideals in rings that fail chain conditions. We show that in non-catenary or pathological saturated chain settings, such prime ideals often have infinite projective dimension.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09884v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Alessia Revelli",
      "Steven Scheirer"
    ],
    "title": "Grouped Stirling complexes",
    "abstract": "Given a graph $G$, a configuration space of $G$ can be thought of as the set of all possible configurations of \"robots\" which can move throughout $G$, subject to some constraints. We introduce a type of configuration space which we call Grouped Stirling complexes, denoted by $S_{\\vec r}(G)$, in which we place robots in groups subject to two constraints. First, there must be at least one robot on each vertex of $G$, and second, any two robots from the same group must be \"separated by at least one full open edge\" of $G$. The space $S_{\\vec r}(G)$ has a closed cell structure, which means it can be built out of cells of various dimensions. Our main results show $S_{\\vec r}(G)$ is path-connected, provided there are at least three groups, and determine the number of cells of $S_{\\vec r}(G)$ in certain cases.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09831v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Murilo Corato-Zanarella"
    ],
    "title": "First explicit reciprocity law for unitary Friedberg--Jacquet periods",
    "abstract": "Consider a unitary group $G(\\mathbb{A}_{F^+})=U_{2r}(\\mathbb{A}_{F^+})$ over a CM extension $F/F^+$ with $G(\\mathbb{A}_\\infty)$ compact. In this article, we study the Beilinson--Bloch--Kato conjecture for motives associated to irreducible cuspidal automorphic representations $π$ of $G(\\mathbb{A}_{F^+}).$ We prove that if $π$ is distinguished by the unitary Friedberg--Jacquet period, then the Bloch--Kato Selmer group (with coefficients in a favorable field) of the motive of $Π=\\mathrm{BC}(π)$ vanishes.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09804v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Toshiaki Hishida"
    ],
    "title": "Large time decay of the Oseen flow in exterior domains subject to the Navier slip-with-friction boundary condition",
    "abstract": "Consider the motion of a viscous incompressible fluid filling a 3D exterior domain $Ω$ subject to the Navier slip-with-friction boundary condition as well as outflow at infinity. For the Oseen system as the linearization, we discuss the resolvent set under a certain relationship among the geometry of the boundary $\\partialΩ$, friction coefficient $α(x)$ and the outflow $u_\\infty$. We then study the regularity of the resolvent near the origin in the complex plane to develop $L^q$-$L^r$ decay estimates of the Oseen semigroup provided that $α(x)+u_\\infty\\cdotν(x)/2\\geq 0$ for every $x\\in\\partialΩ$, where $ν(x)$ stands for the outward unit normal to the boundary $\\partialΩ$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09799v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Yuan He",
      "Yuan Yu",
      "Yue Yu"
    ],
    "title": "Time-marching representation based quantum algorithms for the Lattice Boltzmann model of the advection-diffusion equation",
    "abstract": "This article introduces a novel framework for developing quantum algorithms for the Lattice Boltzmann Method (LBM) applied to the advection-diffusion equation. We formulate the collision-streaming evolution of the LBM as a compact time-marching scheme and rigorously establish its stability under low Mach number conditions. This unified formulation eliminates the need for classical measurement at each time step, enabling a systematic and fully quantum implementation. Building upon this representation, we investigate two distinct quantum algorithmic approaches. The first is a time-marching quantum algorithm realized through sequential evolution operators, for which we provide a detailed implementation-including block-encoding and dilating unitarization-along with a full complexity analysis. The second employs a quantum linear systems algorithm, which encodes the entire time evolution into a single global linear system. We demonstrate that both methods achieve comparable asymptotic time complexities. The proposed algorithms are validated through numerical simulations of benchmark problems in one and two dimensions. This work provides a systematic, measurement-free pathway for the quantum simulation of advection-diffusion processes via the lattice Boltzmann paradigm.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09766v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Hartosh Singh Bal"
    ],
    "title": "Partition Frequency Moments: Modularity and Congruences",
    "abstract": "We study frequency moments of partition statistics arising from Euler products $A(q)=\\prod_{r\\ge1}(1-q^r)^{-c(r)}$ via a transform that expresses the moment generating functions as $B(q)$ times explicit divisor--sum series determined by $c(r)$. When $A(q)$ is modular (typically an $η$--quotient), this yields (quasi)modular forms whose coefficients can be projected to arithmetic progressions and certified modulo primes by a Sturm bound, giving an effective pipeline for detecting and proving Ramanujan--type congruences for frequency moments.\n  For ordinary partitions we recover and certify several congruences for odd moments in nonzero residue classes (e.g.\\ $M_3(7n+5)\\equiv 0\\pmod7$ and $M_3(11n+6)\\equiv 0\\pmod{11}$). As a second input, we apply the same pipeline to overpartitions and certify a family of zero--class congruences $M_m^{\\overline{\\ }}(\\ell n)\\equiv 0\\pmod{\\ell}$ (including $m=5,7,11,13$), exhibiting a sharp contrast with the ordinary partition case: no nonzero residue--class congruences are observed for overpartition moments in our scan range. We also demonstrate that filtering the statistic via the Glaisher--character dictionary can itself create new Ramanujan--type progressions, e.g.\\ a quadratic twist yields the certified congruence $\\widehat{M}^{χ_5}_3(5n+4)\\equiv 0\\pmod{5}$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09748v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Daan Otto",
      "Jannis Kurtz",
      "Dick den Hertog",
      "Ilker Birbil"
    ],
    "title": "Linear Model Extraction via Factual and Counterfactual Queries",
    "abstract": "In model extraction attacks, the goal is to reveal the parameters of a black-box machine learning model by querying the model for a selected set of data points. Due to an increasing demand for explanations, this may involve counterfactual queries besides the typically considered factual queries. In this work, we consider linear models and three types of queries: factual, counterfactual, and robust counterfactual. First, for an arbitrary set of queries, we derive novel mathematical formulations for the classification regions for which the decision of the unknown model is known, without recovering any of the model parameters. Second, we derive bounds on the number of queries needed to extract the model's parameters for (robust) counterfactual queries under arbitrary norm-based distances. We show that the full model can be recovered using just a single counterfactual query when differentiable distance measures are employed. In contrast, when using polyhedral distances for instance, the number of required queries grows linearly with the dimension of the data space. For robust counterfactuals, the latter number of queries doubles. Consequently, the applied distance function and robustness of counterfactuals have a significant impact on the model's security.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10059v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Apratim Bhattacharya",
      "Sebastian Throm"
    ],
    "title": "Convergence to equilibrium for a class of coagulation-fragmentation equations without detailed balance",
    "abstract": "We prove convergence to equilibrium for a class of coagulation-fragmentation equations that do not satisfy a detailed balance condition. More precisely, we consider perturbations of constant rate kernels. Our result provides in particular explicit convergence rates. Uniqueness of the stationary states is proven as well for the considered class of kernels.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09996v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Timo Berthold",
      "Fritz Geis"
    ],
    "title": "Learning to Choose Branching Rules for Nonconvex MINLPs",
    "abstract": "Outer-approximation-based branch-and-bound is a common algorithmic framework for solving MINLPs (mixed-integer nonlinear programs) to global optimality, with branching variable selection critically influencing overall performance. In modern global MINLP solvers, it is unclear whether branching on fractional integer variables should be prioritized over spatial branching on variables, potentially continuous, that show constraint violations, with different solvers following different defaults. We address this question using a data-driven approach. Based on a test set of hundreds of heterogeneous public and industrial MINLP instances, we train linear and random forest regression models to predict the relative speedup of the FICO(R) Xpress Global solver when using a branching rule that always prioritizes variables with violated integralities versus a mixed rule, allowing for early spatial branches.\n  We introduce a practical evaluation methodology that measures the effect of the learned model directly in terms of the shifted geometric mean runtime. Using only four features derived from strong branching and the nonlinear structure, our linear regression model achieves an 8-9% reduction in geometric-mean solving time for the Xpress solver, with over 10% improvement on hard instances. We also analyze a random regression forest model. Experiments across solver versions show that a model trained on Xpress 9.6 still yields significant improvements on Xpress 9.8 without retraining.\n  Our results demonstrate how regression models can successfully guide the branching-rule selection and improve the performance of a state-of-the-art commercial MINLP solver.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09965v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Italo J. Dejter"
    ],
    "title": "List and total colorings of multiset permutation graphs",
    "abstract": "Let $k$ and $\\ell$ be positive integers. The multiset star transposition graph ST$_k^\\ell$ has as vertices the $k\\ell$-strings $v_0\\cdots v_{k\\ell-1}$ on $k$ symbols, each symbol repeated $\\ell$ times, and edges given by the transpositions $(v_0\\;v_i)$ with $v_i\\ne v_0$ ($0<i<k\\ell$). It is shown for $k>1$ and $\\ell>2$ that ST$_k^\\ell$ is $(\\ell-1)$-choosable and that, as a result, admits total colorings. In order to prove such assertions, the notion of efficient domination set (or E-set) of a graph is generalized for $\\ell>1$ to that of an efficient dominating$\\,^\\ell$-set and applied to the graphs ST$_k^\\ell$\\,, showing they admit vertex partitions that generalize the Dejter-Serra partitions of ST$_k^1$ into E-sets, but not efficiently in the sense that the distance of each E$^\\ell$-set be 3. Efficiently in such sense however, $ST^2_k$ and the related 2-set pancake permutation graph PC$^2_k$, among other intermediate permutation graphs, are shown to admit total colorings with $2k-1$ colors that determine partitions into $2k-1$ E-sets, each with distance 3.\n  Furthermore, associated E-chains are examined.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09959v1",
    "categories": [
      "math.ST",
      "cs.LG",
      "stat.ML"
    ],
    "authors": [
      "Hugo Latourelle-Vigeant",
      "Theodor Misiakiewicz"
    ],
    "title": "Statistical-Computational Trade-offs in Learning Multi-Index Models via Harmonic Analysis",
    "abstract": "We study the problem of learning multi-index models (MIMs), where the label depends on the input $\\boldsymbol{x} \\in \\mathbb{R}^d$ only through an unknown $\\mathsf{s}$-dimensional projection $\\boldsymbol{W}_*^\\mathsf{T} \\boldsymbol{x} \\in \\mathbb{R}^\\mathsf{s}$. Exploiting the equivariance of this problem under the orthogonal group $\\mathcal{O}_d$, we obtain a sharp harmonic-analytic characterization of the learning complexity for MIMs with spherically symmetric inputs -- which refines and generalizes previous Gaussian-specific analyses. Specifically, we derive statistical and computational complexity lower bounds within the Statistical Query (SQ) and Low-Degree Polynomial (LDP) frameworks. These bounds decompose naturally across spherical harmonic subspaces. Guided by this decomposition, we construct a family of spectral algorithms based on harmonic tensor unfolding that sequentially recover the latent directions and (nearly) achieve these SQ and LDP lower bounds. Depending on the choice of harmonic degree sequence, these estimators can realize a broad range of trade-offs between sample and runtime complexity. From a technical standpoint, our results build on the semisimple decomposition of the $\\mathcal{O}_d$-action on $L^2 (\\mathbb{S}^{d-1})$ and the intertwining isomorphism between spherical harmonics and traceless symmetric tensors.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09928v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Giannis Delimpaltadakis",
      "Pol Mestres",
      "Jorge Cortés",
      "W. P. M. H. Heemels"
    ],
    "title": "Safe Feedback Optimization through Control Barrier Functions",
    "abstract": "Feedback optimization refers to a class of methods that steer a control system to a steady state that solves an optimization problem. Despite tremendous progress on the topic, an important problem remains open: enforcing state constraints at all times. The difficulty in addressing it lies on mediating between the safety enforcement and the closed-loop stability, and ensuring the equivalence between closed-loop equilibria and the optimization problem's critical points. In this work, we present a feedback-optimization method that enforces state constraints at all times employing high-order control-barrier functions. We provide several results on the proposed controller dynamics, including well-posedness, safety guarantees, equivalence between equilibria and critical points, and local and global (in certain convex cases) asymptotic stability of optima. Various simulations illustrate our results.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09926v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Fielbaum Andrés",
      "Cominetti Roberto",
      "Correa José"
    ],
    "title": "The Increasing Gap Dynamics in a General Spatial Matching Model",
    "abstract": "We study a representation of a problem that appears in numerous transport systems: $N$ servers distributed over a given space (e.g., cars on an urban network), receive random requests from arriving users who get assigned to the closest server, after which this server is replaced by a new one at a random location. We show that this creates a negative feedback loop, which we call \\textit{Increasing Gap Dynamics} (IGD): when a server is assigned a spatial gap forms, which is more likely to attract new users that further widen the gap. The simplest version of our model is a one-dimensional circle, for which we derive analytical results showing that the system converges to an inefficient equilibrium, worse than both balanced and fully random distributions of servers. We prove that an optimal assignment policy always matches the user to one of its two neighbouring servers so that long gaps tend to widen. Hence, the IGD persists even when assigning optimally rather than greedily. In two dimensions, the appearance of the IGD is illustrated through simulations on a square region. Finally, simulations of a proper ride-hailing system using real data from Manhattan confirms that the IGD arises and that it is responsible for the appearance of the well-known Wild Goose Chase.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09908v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Diane M. Donovan",
      "Mike Grannell",
      "Emine Şule Yazıcı"
    ],
    "title": "On the minimum number of entries in a pair of maximal orthogonal partial Latin squares",
    "abstract": "It is shown that if $F$ denotes the number of filled cells in a superimposed pair of maximal orthogonal partial Latin squares of order $n$, then $F\\ge n^2/3$. This resolves a conjecture raised in an earlier paper by the current authors. It is also shown that, for $n\\ge 21$, the least possible number of filled cells in a pair of maximal orthogonal partial Latin squares is $\\lceil n^2/3 \\rceil$, and that the structure that achieves this bound is unique up to permutations of rows, columns and entries.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09889v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Eric Ahlqvist",
      "Richard Pink"
    ],
    "title": "Schur $σ$-groups of type $(3,3)$ for $p=3$",
    "abstract": "For any imaginary quadratic field $K$, the Galois group $G_K$ of its maximal unramified pro-$3$-extension is a Schur $σ$-group. If this has Zassenhaus type $(3,3)$, there are 13 possibilities for the isomorphism class of the finite quotient $G_K/D_4(G_K)$.\n  We prove that for 10 of these 13 cases $G_K$ is either finite or isomorphic to an open subgroup of a form of $\\mathop{\\rm PGL}_2$ over $\\mathbb{Q}_3$. Combined with the Fontaine-Mazur conjecture, or with earlier work on an analogue of the Cohen--Lenstra heuristic for Schur $σ$-groups, this lends credence to the \"if\" part of a conjecture of McLeman.\n  Using explicit computations of triple Massey products, we also test the heuristic for all imaginary quadratic fields $K$ with $d(G_K)=2$ and discriminant $-10^8 < d_K < 0$ and find a reasonably good agreement.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09885v1",
    "categories": [
      "math.DG",
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Alejandro Cabrera",
      "Matias del Hoyo"
    ],
    "title": "Geometric differentiation of simplicial manifolds",
    "abstract": "We provide a complete geometric solution to the differentiation problem for simplicial manifolds, extending classical Lie theory and subsuming existing homotopical and formal approaches within a unified framework. First, we establish a normal form theorem setting a system of compatible tubular neighborhoods. Building on this description, we identify a differentiating ideal in the algebra of cochains, prove that the quotient is semi-free, and interpret it as the Chevalley-Eilenberg algebra of the thus defined higher Lie algebroid. As an application, we introduce a higher version of the van Est map and prove a van Est isomorphism theorem in cohomology, under natural connectivity assumptions. Finally, we identify the algebraic mechanism underlying geometric differentiation as a monoidal refinement of the dual Dold-Kan correspondence, providing a conceptual explanation of the construction and relating it to earlier homotopical and functor-of-points approaches.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09875v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Manh Hong Duong",
      "Zihui He"
    ],
    "title": "Multi-species kinetic models: GENERIC formulation and Fisher information",
    "abstract": "In this paper, we study the GENERIC structures of multi-species spatially inhomogeneous Boltzmann and Landau equations with Bose-Einstein, Maxwell-Boltzmann, and Fermi-Dirac statistics. In addition, under suitable assumptions on the collision kernels, we show that the Fisher information for the multi-species spatially homogeneous Boltzmann equation is non-increasing in time.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09842v1",
    "categories": [
      "math.OC",
      "cs.LG"
    ],
    "authors": [
      "Fabian Schaipp",
      "Robert M. Gower",
      "Adrien Taylor"
    ],
    "title": "Step-Size Stability in Stochastic Optimization: A Theoretical Perspective",
    "abstract": "We present a theoretical analysis of stochastic optimization methods in terms of their sensitivity with respect to the step size. We identify a key quantity that, for each method, describes how the performance degrades as the step size becomes too large. For convex problems, we show that this quantity directly impacts the suboptimality bound of the method. Most importantly, our analysis provides direct theoretical evidence that adaptive step-size methods, such as SPS or NGN, are more robust than SGD. This allows us to quantify the advantage of these adaptive methods beyond empirical evaluation. Finally, we show through experiments that our theoretical bound qualitatively mirrors the actual performance as a function of the step size, even for nonconvex problems.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09818v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Alexander V. Kolesnikov"
    ],
    "title": "Homogeneous maximizers of the Blaschke--Santalo-type functionals",
    "abstract": "We study Blaschke--Santal{ó}-type inequalities for $N \\ge 2$ sets (functions) and a special class of cost functions. In particular, we prove new results about reduction of the maximization problem for the Blaschke--Santal{ó}-type functional to homogeneous case (functional inequalities on the sphere) and extend the symmetrization argument to the case of $N > 2$ sets.\n  We also discuss links to the multimagrinal optimal transportation problem and the related sharp transportation-information inequalities.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09808v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Alessandro Pinzi",
      "Filippo Riva",
      "Giuseppe Savaré"
    ],
    "title": "A direct method for doubly nonlinear equations via convexification in spaces of measures and duality",
    "abstract": "Existence of solutions to doubly nonlinear equations in reflexive Banach spaces is established by resorting to a global-in-time variational approach inspired by De Giorgi's principle, which characterizes the associated flows as null-minimizers of a suitable energy-dissipation functional defined on trajectories. In contrast to the celebrated minimizing movements scheme, the proposed strategy does not rely on any time-discretization or iterative constructions. Instead, it provides a direct method based on the relaxation of the problem in spaces of measures, constrained by the continuity equation: in this procedure, no gap is introduced due to the Ambrosio's superposition principle.\n  Within this weak convex framework, the validity of the null-minimization property is recovered through two further steps. First, a careful application of the Von Neumann minimax theorem yields an identification of the dual problem as a supremum over the set of smooth and bounded cylinder functions, solving an Hamilton-Jacobi-type inequality. Secondly, a suitable \"backward boundedness\" property of solutions to such Hamilton-Jacobi system gives a proper bound of the dual problem, ensuring that the minimum value of the original functional is actually zero.\n  The proposed strategy naturally extends to non-autonomous equations, encompassing time- and space-dependent dissipation potentials and time-dependent potential energies.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09762v1",
    "categories": [
      "math.ST",
      "math.NA"
    ],
    "authors": [
      "Kensuke Aishima"
    ],
    "title": "Asymptotic analysis of the Gaussian kernel matrix for partially noisy data in high dimensions",
    "abstract": "The Gaussian kernel is one of the most important kernels, applicable to many research fields, including scientific computing and data science. In this paper, we present asymptotic analysis of the Gaussian kernel matrix in high dimension under a statistical model of noisy data. The main result is a nice combination of Karoui's asymptotic analysis with procedures of constrained low rank matrix approximations. More specifically, Karouli clarified an important asymptotic structure of the Gaussian kernel matrix, leading to strong consistency of the eigenvectors, though the eigenvalues are inconsistent. This paper focuses on the above results and presents a consistent estimator with the use of the smallest eigenvalue, whenever the target kernel matrix tends to low rank in the asymptotic regime. Importantly, asymptotic analysis is given under a statistical model representing partial noise. Although a naive estimator is inconsistent, applying an optimization method for low rank approximations with constraints, we overcome the difficulty caused by the inconsistency, resulting in a new estimator with strong consistency in rank deficient cases.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10077v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ignacio Ceresa Dussel",
      "Julián Fernández Bonder",
      "Pablo Ochoa"
    ],
    "title": "An eigenvalue problem for a generalized polyharmonic operator in Orlicz-Sobolev spaces without the $Δ_2$-condition",
    "abstract": "In this paper, we consider a generalized polyharmonic eigenvalue problem of the form $A(u)= λh(u)$ in a bounded smooth domain with Dirichlet boundary conditions in the setting of higher-order Orlicz-Sobolev spaces. Here, $A$ is a very general operator depending on $u$ and arbitrary higher-order derivatives of $u$, whose growth is governed by an Orlicz function, and $h$ is a lower order term. Combining the theories of pseudomonotone operators with complementary systems, we prove that this eigenvalue problem has an infinite number of eigenfunctions and that the corresponding sequence of eigenvalues tends to infinity. We point out that the $Δ_2$-condition is not assumed for the involved Orlicz functions. Finally, we prove a first regularity result for eigenfunctions by following a De Giorgi's iteration scheme.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10061v1",
    "categories": [
      "math.AP",
      "physics.ao-ph"
    ],
    "authors": [
      "Martin Donati",
      "Emeric Roulley"
    ],
    "title": "Confinement results near point vortices on the rotating sphere",
    "abstract": "We study the Euler equation on the rotating sphere in the case where the absolute vorticity is initially sharply concentrated around several points. We follow the literature already concerning vorticity confinement for the planar Euler equations, and obtain similar results on the rotating sphere, with new challenges due to the geometry. More precisely, we show the improbability of collisions for point-vortices, logarithmic in time absolute vorticity confinement for general configurations, the optimality of this last result in general, and the existence of configurations with power-law long confinement. We take this opportunity to write a unified, self-contained, and improved version of all the proofs, previously scattered across multiple papers on the planar case, with detailed exposition for pedagogical clarity.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10051v1",
    "categories": [
      "math.GT",
      "math.SG"
    ],
    "authors": [
      "Seraphina Eun Bi Lee",
      "Carlos A. Serván"
    ],
    "title": "Infinitely many Lefschetz pencils on ruled surfaces",
    "abstract": "We show that any ruled surface $X$ with $χ(X) < 0$ admits infinitely many inequivalent Lefschetz pencils of fixed genus and number of base points. Our proof proceeds by building infinitely many inequivalent Lefschetz fibrations on a blow-up $X \\# 4 \\overline{\\mathbb{CP}^2}$ of $X$ with constant fiber class, via a mechanism known as partial conjugation. Furthermore, there exists a symplectic form on $X$ compatible with all such pencils, and similarly for the fibrations in $X\\#4\\overline{\\mathbb{CP}^2}$. This provides the first example of this phenomenon and makes progress on Problem 4.98 of the K3 list of problems in low-dimensional topology in the case of ruled surfaces.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10033v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Yuntao Zang"
    ],
    "title": "Entropy formula for surface diffeomorphisms",
    "abstract": "Let $f$ be a $C^r$ ($r>1$) diffeomorphism on a compact surface $M$ with $h_{\\rm top}(f)\\geq\\frac{λ^{+}(f)}{r}$ where $λ^{+}(f):=\\lim_{n\\to+\\infty}\\frac{1}{n}\\max_{x\\in M}\\log \\left\\|Df^{n}_{x}\\right\\|$. We establish an equivalent formula for the topological entropy: $$h_{\\rm top}(f)=\\lim_{n\\to+\\infty}\\frac{1}{n}\\log\\int_{M}\\left\\|Df^{n}_{x}\\right\\|\\,dx.$$ Our approach builds on the key ideas developed in the works of Buzzi-Crovisier-Sarig (\\emph{Invent. Math.}, 2022) and Burguet (\\emph{Ann. Henri Poincaré}, 2024) concerning the continuity of the Lyapunov exponents.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10022v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Julien Hermant"
    ],
    "title": "Acceleration for Polyak-Łojasiewicz Functions with a Gradient Aiming Condition",
    "abstract": "It is known that when minimizing smooth Polyak-Łojasiewicz (PL) functions, momentum algorithms cannot significantly improve the convergence bound of gradient descent, contrasting with the acceleration phenomenon occurring in the strongly convex case. To bridge this gap, the literature has proposed strongly quasar-convex functions as an intermediate non-convex class, for which accelerated bounds have been suggested to persist. We show that this is not true in general: the additional structure of strong quasar-convexity does not suffice to guaranty better worst-case bounds for momentum compared to gradient descent. As an alternative, we study PL functions under an aiming condition that measures how well the descent direction points toward a minimizer. This perspective clarifies the geometric ingredient enabling provable acceleration by momentum when minimizing PL functions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09952v1",
    "categories": [
      "math.DS",
      "math.CV"
    ],
    "authors": [
      "Vasiliki Evdoridou",
      "David Martí-Pete",
      "Lasse Rempe"
    ],
    "title": "Wandering dynamics of transcendental functions",
    "abstract": "We show that any uniformly escaping and wandering dynamics of a holomorphic function on a compact subset of the plane can be realised by a transcendental meromorphic function on $\\mathbb{C}$.\n  More precisely, let $\\varphi$ be a holomorphic function on an open subset of the complex plane, and suppose that $K$ is a compact set such that $\\varphi$ and all its iterates $\\varphi^n$ are defined on $K$, and $\\varphi^n(K)\\to\\infty$ as $n\\to\\infty$. We prove that there exist a transcendental meromorphic function $f\\colon\\mathbb{C}\\to\\widehat{\\mathbb{C}}$ and a compact set $\\widetilde{K}$ such that the dynamics of $f$ on the orbit of $\\widetilde{K}$ is conjugate, via a smooth change of coordinate close to the identity, to that of $\\varphi$ on the orbit of $K$. If $K$ does not separate the plane, the function $f$ may be chosen to be entire. If all iterates of $\\varphi$ are univalent on $K$, we can take $\\widetilde{K}=K$.\n  We also prove a similar theorem for oscillating dynamics. Finally, we use our results to answer a number of questions of Benini et al. concerning wandering domains of entire functions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09897v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Ryan Dickmann",
      "Zachary Himes",
      "Alexander Nolte",
      "Roberta Shapiro"
    ],
    "title": "Homotopy types of fine curve and fine arc complexes",
    "abstract": "The fine curve complex of a surface is a simplicial complex whose vertices are essential simple closed curves and whose $k$-simplices are collections of $k+1$ disjoint curves. We prove that the fine curve complex is homotopy equivalent to the curve complex. We also prove that the fine arc complex is contractible.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09863v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Logan Crew",
      "Xinyue Fan",
      "Hidde Koerts",
      "Benjamin Moore",
      "Sophie Spirkl"
    ],
    "title": "Characterizing Large Clique Number in Tournaments",
    "abstract": "Aboulker, Aubian, Charbit, and Lopes (2023) defined the clique number of a tournament to be the minimum clique number of one of its backedge graphs. Here we show that if $T$ is a tournament of sufficiently large clique number, then $T$ contains a subtournament of large clique number from one of two simple families of tournaments. In particular, large clique number is always certified by a bounded-size set. This answers a question of Aboulker, Aubian, Charbit, and Lopes (2023), and gives new insight into a line of research initiated by Kim and Kim (2018) into unavoidable subtournaments in tournaments with large dichromatic number.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09797v1",
    "categories": [
      "math.NT",
      "math.GR"
    ],
    "authors": [
      "Martin Jann",
      "Steffen Kionke"
    ],
    "title": "Primes represented by quadratic forms and the Weil abscissa of abelian profinite groups",
    "abstract": "Here we show that the Weil abscissa of the procyclic groups $\\prod_{p \\in S} \\mathbb{Z}_p$ equals $2$ for three sets $S$: (i) the set of primes $p \\equiv 1 \\bmod 3$, (ii) the set of primes $p \\equiv 1 \\bmod 4$ and (iii) the set of primes $p \\equiv 1,3 \\bmod 8$. Our argument is based on the observation that integers all of whose prime factors lie in $S$ can be represented by a suitable binary quadratic form, which allows us to use a theorem of Iwaniec to exhibit a minorant for the Weil representation zeta function.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09796v1",
    "categories": [
      "math-ph",
      "gr-qc",
      "math.AP"
    ],
    "authors": [
      "Dietrich Häfner",
      "Christiane K. M. Klein"
    ],
    "title": "The Unruh state for bosonic Teukolsky fields on subextreme Kerr spacetimes",
    "abstract": "We perform the quantization of Teukolsky scalars of spin $0$, $\\pm 1$, and $\\pm 2$ within the algebraic approach to quantum field theory. We first discuss the classical phase space, from which we subsequently construct the algebra. This sheds light on which fields are conjugates of each other. Further, we construct the Unruh state for this theory on Kerr and show that it is Hadamard on the black hole exterior and the interior up to the inner horizon. This shows not only that Hadamard states exist for this theory, but also extends the existence and Hadamard property of the Unruh state to (bosonic) Teukolsky fields on Kerr, where such a result was previously missing.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09791v1",
    "categories": [
      "math.DS",
      "cs.LG",
      "math.NA"
    ],
    "authors": [
      "Vladimir R. Kostic",
      "Karim Lounici",
      "Massimiliano Pontil"
    ],
    "title": "Toeplitz Based Spectral Methods for Data-driven Dynamical Systems",
    "abstract": "We introduce a Toeplitz-based framework for data-driven spectral estimation of linear evolution operators in dynamical systems. Focusing on transfer and Koopman operators from equilibrium trajectories without access to the underlying equations of motion, our method applies Toeplitz filters to the infinitesimal generator to extract eigenvalues, eigenfunctions, and spectral measures. Structural prior knowledge, such as self-adjointness or skew-symmetry, can be incorporated by design. The approach is statistically consistent and computationally efficient, leveraging both primal and dual algorithms commonly used in statistical learning. Numerical experiments on deterministic and chaotic systems demonstrate that the framework can recover spectral properties beyond the reach of standard data-driven methods.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09780v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Flavien Breuvart",
      "Quan Long",
      "Vladimir Zamdzhiev"
    ],
    "title": "On the Centre of Strong Graded Monads",
    "abstract": "We introduce the notion of 'centre' for pomonoid-graded strong monads which generalizes some previous work that describes the centre of (not graded) strong monads. We show that, whenever the centre exists, this determines a pomonoid-graded commutative submonad of the original one. We also discuss how this relates to duoidally-graded strong monads.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09751v1",
    "categories": [
      "math.CV",
      "math.GT"
    ],
    "authors": [
      "Kejie Lin",
      "Weixu Su"
    ],
    "title": "The Carathéodory metric on Teichmüller space of genus two surface",
    "abstract": "Let $\\Tei_{g,n}$ be the Teichmüller space of Riemann surfaces of genus $g$ with $n$ punctures. It is conjectured that the Teichmüller and Carathéodory metrics agree on a Teichmüller disk if and only if all the zeros of the corresponding holomorphic quadratic differential are of even order. The conjecture was proved by Gekhtman and Markovic for $\\Tei_{0,5}\\cong \\Tei_{1,2}$. We confirm the conjecture for $\\Tei_{2,0}\\cong\\Tei_{0,6}$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09749v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Zoltán Buczolich",
      "Balázs Maga"
    ],
    "title": "Exact formula on upper box dimension of generic Hölder level sets",
    "abstract": "In the previous decades, the size of level sets of functions have been extensively studied in various setups involving different regularity properties and size notions. In the case of Hölder functions, the authors have provided various bounds, but to date no explicit formulae have been found for any studied dimension and the results were valid only about very specific fractals. In this paper, for the first time, we have a result valid for a large class of self-similar sets, namely we prove that for these fractals Lebesgue almost every level set of the generic 1-Hölder-$α$ function defined on $F\\subseteq \\mathbb{R}^p$ has upper box dimension $\\dim_H F - α$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10055v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Mingao Yuan"
    ],
    "title": "The weak law of large numbers for the friendship paradox index",
    "abstract": "The friendship paradox index is a network summary statistic used to quantify the friendship paradox, which describes the tendency for an individual's friends to have more friends than the individual. In this paper, we utilize Markov's inequality to derive the weak law of large numbers for the friendship paradox index in a random geometric graph, a widely-used model for networks with spatial dependence and geometry. For uniform random geometric graph, where the nodes are uniformly distributed in a space, the friendship paradox index is asymptotically equal to $1/4$. On the contrary, in nonuniform random geometric graphs, the nonuniform node distribution leads to distinct limiting properties for the index. In the relatively sparse regime, the friendship paradox index is still asymptotically equal to $1/4$, the same as in the uniform case. In the intermediate sparse regime, however, the index converges in probability to $1/4$ plus a constant that is explicitly dependent on the node distribution. Finally, in the relatively dense case, the index diverges to infinity as the graph size increases. Our results highlight the sharp contrast between the uniform case and its nonuniform counterpart.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10005v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Félix Balado",
      "Guénolé C. M. Silvestre"
    ],
    "title": "Systematic Enumeration of Fundamental Quantities Involving Runs in Binary Strings",
    "abstract": "We give recurrences, generating functions and explicit exact expressions for the enumeration of fundamental quantities involving runs in binary strings. We first focus on enumerations concerning runs of ones, and we then analyse the same enumerations when runs of ones and runs of zeros are jointly considered. We give the connections between these two types of run enumeration, and with the problem of compositions. We also analyse the same enumerations with a Hamming weight constraint. We discuss which of the many number sequences that emerge from these problems are already known and listed in the OEIS. Additionally, we extend our main enumerative results to the probabilistic scenario in which binary strings are outcomes of independent and identically distributed Bernoulli variables.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09995v1",
    "categories": [
      "math.OA"
    ],
    "authors": [
      "David Gao",
      "Srivatsav Kunnawalkam Elayavalli"
    ],
    "title": "Non-isomorphism of reduced free group $C^\\ast$-algebras",
    "abstract": "Using a new approach involving embedding spaces in II$_1$ factors with plenty of freely independent Haar unitaries, we prove that $C^\\ast_r(\\mathbb{F}_n)\\ncong C^\\ast_r(\\mathbb{F}_m)$ for $n \\neq m$. This recovers the seminal result of Pimsner and Voiculescu with a short new proof.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09990v1",
    "categories": [
      "math.CA",
      "math.CV"
    ],
    "authors": [
      "Igor Chyzhykov"
    ],
    "title": "Wiman-Valiron method for fractional derivatives and sharp growth estimates of $α$-analytic solutions for linear fractional differential equations",
    "abstract": "We consider a fractional linear differential equation with successive derivatives given by $ \\mathbb{D}_α^{n}y+ p_{n-1}(x) \\mathbb{D}_α^{n-1}y+ \\dots +p_{1}(x)\\mathbb{D}_αy+p_0(x)y=0$, where $\\mathbb{D}_α^{j}$ is the $j$th iteration of the Caputo-Djrbashian fractional derivative of order $α>0$, $p_j$ are $α$-analytic functions for $0<x^α<R$. Generalizing a result of Kilbas, Rivero Rodríguez-Germá and Trujillo, we prove the existence and uniqueness of the corresponding Cauchy problem in the class of $α$-analytic functions. We establish an exact growth order for the solution when $p_j(x)=P_j(x^α)$, where $P_j$ are polynomials, and $p_0$ dominates in some sense. This is the full counterpart of the classical case of ordinary differential equations. In particular, we demonstrate the sharpness of Kochubei's result and generalize it. To achieve this, we extend the Wiman-Valiron theory to analytic functions and the Djrbashian-Gelfond-Leontiev generalized fractional derivatives.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09974v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Jiacheng Tang"
    ],
    "title": "Profinite Cosheaves Valued in Pro-regular Categories",
    "abstract": "We prove that the category of profinite cosheaves valued in a pro-regular category (satisfying mild assumptions) is itself a pro-regular category. As a corollary, we extend Wilkes's cosheaf-bundle equivalence from profinite modules to profinite groups.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09958v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Albert Chern",
      "Sadashige Ishida"
    ],
    "title": "L'Hopital rules for complex-valued functions in higher dimensions",
    "abstract": "In calculus, l'Hopital's rule provides a simple way to evaluate the limits of quotient functions when both the numerator and denominator vanish. But what happens when we move beyond real functions on a real interval? In this article, we study when the quotient of two complex-valued functions in higher dimension can be defined continuously at the points where both functions vanish. Surprisingly, the answer is far subtler than in the real-valued setting. We provide a complete characterization for the continuity of the quotient function. We also point out why extending this result to smoother quotients remains an intriguing challenge.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09951v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tobias Barker",
      "Henry Popkin"
    ],
    "title": "Quantitative estimates for the forced Navier-Stokes equations and applications",
    "abstract": "In this paper, we prove a localisation of a slightly supercritical (Orlicz) regularity criterion for the 3D incompressible Navier-Stokes equations. This is a refinement to the recent partial positive answer to Tao's conjecture [Tao21] as given in [BP21b]. The proof requires new quantitative estimates for critically bounded solutions of the forced Navier-Stokes equations, where the forcing is induced by the localisation. A by-product of these new estimates is an application to the Boussinesq equations, where we prove a quantitative blow-up rate for the critical $L^3$ norm of the velocity. We prove these quantitative estimates using Carleman inequalities as in [Tao21], and subsequently in [BP21a], with an additional forcing term. An obstacle to doing this is that, in the Carleman inequalities, the forcing term is amplified on large scales. Additionally, the low regularity of the forcing requires the addition of Caccioppoli-type estimates to deal with the Carleman inequalities appropriately.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09939v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Rachel Diethorn",
      "Sema Güntürkün",
      "Alexis Hardesty",
      "Pinar Mete",
      "Liana Şega",
      "Aleksandra Sobieska",
      "Oana Veliche"
    ],
    "title": "Homological properties of rings defined by $n+1$ general quadrics in $n$ variables",
    "abstract": "We study the almost complete intersection ring $R$ defined by $n+1$ general quadrics in a polynomial ring in $n$ variables over a field $\\sf{k}$ and a corresponding linked Gorenstein ring $A$. The overarching theme is that, while not Koszul (except for some small values of $n$), these rings have homological properties that extend those of Koszul rings. We establish that finitely generated modules over these rings have rational Poincaré series and we give concrete formulas for the Poincaré series of $\\sf{k}$ over both $A$ and $R$. We also show that $A$ has minimal rate and its Yoneda algebra $\\text{Ext}_A(\\sf{k},\\sf{k})$ is generated by its elements of degrees $1$ and $2$. While the graded Betti numbers of $R$ and $A$ over the polynomial ring are not known when $n$ is odd, our approach provides bounds and yields values for two of these Betti numbers, showing in particular that $R$ is level.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09922v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Alexander Kalinin"
    ],
    "title": "Stochastic Volterra equations with random functional coefficients in Banach spaces",
    "abstract": "We derive unique Banach-valued solutions to stochastic Volterra equations with random coefficients that may depend on pure chance and involve singular kernels. In particular, for controlled and distribution-dependent coefficients these solutions become strong, as a measurability analysis of the Wasserstein metric confirms. The presented novel approach is based on the proof that a stochastic Volterra integral admits a progressively measurable modification in a weak sense and on sharp moment estimates for non-negative product measurable processes.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09898v1",
    "categories": [
      "math.SG",
      "math.NT"
    ],
    "authors": [
      "Luis Crespo",
      "Álvaro Pelayo"
    ],
    "title": "$p$-adic symplectic geometry of integrable systems and Weierstrass-Williamson theory II",
    "abstract": "This paper is a sequel to arXiv:2501.14444, in which we shall give proofs of several results stated in arXiv:2501.14444 (Theorems D--L) which, for brevity and clarity, we postponed to this sequel paper. These results were the following: for any prime number $p$, first we show that every $2$-by-$2$ symmetric matrix with coefficients in $\\mathbb{Q}_p$ can be reduced to a canonical form, and we give the exact numbers of families of normal forms with one parameter and of isolated normal forms, which depend on $p$. Then we make the same analysis for $4$-by-$4$ matrices. We also prove that, for higher size, the number of families of normal forms of matrices, even in the non-degenerate case, grows almost exponentially with the size. The paper can be read independently of arXiv:2501.14444 as we recall the statements of arXiv:2501.14444 that we shall prove here. The statements and proofs of the present paper are of an algebraic and arithmetical nature, and rely mainly on Galois theory of $p$-adic extension fields.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09876v1",
    "categories": [
      "math.DG",
      "math.AP",
      "math.SP"
    ],
    "authors": [
      "Rodolphe Abou Assali"
    ],
    "title": "Geometric eigenvalue estimates of Kuttler-Sigillito type on differential forms",
    "abstract": "We introduce a new biharmonic Steklov problem on differential forms with Dirichlet-type boundary conditions and show that it is elliptic. We prove the existence of a discrete spectrum for this problem and give variational characterizations for eigenvalues associated to it. We establish eigenvalue estimates known as Kuttler-Sigillito inequalities, that connect the eigenvalues of different problems on differential forms with curvature quantities on the manifold.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09854v1",
    "categories": [
      "math.NA",
      "math.PR"
    ],
    "authors": [
      "Xinjie Dai",
      "Diancong Jin",
      "Jiaoyang Xu"
    ],
    "title": "Asymptotic error distribution for tamed Euler method with coupled monotonicity condition",
    "abstract": "This paper establishes the asymptotic error distribution of the tamed Euler method for stochastic differential equations (SDEs) with a coupled monotonicity condition, that is, the limit distribution of the corresponding normalized error process. Specifically, for SDEs driven by multiplicative noise, we first propose a tamed Euler method parameterized by $α\\in (0, 1]$ and establish that its strong convergence rate is $α\\wedge\\frac{1}{2}$. Notably, $α$ can take arbitrary positive values by adjusting the regularization coefficient without altering the strong convergence rate. We then derive the asymptotic error distribution for this tamed Euler method. Further, we infer from the limit equation that among the tamed Euler method of strong order $\\frac{1}{2}$, the one with $α= \\frac{1}{2}$ yields the largest mean-square error after a long time, while those of $α>\\frac{1}{2}$ share a unified asymptotic error distribution. In addition, our analysis is also extended to SDEs with additive noise and similar conclusions are obtained. Additional treatments are required to accommodate super-linearly growing coefficients, a feature that distinguishes our analysis on the asymptotic error distribution from established results.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09833v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Hancheng Bi",
      "Bernhard Schmitzer",
      "Thilo D. Stier"
    ],
    "title": "Density estimation from batched broken random samples",
    "abstract": "The broken random sample problem was first introduced by DeGroot, Feder, and Gole (1971, Ann. Math. Statist.): in each observation (batch), a random sample of $M$ i.i.d. point pairs $ ((X_i,Y_i))_{i=1}^M$ is drawn from a joint distribution with density $p(x,y)$, but we can observe only the unordered multisets $(X_i)_{i=1}^M$ and $(Y_i)_{i=1}^M$ separately; that is, the pairing information is lost. For large $M$, inferring $p$ from a single observation has been shown to be essentially impossible. In this paper, we propose a parametric method based on a pseudo-log-likelihood to estimate $p$ from $N$ i.i.d. broken sample batches, and we prove a fast convergence rate in $N$ for our estimator that is uniform in $M$, under mild assumptions.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09806v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ryo Kiyono"
    ],
    "title": "Convergence to pushed fronts and the behavior of level sets in monostable reaction-diffusion equations",
    "abstract": "We study the behavior of solutions of a monostable reaction-diffusion equation $u_t=Δ_x u +u_{yy} +f(u)$ ($x \\in \\mathbb{R}^{n-1}$, $y \\in \\mathbb{R}$, $t>0$), with the unstable equilibrium point $0$ and the stable equilibrium point $1$. Under the condition that the corresponding one-dimensional equation has a pushed front $Φ_{c^*}(z)$ with $Φ_{c^*}(-\\infty)=1$, $Φ_{c^*}(\\infty)=0$, we show that the solution $u(x,y,t)$ approaches $Φ_{c^*}(y-γ(x,t))$ for some $γ(x,t)$ as $t \\to \\infty$, if initially $u(x,y,0)$ decays sufficiently fast as $y \\to \\infty$ and is bounded below by some positive constant near $y=-\\infty$. It is also shown that $γ(x,t)$ is approximated by the mean curvature flow with a drift term.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09786v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Bogdan-Vasile Matioc",
      "Georg Prokert"
    ],
    "title": "The $N$-dimensional gravity driven Muskat problem",
    "abstract": "We study the Muskat problem, which describes the motion of two immiscible, incompressible fluids in a homogeneous porous medium occupying the full space ${\\mathbb{R}^{N+1}}$, $N \\geq 2$, driven by gravity. The interface between the fluids is given as graph of a function over $\\mathbb{R}^N$. The problem is reformulated as a nonlinear, nonlocal evolution problem for this function, involving singular integrals arising from potential representations of the velocity and pressure fields. Using results from harmonic analysis, we demonstrate that the evolution is of parabolic type in the open set identified by the Rayleigh-Taylor condition. We use the abstract theory of such problems to establish that the Muskat problem defines a semiflow on this set in all subcritical Sobolev spaces $H^s(\\mathbb{R}^N)$, $s>s_c$, where ${s_c=1+N/2}$ is the critical exponent. We additionally obtain parabolic smoothing up to ${\\rm C}^\\infty$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10047v1",
    "categories": [
      "math.AG",
      "math.CV",
      "math.DG",
      "math.DS"
    ],
    "authors": [
      "Maurício Corrêa",
      "Gilcione Nonato Costa",
      "Alejandra Salamanca Russi"
    ],
    "title": "A lower bound for the Milnor number of vector fields",
    "abstract": "We study holomorphic vector fields whose singular locus contains a local complete intersection smooth positive-dimensional component. We prove global and local formulas expressing the limiting Milnor/Poincare-Hopf contribution along such a component in terms of its embedded scheme structure, and we obtain sharp lower bounds for this contribution under holomorphic perturbations. We provide explicit families show optimality and illustrate how singularities may redistribute between a fixed neighborhood of the component and the part at infinity in projective compactifications.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10028v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Atif Ahmad Khan",
      "Shakir Ali",
      "Bhupendra Singh"
    ],
    "title": "On the generalization of $g$-circulant MDS matrices",
    "abstract": "A matrix $M$ over the finite field $ \\mathbb{F}_q $ is called \\emph{maximum distance separable} (MDS) if all of its square submatrices are non-singular. These MDS matrices are very important in cryptography and coding theory because they provide strong data protection and help spread information efficiently. In this paper, we introduce a new type of matrix called a \\emph{consta-$g$-circulant matrix}, which extends the idea of $g$-circulant matrices. These matrices come from a linear transformation defined by the polynomial\n  $\n  h(x) = x^m - λ+ \\sum_{i=0}^{m-1} h_i x^i\n  $\n  over $ \\mathbb{F}_q $. We find the upper bound of such matrices exist and give conditions to check when they are invertible. This helps us know when they are MDS matrices. If the polynomial $ x^m - λ$ factors as\n  $\n  x^m - λ= \\prod_{i=1}^{t} f_i(x)^{e_i},\n  $\n  where each \\( f_i(x) \\) is irreducible, then the number of invertible consta-$g$-circulant matrices is\n  $\n  N \\cdot \\prod_{i=1}^{t} \\left( q^{°f_i} - 1 \\right),\n  $\n  where $r$ is the multiplicative order of $λ$, and \\( N \\) is the number of integers \\( k \\) such that\n  $\n  0 \\leq k < \\left\\lfloor \\frac{m - 1}{r} \\right\\rfloor + 1 \\quad \\text{and} \\quad \\gcd(1 + rk, m) = 1.\n  $\n  This formula help us to reduce the number of cases to check whether such matrices is MDS. Moreover, we give complete characterization of $g$-circulant MDS matrices of order 3 and 4. Additionally, inspired by skew polynomial rings, we construct a new variant of $g$-circulant matrix. In the last, we provide some examples related to our findings.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.10000v1",
    "categories": [
      "math.CT"
    ],
    "authors": [
      "Seerp Roald Koudenburg"
    ],
    "title": "Virtual double categories of split two-sided 2-fibrations",
    "abstract": "This paper introduces and studies split two-sided 2-fibrations and locally discrete split two-sided 2-fibrations, using a formal categorical approach. We generalise Street's notion of split two-sided fibration internal to a 2-category to one internal to a sesquicategory. Given a sesquicategory we construct a virtual double category whose horizontal (loose) morphisms are its internal split two-sided fibrations. Specialising to the sesquicategory of lax natural transformations we obtain the virtual double category of split two-sided 2-fibrations, which we study in detail. We then restrict to the sub-virtual double category of locally discrete split two-sided 2-fibrations and show that therein the usual Yoneda 2-functors satisfy a double-categorical formal notion of Yoneda morphism, which formally captures universal properties similar to those satisfied by the morphisms comprising a Yoneda structure on a 2-category. As a consequence we obtain a 'two-sided Grothendieck correspondence' of locally discrete split two-sided 2-fibrations $A \\nrightarrow B$ and 2-functors $B \\to Cat^{A^{op}}$. Restricting to $A = 1$, the terminal 2-category, we improve Buckley and Lambert's 'Grothendieck correspondence' for locally discrete split op-2-fibrations by extending the sense in which it is functorial.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09998v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Szymon Cygan",
      "Anna Marciniak-Czochra",
      "Finn Münnich",
      "Dietmar Oelz"
    ],
    "title": "Stability and bifurcation analysis in a mechanochemical model of pattern formation",
    "abstract": "We analyze the stability and bifurcation structure of steady states in a mechanochemical model of pattern formation in regenerating tissue spheroids. The model couples morphogen dynamics with tissue mechanics via a positive feedback loop: mechanical stretching enhances morphogen production, while morphogen concentration modulates tissue elasticity. Global strain conservation implements a nonlocal inhibitory effect, realizing a mechanochemical variant of the local activation--long-range inhibition mechanism. For exponential elasticity-morphogen coupling, the system admits a variational formulation. We prove existence of nonconstant steady states for small diffusion and uniqueness of the homogeneous state for large diffusion. Linear stability analysis shows that only unimodal patterns are stable, while multimodal solutions are unstable. Bifurcation analysis reveals subcritical and supercritical pitchforks, with fold bifurcations generating bistable regimes. Our results demonstrate that mechanochemical feedback provides a robust mechanism for single-peaked pattern formation without requiring a second diffusible inhibitor.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09976v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Pedro Macias Marques",
      "Chris McDaniel",
      "Alexandra Seceleanu"
    ],
    "title": "Corrigendum to \"Higher Lorentzian polynomials,...in codimension two\" [International Mathematics Research Notices, Volume 2025, Issue 13, July 2025, arXiv:2208.05653]",
    "abstract": "A homogeneous bivariate $d$-form defines an $(i+1)$-rowed Toeplitz matrix for each $i$ between $0$ and $d$. We use Hodge theory and Schur polynomials to prove that if the $(i+1)$-rowed Toeplitz matrix of a form is totally nonnegative, then so is the $i$-rowed one. This fixes a gap in the main result of paper above.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09948v1",
    "categories": [
      "math.CO",
      "cs.DM",
      "cs.DS"
    ],
    "authors": [
      "T. R. Avila",
      "Lars Rohwedder",
      "Leo Wennmann"
    ],
    "title": "Non-Additive Discrepancy: Coverage Functions in a Beck-Fiala Setting",
    "abstract": "Recent concurrent work by Dupré la Tour and Fujii and by Hollender, Manurangsi, Meka, and Suksompong [ITCS'26] introduced a generalization of classical discrepancy theory to non-additive functions, motivated by applications in fair division. As many classical techniques from discrepancy theory seem to fail in this setting, including linear algebraic methods like the Beck-Fiala Theorem [Discrete Appl. Math '81], it remains widely open whether comparable non-additive bounds can be achieved.\n  Towards a better understanding of non-additive discrepancy, we study coverage functions in a sparse setting comparable to the classical Beck-Fiala Theorem. Our setting generalizes the additive Beck-Fiala setting, rank functions of partition matroids, and edge coverage in graphs. More precisely, assuming each of the $n$ items covers only $t$ elements across all functions, we prove a constructive discrepancy bound that is polynomial in $t$, the number of colors $k$, and $\\log n$.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09946v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Félix del Teso",
      "Julio D. Rossi",
      "Jorge Ruiz-Cases"
    ],
    "title": "A Viscosity Framework for Dynamic Programming Principles and Applications",
    "abstract": "In this work we introduce a viscosity-based notion of solution for general approximation schemes associated with partial differential equations, such as dynamic programming principles~(DPPs). A key feature of our approach is that it bypasses any measurability requirement on solutions of the DPP, an assumption that is often difficult to verify and may even fail in relevant examples. We establish a comparison principle between classical strict supersolutions and viscosity subsolutions of the DPP, which yields stability results under minimal and natural hypotheses. As a consequence, we prove existence of viscosity solutions of the DPP and their convergence to viscosity solutions of a PDE that is consistent with the underlying approximation scheme. Moreover, we show that solutions of the limiting PDE admit an asymptotic expansion encoded by the approximation operator. Finally, we demonstrate that a broad class of local, nonlocal, and nonlinear partial differential equations fits into our framework, recovering known examples in the literature and completing gaps in the existing literature.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09923v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Marc Lackenby"
    ],
    "title": "A polynomial upper bound on Reidemeister moves for each link type",
    "abstract": "For each link type $K$ in the 3-sphere, we show that there is a polynomial $p_K$ such that any two diagrams of $K$ with $c_1$ and $c_2$ crossings differ by at most $p_K(c_1) + p_K(c_2)$ Reidemeister moves. As a consequence, the problem of recognising whether a given link diagram represents $K$ is in the complexity class NP and hence can be completed deterministically in exponential time. We calculate this polynomial $p_K$ explicitly for various classes of links.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09915v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Florian Naef",
      "Thomas Willwacher"
    ],
    "title": "The Johnson homomorphism, embedding calculus and graph complexes",
    "abstract": "We explain how the Johnson homomorphism and the Enomoto-Satoh trace, as well as higher-loop-order generalizations, can be obtained from graph complexes originating in the Goodwillie-Weiss calculus. This paper can be seen as an addendum to our earlier work. It contains little new mathematical content, but is intended to give an overview of a different viewpoint on the Johnson homomorphism, for experts working mainly in the latter area.",
    "date": "02-11"
  },
  {
    "link": "https://arxiv.org/pdf/2602.09906v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Simone Ciani",
      "Eurica Henriques",
      "Mariia Savchenko",
      "Igor I. Skrypnik",
      "Yevgeniia Yevgenieva"
    ],
    "title": "Regularity for Doubly Nonlinear Equations in the Mixed Regime",
    "abstract": "We study the local Hölder continuity of nonnegative solutions to doubly nonlinear equations by introducing a new technique that allows us to treat the cases where the equation is both singular and degenerate, up to specific Barenblatt numbers. Our argument relies on a new integral $L^1$-$L^1$ Harnack estimate, of independent interest.",
    "date": "02-11"
  }
]