[
  {
    "link": "https://arxiv.org/pdf/2602.21275v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Moe Putterman",
      "Mehtaab Sawhney",
      "Gregory Valiant"
    ],
    "title": "On infinite sets with no $3$ on a line",
    "abstract": "We give a construction of an infinite set of points $A$ in $\\mathbb{R}^2$ such that any subset $P\\subseteq A$ has a constant density subset $P'$ with no three points collinear and yet $A$ cannot be separated into finitely many subsets such that each subset has no three points collinear. This provides a new proof of a question of Erdős, Nešetřil, and Rödl. The construction was generated by an internal model at OpenAI.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21245v1",
    "categories": [
      "math-ph",
      "physics.comp-ph"
    ],
    "authors": [
      "Jae Wan Shim"
    ],
    "title": "Conductive Heat Flux Driven by a Pressure Gradient in Non-Maxwellian Reference States",
    "abstract": "Standard Navier--Stokes--Fourier theory and Maxwellian-based Grad 13-moment closures yield no independent pressure-gradient driving of the conductive heat flux in an isothermal, single-component gas in the hydrodynamic (small-Knudsen) regime. This absence is specific to the Maxwellian local-equilibrium weight. We show that when the closure is constructed about a generalized class of isotropic non-Maxwellian reference weights with finite fourth moment -- characterized by a single shape parameter (a kurtosis-like moment ratio) that deforms the distribution continuously away from a Maxwellian -- the small-Knudsen constitutive reduction retains a bulk pressure-gradient (barothermal) contribution to the conductive heat flux. This mechanism predicts pressure-driven conduction as a direct kinetic signature of non-Maxwellian equilibrium moment structure.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21209v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Ahmed Zahari Abdou Damdji"
    ],
    "title": "Classification and (Quasi)-Centroids of Four-Dimensional Ternary Leibniz Algebras",
    "abstract": "We provide a classification, up to isomorphism, of four-dimensional ternary Leibniz algebras over an algebraically closed field of characteristic zero. For each non-abelian algebra in the classification, we explicitly determine its centroid and quasi-centroid and compute their dimensions. These results offer a comprehensive description of the internal symmetries of low-dimensional ternary Leibniz algebras and extend several classical results from the binary Leibniz setting to the ternary case.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21537v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Hongjun Guo"
    ],
    "title": "Spreading dynamics for the Lotka-Volterra system with general initial supports: the strong competition",
    "abstract": "This paper studies the spreading dynamics of a high-dimensional strong competition Lotka-Volterra system where two species initially occupy disjoint measurable (possibly unbounded) subsets in $\\mathbb{R}^N$, which are called initial support. Recently, Hamel and Rossi [14] introduced some new geometric notions, such as bounded or unbounded directions and positive-distance interior, for single-species equations with general initial supports. Under these notions and appropriate assumptions, we characterize directional spreading behavior for the two-species system: precise spreading speeds and sets for both species are derived.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21526v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Hussein Houdrouge",
      "Bobby Miraftab",
      "Pat Morin"
    ],
    "title": "2-dimensional unit vector flows",
    "abstract": "We study $2$-dimensional unit vector flows on graphs, that is, nowhere-zero flows that assign to each oriented edge a unit vector in $\\mathbb R^{3}$. We give a new geometric characterization of $\\mathbb S^{2}$-flows on cubic graphs. We also prove that the class of cubic graphs admitting an $\\mathbb S^{2}$-flow is closed under a natural composition operation, which yields further constructions; in particular, blowing up a vertex into a triangle preserves the existence of an $\\mathbb S^{2}$-flow. Our second contribution is algebraic: we extend the rank-based approach of [SIAM J. Discrete Math., 29 (2015), pp.~2166--2178] from $\\mathbb S^{1}$-flows to $\\mathbb S^{2}$-flows. More precisely, we show that if an $\\mathbb S^{2}$-flow $\\varphi$ satisfies $\\operatorname{rank}(S_{\\mathbb{Q}}(\\varphi))\\le 2$ and $S_{\\mathbb{Q}}(\\varphi)$ is odd-coordinate-free, then the graph admits a nowhere-zero $4$-flow.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21487v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Partha Sarkar",
      "Kshitij Khare",
      "Sanvesh Srivastava"
    ],
    "title": "Moment bounds for condition numbers and singular values of high-dimensional Gaussian random matrices: Applications and limitations",
    "abstract": "Spectral properties of Gram matrices are central to high dimensional asymptotic analyses of statistical estimators in regression and covariance estimation. These properties, in turn, depend critically on the extreme singular values and condition numbers of Gaussian random matrices. For many applications, sharp positive and negative moment bounds for these quantities are required to control expected prediction risk and related performance metrics. Although extensive work provides concentration and tail bounds for extreme singular values of Gaussian random matrices, these results do not readily yield the moment bounds needed in such analyses. Motivated by this gap, we establish non asymptotic moment bounds for arbitrary positive moments of the largest singular value and arbitrary negative moments of the smallest singular value, and uniform bounds for arbitrary positive moments of the condition number of high dimensional Gaussian random matrices. We demonstrate the utility of these bounds by applying them to derive explicit risk guarantees in high dimensional regression and covariance estimation, as well as to obtain bounds on the mean iteration complexity of gradient descent for solving Gram linear systems. Finally, we present counterexamples demonstrating that the positive condition number moment bounds and negative smallest singular value moment bounds cannot, in general, be extended to the broader class of sub Gaussian random matrices.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21427v1",
    "categories": [
      "math.CO",
      "math.AT"
    ],
    "authors": [
      "Andrés Carnero Bravo"
    ],
    "title": "Total cut complexes and their duals",
    "abstract": "We study the total cut complexes and their Alexander duals. The homotopy type of these complexes is calculated for de $p$th power of a cycle with at least $2rn$ vertices where $p\\leq r$, solving part of a conjecture of Bayer, Denker, Milutinović, Rowlands, Sundaram and Xue. The homotopy type of the $2$-total cut complex for any $r$th power of a cycle with $r\\geq3$ also is calculated, solving a conjecture of Chauhan, Shukla and Vinayak. We give some results about the connectivity. The homotopy type of the complexes for complete multipartite graph is determined. We also study the complexes of cartesian products of paths and of cartesian products of complete graphs for the total $2$-cut complex.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21414v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Henri Berestycki",
      "William F. Fagan",
      "Alex Safsten"
    ],
    "title": "The Influence of Exclusion Zones on the Coexistence of Predator and Prey with an Allee Effect",
    "abstract": "We propose a reaction--diffusion model of predator--prey interaction in which the predators occupy only a subset of the prey's territory, leaving a predator-free exclusion zone. Ecological examples include marine protected areas where it is illegal to fish, or buffer zones left between the territories of rival predators. The prey are subject to a strong Allee effect, so excessive predation may lead to the extinction of both species. The exclusion zone mitigates this problem by providing the prey with a refuge in which to proliferate without predation. Thus, paradoxically, a smaller predator territory may be able to support a more substantial population than a larger one. Using a topological degree argument, we show in any dimensions that, provided the exclusion zone is large enough, the system possesses spatially heterogeneous coexistence equilibria with positive populations of both species. This result is global in the sense that it does not rely on local bifurcations from semi-trivial stationary states. We also show that as the predator domain becomes asymptotically small, the total predator population does not vanish, and in some cases may actually be maximized in this limit of shrinking predation area. Conversely, we show that as the predator domain becomes large, it may exhibit thresholding behavior, passing suddenly from a regime with coexistence solutions to one in which extinction becomes unavoidable, highlighting the need for careful analysis in the management of predator--prey systems.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21382v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Miriam Abdón",
      "Lucas Portugal",
      "Renata Del-Vecchio",
      "Renata de Freitas"
    ],
    "title": "On the spectra of k-uniform threshold hypergraphs",
    "abstract": "In this article we introduce a definition of k-uniform thresholds hypergraphs through a binary sequence, a natural extension of the classical definition for thresholds graphs. We characterize some of its eigenvalues and multiplicities by means of combinatorial numbers, derived from edge counts. An important problem addressed in Spectral Graph Theory is to find graphs with few distinct eigenvalues. Our characterization allows us to construct k-uniform threshold hypergraphs having an arbitrary number of vertices with few distinct eigenvalues.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21330v1",
    "categories": [
      "math.CT",
      "math.AT"
    ],
    "authors": [
      "Peter J. Haine"
    ],
    "title": "Classifying anima of condensed $\\infty$-categories of points",
    "abstract": "We compare the classifying anima of two natural condensed $\\infty$-categories associated to a coherent $\\infty$-topos. One from our work with Barwick and Glasman on exit-path categories in algebraic geometry, and the other from Lurie's work on ultracategories. The key consequence of our comparison is a connection between algebraic geometry and model theory: up to a mild completion, the proétale fundamental group of a scheme and the Lascar group of a complete first-order theory are both special cases of the same construction.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21318v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Duaa Abdullah"
    ],
    "title": "Theta-Relations Among Degree-Based Tree Indices",
    "abstract": "Degree-based topological indices enable structural analysis of graphs, with key applications in chemical graph theory. This paper explores connections among three tree indices: Albertson, Sombor, and Sigma. The Sigma index tightly bounds the Sombor index via sharp two-sided inequalities, revealing their asymptotic equivalence up to constants. A pure $Θ$-relationship links Sombor and Albertson indices for extremal trees with fixed degree sequences, showing quadratic degree interactions scale with absolute degree disparities. These results position the Sombor index as an intermediate descriptor, bridging global degree dispersion and local edge irregularity in trees.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21304v1",
    "categories": [
      "math.AG",
      "math.AT",
      "math.CV",
      "math.SG"
    ],
    "authors": [
      "Mauricio Corrêa"
    ],
    "title": "A Čech--Stokes Pushout Groupoid: a Log/Kummer Betti Presenter for Stokes Torsors",
    "abstract": "Let $X$ be a complex manifold and let $D\\subset X$ be a simple normal crossings divisor. Fix a Kummer level $n\\ge 1$ and an irregular type $Φ$ along $D$, and consider the logarithmic Betti boundary $X^{\\log}_n$ (the level-$n$ Kato--Nakayama space). We construct a strictly $1$-categorical, cover-based Betti presenter for Stokes torsors by building a small strict Čech--Stokes collar groupoid on a punctured logarithmic collar of $D$, together with a canonical projection $π$ to the underlying sector Čech groupoid. The central observation is that the appropriate collar Stokes moduli is the groupoid of strict functorial sections $\\operatorname{Sec}(π)$ (equivalently, $\\mathrm{St}_Φ$-torsors on the sector cover), yielding a fully explicit presenter that remains small and strictly functorial. We then glue the collar presenter to the ordinary Čech presenter of $U:=X\\setminus D$ through a strict diagram of small groupoids and an explicit $2$-pushout presenter $G_{Φ,n}$. We prove that global Stokes objects, defined intrinsically as a $2$-fiber product, are computed by a strict torsorial gluing problem, i.e.\\ by Stokes-corrected torsorial representations of $G_{Φ,n}$. In arbitrary SNC depth we solve the local corner presentation problem by an explicit chamber-complex model on the angular torus: Stokes torsors are nonabelian cocycles on the $1$-skeleton with relations read off from $2$-cells. The overall construction is canonical up to Morita equivalence with a contractible space of identifications (invariant under stratified subdivision), and it is compatible with Kummer descent along all normal crossings strata via $(μ_n)^k$-equivariant local models and descent to homotopy fixed points.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21785v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Ildefonso Castro",
      "Daniel López-López"
    ],
    "title": "Quadric surfaces of revolution in the 3-sphere as Weingarten surfaces",
    "abstract": "The study of quadric surfaces of revolution is a cornerstone of classical Euclidean geometry, but its extension to the three-dimensional sphere $\\mathbb{S}^3$ has not been sufficiently explored. This article addresses this important gap by providing a rigorous classification and characterization of non-degenerate quadric surfaces of revolution in $\\mathbb{S}^3$, namely spherical ellipsoids, hyperboloids and paraboloids, generated by the rotation of spherical conics around a geodesic axis containing their foci or is orthogonal to them.\n  Using the concept of spherical angular momentum as a prominent geometric invariant, we discover that these surfaces constitute a remarkable class of Weingarten surfaces and prove that they are uniquely characterised by a specific cubic functional relation between their principal curvatures. This result not only provides a unified description of spherical quadric surfaces of revolution, but also highlights a profound geometric universality, reflecting exactly the same cubic Weingarten relations observed in their Euclidean and Lorentzian counterparts.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21719v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jouni J. Takalo"
    ],
    "title": "Prime-Weighted Interference Patterns Inspired by the Euler Product",
    "abstract": "We study a prime-weighted oscillatory model inspired by structural aspects of the Euler product of the Riemann zeta function. The model defines finite superpositions of prime-frequency modes and exhibits zero-like crossings produced by destructive interference. We analyze how the weight exponent $x$ controls amplitude growth, slope scaling, and stability of crossings. A heuristic asymptotic argument identifies $x=\\tfrac12$ as a distinguished balance regime separating high-energy and over-damped behavior. The results concern the defined model itself.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21659v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Makoto Ozawa"
    ],
    "title": "Crossing Numbers of Knots on Closed Surfaces",
    "abstract": "Let $c(K;F)$ denote the surface crossing number of a knot $K$ with respect to a closed surface $F \\subset S^{3}$. We establish the lower bound \\[ c(K;F) \\ge 2\\bigl(t(K)-δ(F)\\bigr)+1, \\] where $t(K)$ is the tunnel number of $K$ and $δ(F)$ is the Heegaard deficiency of $F$. In particular, for any fixed closed surface $F$, the surface crossing number $c(K;F)$ is unbounded over all knots $K$. Furthermore, we construct a family of knots $K_m$ demonstrating that $c(K_m;F) = Θ(t(K_m))$, which shows that this lower bound is asymptotically sharp.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21640v1",
    "categories": [
      "math-ph",
      "cond-mat.quant-gas"
    ],
    "authors": [
      "Thomas Gamet"
    ],
    "title": "Semi-classical limit of an attractive Fermi gas in one or two dimensions",
    "abstract": "We study the ground-state of a Fermi gas with short range attrative interactions in one or two dimensions. N fermions are placed in a confining potential, and interact with each other through a negative potential, whose range is larger than the typical distance between particles. We show the convergence of the ground state energy of the Hamiltonian to a Thomas-Fermi energy in the large N limit. Furthermore, we prove convergence of the ground states, in the sense of their Husimi functions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21605v1",
    "categories": [
      "math.AC",
      "math.NT"
    ],
    "authors": [
      "Kazuki Hayashi",
      "Shinnosuke Ishiro",
      "Kazuma Shimomoto"
    ],
    "title": "An application of Fontaine's monoidal maps to perfectoid towers",
    "abstract": "To connect arithmetic and ring-theoretic properties of rings of mixed characteristic with those of positive characteristic, we introduce monoidal maps for perfectoid towers. Using these maps, we discuss the almost integrality of perfectoid towers and of their tilts. We also show that the towers constructed by F. Andreatta via ramification theory become perfectoid towers, and we apply the monoidal maps to deduce the normality of their small tilts.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21578v1",
    "categories": [
      "math.CO",
      "math.RT"
    ],
    "authors": [
      "Benjamin Homan"
    ],
    "title": "Equivariant log concavity and the $\\operatorname{FI^\\sharp}$-module structure on $H^i(\\operatorname{Conf}(n,\\mathbb{R}^d))$",
    "abstract": "Previous work has conjectured that the graded $\\mathfrak{S}_n$-representations $H^\\bullet(\\operatorname{Conf}(n,\\mathbb{R}^d);\\mathbb{Q})$ are strongly equivariantly log concave, and has proven this conjecture in low degrees. By leveraging the theory of representation stability, we are able instead prove a stronger statement about the $\\operatorname{FI^\\sharp}$-module structure on $H^i(\\operatorname{Conf}(n,\\mathbb{R}^d);\\mathbb{Q})$ which implies the original conjecture up to degree 19. We conjecture that this equivariant log concavity-like property holds in all degrees for the $\\operatorname{FI^\\sharp}$-modules $H^i(\\operatorname{Conf}(n,\\mathbb{R}^d);\\mathbb{Q})$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21805v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Wen-Wei Li"
    ],
    "title": "Harish-Chandra D-modules for bi-Whittaker reduction",
    "abstract": "Let $D(G)$ be the algebra of algebraic differential operators on a complex reductive group $G$. Denote by $\\mathbb{W}$ the bi-Whittaker quantum Hamiltonian reduction of $D(G)$, also known as the quantum Toda lattice. In this article we define the admissible $\\mathbb{W}$-modules and the special case of Harish-Chandra modules, the latter being bi-Whittaker variants of the invariant holonomic systems of Hotta-Kashiwara. We then study their torsion properties up to completion relative to the Kazhdan filtration, which in general is unbounded in both directions, through the geometry of universal centralizer. In the case of regular infinitesimal characters, the corresponding $D(G)$-module is shown to be the minimal extension of an irregular connection on the open Bruhat cell. Certain ring-theoretic properties of the completion of $\\mathbb{W}$ are also obtained.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21274v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Johanna Garzón",
      "Jhonatan S. Mora Rodríguez",
      "Harold A. Moreno-Franco"
    ],
    "title": "Optimal extraction with an impact on diffusion-jump pricing",
    "abstract": "We study an optimal extraction problem where the agent's actions in the spot market exert an additive proportional negative impact on the commodity price. The commodity price dynamics, prior to any activity by the agent, are evolved by a drifted Brownian motion with jumps. The agent's primary aim is to identify an optimal extraction strategy that maximizes their expected net profits.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21260v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Halim Baş",
      "Murat Kirişci"
    ],
    "title": "Fermatean fuzzy type entropy-based new integrated decision making method with analysis of energy poverty in Türkiye application",
    "abstract": "Income-based poverty indicators are insufficient to fully explain the multifaceted socio-economic issue of energy poverty. The ability of households to obtain and use energy services sustainably is significantly influenced by structural factors like building efficiency, energy prices, climate, and regional disparities. Moreover, the assessment of energy poverty inherently involves uncertainty, vagueness, and subjective judgments, which limit the applicability of classical deterministic evaluation approaches. This paper proposes a novel, integrated MCDM framework based on FFSs to address these issues. To objectively assess the uncertainty present in FF-information, a novel FF-entropy metric is first presented. The proposed entropy employs a nonlinear structure, enabling a more flexible and sensitive representation of fuzziness in complex decision environments. The subjective weights obtained from the FF-PIPRECIA approach are then blended with the entropy-based objective weights. Lastly, options are ranked according to their relative usefulness in relation to ideal and anti-ideal solutions using the FF-MARCOS approach. The proposed framework is applied to the regional evaluation of energy poverty in Turkiye, considering seven geographical regions and six key criteria: income level, energy prices, energy efficiency, building efficiency, climate, and urbanization. Sensitivity analysis, weight perturbation analysis, and entropy-criterion dominance analysis validate the robustness and stability of the suggested model across various parameter settings. For policymakers and practitioners seeking to develop focused, effective, and socially just energy policies amid uncertainty, the proposed method provides a robust, adaptable decision-support tool.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21235v1",
    "categories": [
      "math.DG",
      "math.AT"
    ],
    "authors": [
      "Masaki Taho"
    ],
    "title": "Diffeological Spaces with a Non-Smooth Derivation",
    "abstract": "We show that on certain diffeological spaces there exist linear derivations that satisfy the Leibniz rule but are not smooth with respect to the given diffeology. This reveals that the notion of tangent space defined via all such derivations is strictly larger than the one defined using only smooth derivations, showing that smoothness cannot be recovered from the Leibniz rule alone.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21234v1",
    "categories": [
      "math.SP",
      "math.CA"
    ],
    "authors": [
      "Yorick Hardy",
      "Bertin Zinsou"
    ],
    "title": "Canonical forms for boundary conditions of self-adjoint odd-order differential operators",
    "abstract": "It is useful to have canonical forms of boundary conditions in the study of the eigenvalues of boundary value problems and associated numerical applications. In [J. Appl. Anal. Comput., 2024, 14(4), {1854--1868}], a canonical form is given for self-adjoint differential operators of even order, with eigenvalue parameter dependent boundary conditions. In this article, we derive canonical forms for the remaining case, namely: for self-adjoint $(2n+1)$-th order differential operators with eigenvalue parameter dependent boundary conditions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21791v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Mingyuan Ma",
      "Han Ren"
    ],
    "title": "The average order of a connected vertex set in $K_m \\times P_n$",
    "abstract": "Let $G$ be a connected graph. Let $N(G)$ and $S(G)$ be the number of connected sets of $G$ and the sum of the orders of these connected sets of $G$, respectively. Then $A(G)=\\frac{S(G)}{N(G)}$ is called the average order of a connected set of $G$. In this paper, we derive a closed-form formula for $A(K_m \\times P_n)$, where $K_m \\times P_n$ is the Cartesian product of the complete graph $K_m$ and the path $P_n$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21690v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Takao Inoué"
    ],
    "title": "Chirality and Racemization on Isotopy Classes of Loops: A Groupoid-Based Structural Theory",
    "abstract": "We develop a theory of chirality and racemization on isotopy classes of finite loops, formulated intrinsically within the loop isotopy groupoid understood in the categorical sense. Motivated by earlier work on quasigroups \\cite{InoueQuasiChirality} and by the classical medical paradigm of mirror-related enantiomers, we restrict admissible mirror transitions to those generated by intrinsic, unit-preserving symmetries. Within this framework, racemization is modeled as a two-state dynamics on isotopy classes, with an effective rate determined by the presence of mirror-isotopisms. Our main result shows that this rate vanishes if and only if no loop isotopism exists between a loop and its opposite, providing a structural criterion for chirality. A strengthened variant based on translation-generated symmetries is discussed in the appendix.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21660v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ali Zeydi Abdian",
      "Saeid Alikhani",
      "Mahsa Zare"
    ],
    "title": "On the Number of Connected Edge Cover Sets of Some Graph Families",
    "abstract": "Let $G=(V,E)$ be a simple connected graph. A connected edge cover of $G$ is a subset $S\\subseteq E$ such that every vertex of $G$ is incident with at least one edge in $S$ and the subgraph induced by $S$ is connected. The connected edge cover polynomial of $G$ is defined as $E_c(G,x)=\\sum_{i} e_c(G,i)x^i$, where $e_c(G,i)$ denotes the number of connected edge covers of $G$ with exactly $i$ edges. In this paper, we derive explicit formulas for both the connected edge cover polynomials and the total number of connected edge covers for several important graph families, including wheels, complete graphs $K_n$, complete bipartite graphs $K_{2,n}$, friendship graphs, and lollipop graphs. Each formula is accompanied by a combinatorial proof and verified by computational enumeration for small orders.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21616v1",
    "categories": [
      "math.CA",
      "math.FA"
    ],
    "authors": [
      "Pu-Ting Yu"
    ],
    "title": "Every semi-normalized unconditional Schauder frame in Hilbert spaces contains a frame",
    "abstract": "Let $H$ be an infinite-dimensional Hilbert space.\n  We prove that every unconditional Schauder frame for $H$ contains a subsequence that can be normalized to form a frame for $H$. As a consequence, every semi-normalized unconditional Schauder frame contains a frame for $H.$ Here we say that a sequence $\\{x_n\\}_{n\\in \\mathbb{N}}$ in a Hilbert space $H$ is an \\emph{unconditional Schauder frame} for $H$ if there exists some sequence $\\{y_n\\}_{n\\in \\mathbb{R}}subseteq H$ such that\n  $$x=\\sum_{n=1}^\\infty \\langle x,y_n\\rangle x_n\\quad \\text{for all }x\\in H,$$\n  with the unconditional convergence of the series in the norm of $H.$ We say that $\\{x_n\\}_{n\\in\\mathbb{N}}$ is semi-normalized if $m\\leq \\|x_n\\|\\leq M$ for all $n\\in \\mathbb{N}$ for some positive constants $m,M.$\n  We then apply our main results to answer several open questions concerning the existence of certain unconditional Schauderf frames. For example, we prove that if a closed subspace of $L^2(\\mathbb{R}^d)$ contains $\\{e^{2πib\\cdot x}g\\}_{b\\in Λ}$ for some infinite uniformly discrete subset $Λ$ of $\\mathbb{R}^d$ and some nonzero function $g$ in the Feichtinger algebra, it does not admit any unconditional Schauder frames of translates with finitely many generators. We will also show that no Gabor system with the critical lower Beurling density can be an unconditional Schauder frame when the window function belongs to the Feichtinger algebra. Furthermore, we present an example of a compact set of $\\mathbb{R}$ which does not admit any unconditional Schauder frames of exponentials with the critical lower Beurling density. All results in this paper apply equivalently to sequences that can be rescaled to form a frame for $H.$",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21569v1",
    "categories": [
      "math.ST",
      "cs.LG",
      "stat.ME",
      "stat.ML"
    ],
    "authors": [
      "Huan Qing"
    ],
    "title": "How many asymmetric communities are there in multi-layer directed networks?",
    "abstract": "Estimating the asymmetric numbers of communities in multi-layer directed networks is a challenging problem due to the multi-layer structures and inherent directional asymmetry, leading to possibly different numbers of sender and receiver communities. This work addresses this issue under the multi-layer stochastic co-block model, a model for multi-layer directed networks with distinct community structures in sending and receiving sides, by proposing a novel goodness-of-fit test. The test statistic relies on the deviation of the largest singular value of an aggregated normalized residual matrix from the constant 2. The test statistic exhibits a sharp dichotomy: Under the null hypothesis of correct model specification, its upper bound converges to zero with high probability; under underfitting, the test statistic itself diverges to infinity. With this property, we develop a sequential testing procedure that searches through candidate pairs of sender and receiver community numbers in a lexicographic order. The process stops at the smallest such pair where the test statistic drops below a decaying threshold. For robustness, we also propose a ratio-based variant algorithm, which detects sharp changes in the sequence of test statistics by comparing consecutive candidates. Both methods are proven to consistently determine the true numbers of sender and receiver communities under the multi-layer stochastic co-block model.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21802v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Aimeric Malter",
      "Artan Sheshmani"
    ],
    "title": "Non-commutative crepant resolutions for (almost) simplicial toric algebras",
    "abstract": "Given a rational convex polyhedral Gorenstein cone constructed as cone over a lattice polytope P, we establish that toric non-commutative crepant resolutions (NCCRs) of its associated toric algebra descend to toric NCCRs of the algebras associated to faces of the polytope P. As consequence, we present two new, short proofs to the existence of toric NCCRs for simplicial affine toric Gorenstein algebras and for almost simplicial affine toric Gorenstein algebras, i.e. those associated to cones $σ$ with $\\dimσ+1$ extremal rays.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21530v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Xiyong Yan"
    ],
    "title": "Signs of Hamiltonian Circles in Simple Plane Signed Graphs",
    "abstract": "We study which signs can occur among Hamiltonian circles in simple plane signed graphs. Using a face-based viewpoint, we relate the sign of a Hamiltonian circle to the product of the signs of the faces inside it, and we introduce co-Hamiltonian sequences. This yields a criterion for the existence of opposite-sign Hamiltonian circles via two co-Hamiltonian sequences with opposite face-products. Motivated by signed grid graphs, we develop local structural theorems that allow one to certify the existence of both signs without explicitly constructing the full sequences, including a ladder-type configuration where toggling along two $4$-circles produces Hamiltonian circles of opposite sign, as well as hexagon configurations that realize both signs.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21431v1",
    "categories": [
      "math.AG",
      "math.CT",
      "math.QA"
    ],
    "authors": [
      "Yining Chen"
    ],
    "title": "Deformation Theory of $\\mathbb{E}_n$-Monoidal Categories",
    "abstract": "In this paper, we prove that the naive deformation problem of an $\\mathbb{E}_n$-monoidal stable $k$-linear $\\infty$-category $\\mathcal{C}$ is a $2$-proximate formal $\\mathbb{E}_{n+2}$-moduli problem, whose corresponding formal moduli problem is controlled by the non-unital $\\mathbb{E}_{n+2}$-algebra $\\mathrm{fib}\\big(\\mathrm{End}_{\\mathcal{Z}_{\\mathbb{E}_n}(\\mathcal{C})}(1)\\rightarrow \\mathrm{End}_{\\mathcal{C}}(1)\\big)$, where $\\mathcal{Z}_{\\mathbb{E}_n}(\\mathcal{C})$ is the $\\mathbb{E}_n$-center of $\\mathcal{C}$. If $\\mathcal{C}$ is rigid monoidal and tamely compactly generated by unobstructible objects, then this naive deformation problem is equivalent to the formal moduli problem. We also prove a uniqueness theorem for formal deformations of certain formal moduli problems, which can be applied to the $\\mathbb{E}_1$ and $\\mathbb{E}_2$-monoidal deformation problems of $\\mathbf{Rep}(G)$ for a reductive algebraic group $G$ with a simple Lie algebra $\\mathfrak{g}=T_e G$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21385v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Eha Srivastava"
    ],
    "title": "Absolute $\\mathbb{Z}/2$ gradings in real Heegaard Floer homology",
    "abstract": "Real Heegaard Floer homology is an invariant associated to a three-manifold equipped with an involution with nonempty fixed set of codimension two. We show that when the image of the fixed point set is nullhomologous in the quotient, the real Heegaard Floer homology groups admit an absolute $\\mathbb{Z}/2$ grading; in particular this applies to double branched covers of links in $S^3$. As an application, we define a $\\mathbb{Z}$-valued invariant of knots, which is the appropriate signed analogue of Miyazawa's degree invariant. Furthermore, we show that this invariant is equal to the Alexander polynomial of the knot evaluated at $i$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21347v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "David de Frutos Ostrander",
      "Boris Hasselblatt",
      "Mark Levi"
    ],
    "title": "Horns in Billiards",
    "abstract": "We show that, like cusps, horns in billiards expel every trajectory after finitely many collisions. We further produce an adiabatic invariant.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21326v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Maximilian Illmer"
    ],
    "title": "Quantifier Elimination and Invariant Theory: Applications to Quaternions, Octonions, and Other Algebras",
    "abstract": "We build on our previous paper~\\cite{constructive} by using the general method introduced there in conjunction with invariant theory. This yields quantifier elimination results for the classical quaternions, octonions, as well as other classes of finite-dimensional algebras over real closed and algebraically closed fields. In particular, the first two examples answer an open question posed recently in~\\cite{savi}.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21315v1",
    "categories": [
      "math.PR",
      "cs.DM",
      "cs.DS",
      "cs.IT",
      "cs.NI"
    ],
    "authors": [
      "Leslie Ann Goldberg",
      "John Lapinskas"
    ],
    "title": "The Instability of all Backoff Protocols",
    "abstract": "In this paper we prove Aldous's conjecture from 1987 that there is no backoff protocol that is stable for any positive arrival rate. The setting is a communication channel for coordinating requests for a shared resource. Each user who wants to access the resource makes a request by sending a message to the channel. The users don't have any way to communicate with each other, except by sending messages to the channel. The operation of the channel proceeds in discrete time steps. If exactly one message is sent to the channel during a time step then this message succeeds (and leaves the system). If multiple messages are sent during a time step then these messages collide. Each of the users that sent these messages therefore waits a random amount of time before re-sending. A backoff protocol is a randomised algorithm for determining how long to wait -- the waiting time is a function of how many collisions a message has had. Specifically, a backoff protocol is described by a send sequence $\\overline{p} = (p_0,p_1,p_2,\\ldots)$. If a message has had $k$ collisions before a time step then, with probability $p_k$, it sends during that time step, whereas with probability $1-p_k$ it is silent (waiting for later). The most famous backoff protocol is binary exponential backoff, where $p_k = 2^{-k}$. Under Kelly's model, in which the number of new messages that arrive in the system at each time step is given by a Poisson random variable with mean $λ$, Aldous proved that binary exponential backoff is unstable for any positive $λ$. He conjectured that the same is true for any backoff protocol. We prove this conjecture.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21310v1",
    "categories": [
      "math.RA",
      "math.LO"
    ],
    "authors": [
      "Chandrasekhar Gokavarapu",
      "D. Madhusudhana Rao"
    ],
    "title": "Ternary Idempotent $Γ$-Semirings, Non-Reducibility, and Higher-Order Path Algebras",
    "abstract": "Binary idempotent semirings govern classical path algebras. Their multiplicative structure is dyadic. We examine whether this restriction is structural or accidental.\n  We define ternary idempotent $Γ$-semirings as higher-arity ordered algebraic systems admitting associative ternary composition compatible with idempotent addition. We prove that such structures strictly extend classical semiring path algebras. In particular, we construct a ternary associative operation which cannot be represented as an iterated associative binary operation. This establishes non-reducibility.\n  We formulate a higher-order path problem in directed graphs with weights in a ternary idempotent $Γ$-semiring. The associated relaxation operator is shown to be monotone on a complete lattice and to admit a least fixed point. Convergence follows under a finite acyclicity condition. The combinatorial growth of interaction windows yields a distinct complexity class relative to binary path schemes.\n  These results indicate that dyadic semiring frameworks do not exhaust algebraic path formalisms. Higher-arity composition introduces structural phenomena absent in binary systems.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21277v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Oren Louidor",
      "Santiago Saglietti"
    ],
    "title": "A Limit in Law for the Cover Time and Last Visited Vertex of Wired Planar Domains",
    "abstract": "We derive a scaling limit in law for the cover time of a simple random walk on a lattice version of a scaled-up planar domain with wired boundary conditions. The limiting distribution is that of a Gumbel Random Variable shifted randomly by an independent quantity which is equal to the full mass of a variant of the critical Liouville Quantum Gravity Measure on the same domain. We also derive a limit in law for the scaled location of the vertex visited last by the walk. Here the limit turns out to be precisely the critical Liouville Measure, normalized by its total mass. Both limits hold jointly with the limiting joint law explicitly described. These results resolve well known open problems in the field, in the case of wired boundary conditions. The proof is based on comparison with the extremal landscape of the discrete Gaussian Free Field, and in particular a version there-of obtained by conditioning the average value of the field to be zero.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21254v1",
    "categories": [
      "math-ph",
      "gr-qc",
      "hep-th",
      "nucl-th"
    ],
    "authors": [
      "Lorenzo Gavassino"
    ],
    "title": "Lorentz-boosted diffusion: initial value formulation and exact solutions",
    "abstract": "It is well known that the diffusion equation, when treated as a stand-alone partial differential equation, exhibits exponential instabilities in boosted frames, which render the corresponding initial-value problem ill-posed. Recently, however, it was shown that Fick-type diffusion arises as the exact hydrodynamic sector of relativistic Fokker-Planck kinetic theory. In this work, we exploit this kinetic embedding to formulate a modified initial-value problem for one-dimensional Lorentz-boosted diffusion. We show that the resulting dynamics are well posed both forward and backward in time, provided the boosted density profiles admit a kinetic-theory realization. Such profiles form a space of band-limited functions, within which the evolution can be expressed as a discrete superposition of spatially sampled initial data, weighted by a Shannon-Whittaker-type Green function defined on the full Minkowski plane. The Green function is obtained in closed analytic form.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21250v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Messan Médard Akouetegan",
      "Isiaka Aremua",
      "Mahouton Norbert Hounkonnou"
    ],
    "title": "Constructing Barut-Girardello coherent states for the isotonic oscillator in the DOOT approach",
    "abstract": "In this work, we study the quantum system of the isotonic oscillator from the perspective of the diagonal operator ordering technique (DOOT). Within this framework, we construct the associated Barut-Girardello and Gazeau-Klauder coherent states. We examine their mathematical properties using reproducing kernels and compute the expectation values of observables that characterize the system and its relevant physical features. Further, we perform the quantization of main classical variables in the complex plane. Then, by exploring the thermal behavior of the physical system in the constructed coherent states, we analyze the properties of mixed states described by a canonical density operator. We also obtain the corresponding Glauber-Sudarshan P-representation.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21538v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Hendry M. Lim"
    ],
    "title": "Normal-ordered equivalent of the Weyl ordering of $\\hat{q}^j \\hat{p}^k$",
    "abstract": "The problem of quantizing a bivariate dynamical system can be reduced to evaluating the ordering of $\\hat{q}^j \\hat{p}^k$. Here, we consider the Weyl ordering of $\\hat{q}^j \\hat{p}^k$ that is then expressed in term of the annihilation $\\hat{a}$ and creation $\\hat{a}^\\dagger$ operator. The explicit formula for the normal-ordered equivalent (all $\\hat{a}^\\dagger$'s preceeding all $\\hat{a}$'s) of the resulting expression is then given, and some relations are discussed.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21494v1",
    "categories": [
      "cs.IT",
      "math.CO"
    ],
    "authors": [
      "Yanzhen Xiong",
      "Jianbing Lu"
    ],
    "title": "The constructions of Singleton-optimal locally repairable codes with minimum distance 6 and locality 3",
    "abstract": "In this paper, we present new constructions of $q$-ary Singleton-optimal locally repairable codes (LRCs) with minimum distance $d=6$ and locality $r=3$, based on combinatorial structures from finite geometry. By exploiting the well-known correspondence between a complete set of mutually orthogonal Latin squares (MOLS) of order $q$ and the affine plane $\\mathrm{AG}(2,q)$, We systematically construct families of disjoint 4-arcs in the projective plane $\\mathrm{PG}(2,q)$, such that the union of any two distinct 4-arcs forms an 8-arc. These 4-arcs form what we call 4-local arcs, and their existence is equivalent to that of the desired codes. For any prime power $q\\ge 7$, our construction yields codes of length $n = 2q$, $2q-2$, or $2q-6$ depending on whether $q$ is even, $q\\equiv 3 \\pmod{4}$, or $q\\equiv 1 \\pmod{4}$, respectively.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21453v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ramin Javadi",
      "Yoshiharu Kohayakawa",
      "Meysam Miralaei"
    ],
    "title": "The Multicolor Size-Ramsey Number of Bipartite Long Subdivisions",
    "abstract": "For a positive integer $r$, the $r$-color size-Ramsey\n  number~$\\widehat{R}_r(H)$ of a graph $H$ is the minimum number of\n  edges in a graph $G$ such that every $r$-edge coloring of $G$\n  contains a monochromatic copy of $H$. For a graph~$H$ and a\n  function $σ:E(H)\\to \\mathbb{N}$, the \\emph{subdivision}\n  $H^σ$ is obtained by replacing every $e \\in E(H)$ with a path\n  of length $σ(e)$. In~\\cite{javadi25:_induced_long} it is shown\n  that for all integers $r,\\, D\\geq 2 $, there exists a constant\n  $c=c(r, D)$ such that for every graph $ H $ with maximum degree $D$\n  if $H^σ$ is a subdivision of~$H$ in which\n  $σ(e) > c \\log n $ for every $e \\in E(H)$, where\n  $n=|V(H^σ)|$, then\n  $ \\widehat{R}_r(H^σ) = O\\big(2^{34r}\n  r^6 \\log^5(r) D^5\\log D\\big)n. $ We improve upon this result in the case that~$H^σ$\n  is a bipartite graph and the number of colors~$r$ is large using a\n  significantly different argument, obtaining the bound\n  $ \\widehat{R}_r(H^σ) \\leq r^{400D \\log D} \\, n $.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21376v1",
    "categories": [
      "math.OC",
      "stat.ME"
    ],
    "authors": [
      "Xi Lin",
      "Yafeng Yin",
      "Tianming Liu"
    ],
    "title": "Fenchel-Young Estimators of Perturbed Utility Models",
    "abstract": "The Perturbed Utility Model framework offers a powerful generalization of discrete choice analysis, unifying models like Multinomial Logit and Sparsemax through convex optimization. However, standard Maximum Likelihood Estimation (MLE) faces severe theoretical and numerical challenges when applied to this broader class, particularly regarding non-convexity and instability in sparse regimes. To resolve these issues, this paper introduces a unified estimation framework based on the Fenchel-Young loss. By leveraging the intrinsic convex conjugate structure of PUMs, we demonstrate that the Fenchel-Young estimator guarantees global convexity and bounded gradients, providing a mathematically natural alternative to MLE. Addressing the critical challenge of data scarcity, we further extend this framework via Wasserstein Distributionally Robust Optimization. We first derive an exact finite-dimensional reformulation of the infinite-dimensional primal problem, establishing its theoretical convexity. However, recognizing that the resulting worst-case constraints involve computationally intractable inner maximizations, we subsequently construct a tractable safe approximation by exploiting the global Lipschitz continuity of the Fenchel-Young loss. Through this tractable formulation, we uncover a rigorous geometric unification: two canonical regularization techniques, standard L2-regularization and the margin-enforcing Hinge loss, emerge mathematically as specific limiting cases of our distributionally robust estimator. Extensive experiments on synthetic data and the Swissmetro benchmark validate that the proposed framework significantly outperforms traditional methods, recovering stable preferences even under severe data limitations.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21358v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Elaine A. Tavares-Lima",
      "Bianca Lorenzi",
      "Marcone C. Pereira"
    ],
    "title": "Attractor Continuity for Semilinear Parabolic Equations on Thin Domains with Degenerating Outward Peaks",
    "abstract": "In this work, we analyze the asymptotic behavior of the attractors associated with a semilinear parabolic equation subject to homogeneous Neumann boundary conditions and defined on a thin domain $R^\\varepsilon \\subset \\mathbb{R}^{1+n}$. We assume that the thin domain exhibits a cusp, known as an outward peak, whose geometry is characterized by a nonnegative function that vanishes at a point on the boundary. Our objective is to rigorously establish the continuity of the attractors as $\\varepsilon \\to 0$ and to determine their rate of convergence.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21344v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Wenrui Huang",
      "Hyunwoo Kwon"
    ],
    "title": "Scattering map for the Vlasov--Poisson system with a repulsive harmonic potential",
    "abstract": "We consider the Vlasov--Poisson system with a repulsive harmonic potential and prove the (modified) scattering of solutions, as well as the existence of wave operators, in any spatial dimension $d\\geq 2$. The main novelty of this work is the construction of the wave operators and the introduction of the lens transform for the Vlasov--Poisson system. In addition, we provide a new and simpler proof that relaxes the assumptions on the initial data compared with those in Bigorgne, Velozo Ruiz, and Velozo Ruiz (2025) and Velozo Ruiz, and Velozo Ruiz (2024).",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21300v1",
    "categories": [
      "math.AT",
      "math.GT"
    ],
    "authors": [
      "Jesús González",
      "Matthew Kahle",
      "Nicholas Wawrykow"
    ],
    "title": "The 15 Puzzle and homological stability in the space direction",
    "abstract": "The ordered configuration space of $n$ open unit squares in the $w$ by $h$ rectangle exhibits homological stability in the space direction. That is, for fixed $n$ and fixed homological degree $k$, once the underlying rectangle is large enough, making it any larger does not change the $k$-th homology of the square configuration space. In this paper, we sharpen the stable range. Finding bounds for $w$ and $h$ in terms of $n$ and $k$, we prove that most rectangles can be almost entirely filled with squares and there still be an isomorphism between the $k$-th homology of the resulting square configuration space and the $k$-th homology of the ordered configuration space of $n$ points in the plane.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21832v1",
    "categories": [
      "math.AP",
      "math.DG"
    ],
    "authors": [
      "Yingxiang Hu",
      "Mohammad N. Ivaki"
    ],
    "title": "Capillary $L_p$-curvature problem",
    "abstract": "We prove a gradient estimate for a class of capillary curvature equations in the half-space. As an application, we prove the existence of an even, smooth, strictly convex solution to the even capillary $L_p$-curvature problem for all $1<p<k+1$ and all contact angles $θ\\in(0,π/2)$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21809v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Serguei Popov",
      "Quirin Vogel"
    ],
    "title": "On large deviations for the range of a two-dimensional random walk",
    "abstract": "In this note, we compute the probability that a two-dimensional symmetric random walk visits more vertices than expected, for deviations on scales between the mean behavior and linear growth.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21804v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Hao Zheng"
    ],
    "title": "Quantum Hydrodynamic equation for semiconductor devices in 2-dimensional space and the relaxation time limit",
    "abstract": "This paper extends the author's previous analysis in \\cite{AMZ3} on weak solutions with large norms for the collisional quantum hydrodynamic (QHD) equations in semiconductor modeling to 2-dimensional tori.\n  We first establish the global existence of weak solutions with strictly positive density within the functional framework of GCP solutions introduced in \\cite{AMZ1}. A logarithmic Sobolev-type inequality is employed to control oscillations in the mass density. Furthermore, by constructing a combined functional that incorporates both the GCP energy and the physical entropy, we derive the exponential decay of solutions. As a byproduct of our approach, we also prove the global existence of $H^2$ solutions for a nonlinear Schrödinger-Langevin equation.\n  Finally, for GCP solutions that remain bounded away from vacuum, we justify the time-relaxation limit and provide an explicit convergence rate. Our analysis relies on compactness techniques that does not require the existence or smoothness of solutions to the limiting equations. Moreover, our results impose no well-preparedness conditions on the initial data, thereby accommodating the possible formation of an initial layer.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21708v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Rizeng Chen"
    ],
    "title": "An Effective Criterion for Covering Maps Between Real Varieties",
    "abstract": "In this paper, we show that a quasi-finite, flat morphism with locally constant geometric fibers between varieties over a real closed field induces a covering map on the rational points. This serves as an effective criteria for covering maps, as we show that these conditions can be checked by the algorithms developed in this paper.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21687v1",
    "categories": [
      "math.CO",
      "cs.GT"
    ],
    "authors": [
      "Terrence Adams",
      "Erel Segal-Halevi"
    ],
    "title": "Perpetually Fair Assignments Via Balanced Sequences of Permutations",
    "abstract": "There is a set of n indivisible items (or chores), and a set of n players. Each day, a single item should be assigned to each player. We want to ensure that all players feel that they have been treated fairly, not only after the last day, but after every single day. We present two 'balance' conditions on sequences of permutations. One condition can always be satisfied, but is arguably too weak; a second condition is strong, and can be satisfied for all n <= 11, but cannot be satisfied for some larger values of n, including all n>61.\n  We then relate the 'balance' condition to the requirement that the cumulative assignment is proportional up to one item (PROP1), where proportionality holds in a strong ordinal sense -- for every valuations that are consistent with the item ranking. We present a third balance condition that implies ordinal PROP1. We show that a sequence guaranteeing this balance condition exists for all n <= 12, but might not exist when n=6k for any k >= 19.\n  Finally, we present a fourth, weaker balance condition on a sequence, that guarantees ordinal proportionality up to two items (PROP2). Whether or not this condition can be satisfied for all n remains an open question.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21685v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "H. M. Verhelst",
      "L. Greco",
      "A. Reali"
    ],
    "title": "Adaptive isogeometric analysis of high-order phase-field fracture based on THB-splines",
    "abstract": "In recent decades, the study of fracture propagation in solids has increasingly relied on phase-field models. Several recent contributions have highlighted the potential of this approach in both static and dynamic frameworks. However, a major limitation remains the high computational cost. Two main strategies have been identified to mitigate this issue: the use of locally refined meshes and the adoption of higher-order models. In this work, leveraging Truncated Hierarchical B-splines (THB-splines), we introduce adaptive simulations of higher-order phase-field formulations (AT1 and AT2), focusing primarily on two-dimensional fracture problems.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21672v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Keke Ying",
      "Zhen Gao",
      "Tingting Yang",
      "Jianhua Zhang",
      "Xiang Cheng",
      "Tony Q. S. Quek",
      "H. Vincent Poor"
    ],
    "title": "From Specialist to Large Models: A Paradigm Evolution Towards Semantic-Aware MIMO",
    "abstract": "The sixth generation (6G) network is expected to deploy larger multiple-input multiple-output (MIMO) arrays to support massive connectivity, which will increase overhead and latency at the physical layer. Meanwhile, emerging 6G demands such as immersive communications and environmental sensing pose challenges to traditional signal processing. To address these issues, we propose the ``semantic-aware MIMO'' paradigm, which leverages specialist models and large models to perceive, utilize, and fuse the inherent semantics of channels and sources for improved performance. Moreover, for representative MIMO physical-layer tasks, e.g., random access activity detection, channel feedback, and precoding, we design specialist models that exploit channel and source semantics for better performance. Additionally, in view of the more diversified functions of 6G MIMO, we further explore large models as a scalable solution for multi-task semantic-aware MIMO and review recent advances along with their advantages and limitations. Finally, we discuss the challenges, insights, and prospects of the evolution of specialist models and large models empowered semantic-aware MIMO paradigms.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21665v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Yi C. Huang",
      "Tohru Ozawa",
      "Chenmin Sun",
      "Taiki Takeuchi"
    ],
    "title": "An optimal time-singularity of the estimate for the heat semigroup related to the critical Sobolev embedding",
    "abstract": "We give a certain $L^{\\infty}(\\mathbb{R}^2)$-estimate for the heat semigroup $\\{e^{tΔ}\\}_{t \\ge 0}$ that is closely related to the fact $H^1(\\mathbb{R}^2) \\not\\subset L^{\\infty}(\\mathbb{R}^2)$, i.e., the critical Sobolev (non-)embedding and the standard Brezis-Gallouët inequality. While we provide several approaches to show such an assertion, we also reveal that the time-singularity of our estimate as $t \\to 0^+$ is indeed optimal.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21577v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Yuanyuan Chena",
      "Huiqiu Lina",
      "Shucheng Li"
    ],
    "title": "Spectral radius, toughness, binding number and $k$-factor of graphs",
    "abstract": "A $k$-regular spanning subgraph of $G$ is called a $k$-factor. In this paper, we provide spectral radius and edge conditions to ensure that a graph $G$ with $δ(G)\\ge k$ admits a $k$-factor. Fan, Lin and Lu [European J. Combin. 110 (2023) 103701] presented a tight sufficient condition in terms of the spectral radius for a connected 1-tough graph to contain a connected 2-factor (Hamilton cycle). Then it is interesting to consider the following problem: What is the spectral radius condition to guarantee the existence of a $k$-factor with $k\\ge3$ in a connected 1-tough graph $G$ with $δ(G)\\ge k$? We completely solve this problem, and we further obtain a sufficient spectral radius condition for the existence of a $k$-factor in a connected 1-binding graph, which solves an important problem posed by Fan and Lin [Electron. J. Combin. 31 (2024) 1--30].",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21576v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Mustafa Avci"
    ],
    "title": "A Topological Approach to Singular Double-Phase Equations with Variable Exponents",
    "abstract": "In the present paper, we study a singular double phase variable exponent Dirichlet problem in the setting of a new Musielak-Orlicz Sobolev space with the nonlinearity (the external source) having gradient dependence (so-called convection terms). We apply a topological existence result incorporating the Leray-Schauder degree and homotopy mapping together to prove the existence of at least one nontrivial solution.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21761v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yunpeng Ba",
      "Xi Lin",
      "Changliang Zhou",
      "Ruihao Zheng",
      "Zhenkun Wang",
      "Xinyan Liang",
      "Zhichao Lu",
      "Jianyong Sun",
      "Yuhua Qian",
      "Qingfu Zhang"
    ],
    "title": "Survey on Neural Routing Solvers",
    "abstract": "Neural routing solvers (NRSs) that leverage deep learning to tackle vehicle routing problems have demonstrated notable potential for practical applications. By learning implicit heuristic rules from data, NRSs replace the handcrafted counterparts in classic heuristic frameworks, thereby reducing reliance on costly manual design and trial-and-error adjustments. This survey makes two main contributions: (1) The heuristic nature of NRSs is highlighted, and existing NRSs are reviewed from the perspective of heuristics. A hierarchical taxonomy based on heuristic principles is further introduced. (2) A generalization-focused evaluation pipeline is proposed to address limitations of the conventional pipeline. Comparative benchmarking of representative NRSs across both pipelines uncovers a series of previously unreported gaps in current research.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21208v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Alborz Azarang"
    ],
    "title": "Non-commutative rings with infinitely many maximal subrings",
    "abstract": "We study rings with infinitely (only finitely) many maximal subrings. We prove that if $M$ is a maximal left/right ideal of a ring $T$ which is not an ideal of $T$, and $R$ is the idealizer of $M$, then $T$ has at least $|R/M|+1$ maximal left/right ideals which are not an ideal of $T$; in particular $T$ has at least $|R/M|+1$ distinct maximal subrings. Moreover, if $T$ is a $K$-algebra over an infinite field $K$, then either $T$ has infinitely many maximal subrings or $T$ is a quasi duo ring with certain algebraic properties similar to commutative rings. We prove that for a simple ring $R$, the ring $R\\times R$ has only finitely many maximal subrings if and only if $R$ is finite. Also we study rings which are integral over their centers and have only finitely many maximal subrings. We prove that if $T$ is integral over its center and $T$ has more than $2^{\\aleph_0}$ maximal (left/right) ideals, then $T$ has infinitely many maximal subrings. In particular, we see that if a $J$-semisimple ring $T$ is integral over its center and has only finitely many maximal subrings, then $T$ embeds in $S\\times \\prod_{i\\in I}E_i$, where each $E_i$ is an absolutely algebraic field and $S$ is a finite semisimple ring. We see that if $T$ is a left Noetherian algebraic $K$-algebra over an infinite field $K$ and $T$ has only finitely many maximal subrings, then $T$ is a countable left Artinian ring which is integral over $\\mathbb{Z}_p$, where $p=Char(K)$. We exactly determine when $T=\\prod_{i\\in I}\\mathbb{M}_{n_i}(E_i)$, where each $E_i$ is a field and $n_i\\in\\mathbb{N}$, has only finitely many maximal subrings. We see that if $R$ is an infinite Artinian ring, then $\\mathbb{M}_n(R)$, $n>1$, and $R\\times R$ have infinitely many maximal subrings.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21823v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Katsuhisa Koshino"
    ],
    "title": "Compactness of averaging operators on non-reflexive Lebesgue spaces",
    "abstract": "Let $X$ be a Borel and Borel-regular metric measure space whose closed balls are of positive and finite measure. In this paper, we shall give equivalent conditions for averaging operators on non-reflexive Lebesgue spaces $L^1(X)$ and $L^\\infty(X)$ on X to be compact, where X has some doubling property and satisfies certain uniform continuity between metric and measure.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21815v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Matteo Vannacci"
    ],
    "title": "On subgroup growth of iterated wreath products in product action",
    "abstract": "We show that there are hereditarily just infinite groups of any subgroup growth type between $n$ and $n^{\\log n}$. This is obtained calculating the subgroup growth type of a family of hereditarily just infinite profinite groups obtained via iterated wreath products of finite permutation groups with respect to product actions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21813v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Xiaoxiang Chai",
      "Xueyuan Wan"
    ],
    "title": "Llarull type theorems for bands in Three and Four dimensions",
    "abstract": "Llarull's theorem asserts that the scalar curvature and the metric on the $n$-sphere cannot be bounded below at the same time by those of the standard $n$-sphere. Using the warped $μ$-bubble method, we develop Llarull type theorems for three and four-dimensional bands with spectral scalar curvature bounds.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21797v1",
    "categories": [
      "math.AG",
      "cs.LG"
    ],
    "authors": [
      "Paolo Andreini",
      "Alessandra Bernardi",
      "Monica Bianchini",
      "Barbara Toniella Corradini",
      "Sara Marziali",
      "Giacomo Nunziati",
      "Franco Scarselli"
    ],
    "title": "Neural Learning of Fast Matrix Multiplication Algorithms: A StrassenNet Approach",
    "abstract": "Fast matrix multiplication can be described as searching for low-rank decompositions of the matrix--multiplication tensor. We design a neural architecture, \\textsc{StrassenNet}, which reproduces the Strassen algorithm for $2\\times 2$ multiplication. Across many independent runs the network always converges to a rank-$7$ tensor, thus numerically recovering Strassen's optimal algorithm. We then train the same architecture on $3\\times 3$ multiplication with rank $r\\in\\{19,\\dots,23\\}$. Our experiments reveal a clear numerical threshold: models with $r=23$ attain significantly lower validation error than those with $r\\le 22$, suggesting that $r=23$ could actually be the smallest effective rank of the matrix multiplication tensor $3\\times 3$.\n  We also sketch an extension of the method to border-rank decompositions via an $\\varepsilon$--parametrisation and report preliminary results consistent with the known bounds for the border rank of the $3\\times 3$ matrix--multiplication tensor.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21781v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "quant-ph"
    ],
    "authors": [
      "Benedikt M. Reible",
      "Luigi Delle Site"
    ],
    "title": "On some mathematical problems for open quantum systems with varying particle number",
    "abstract": "We derive the effective Hamiltonian $H - μN$ for open quantum systems with varying particle number from first principles within the framework of non-relativistic quantum statistical mechanics. We prove that under physically motivated assumptions regarding the size of the system and the range of the interaction, this form of the Hamiltonian is unique up to a constant. Our argument relies firstly on establishing a rigorous version of the surface-to-volume ratio approximation, which is routinely used in an empirical form in statistical mechanics, and secondly on showing that the Hilbert space for systems with varying particle number must be isomorphic to Fock space. Together, these findings provide a rigorous mathematical justification for the standard grand canonical formalism employed in statistical physics.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21632v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ranit Dutta",
      "Pantelimon Stanica",
      "Bimal Mandal"
    ],
    "title": "Permutation Polynomials Under Multiplicative-Additive Perturbations: Characterization via Difference Distribution Tables",
    "abstract": "We investigate permutation polynomials F over finite fields F_{p^n} whose generalized derivative maps x -> F(x + a) - cF(x) are themselves permutations for all nonzero shifts a. This property, termed perfect c-nonlinearity (PcN), represents optimal resistance to c-differential attacks - a concern highlighted by recent cryptanalysis of the Kuznyechik cipher variant. We provide the first characterization using the classical difference distribution table (DDT): F is PcN if and only if Delta_F(a,b) Delta_F(a,c^{-1}b) = 0 for all nonzero a,b. This enables verification in O(p^{2n}) time given a precomputed DDT, a significant improvement over the naive O(p^{3n}) approach. We prove a strict dichotomy for monomial permutations: the derivative F(x + alpha) - cF(x) is either a permutation for all nonzero shifts or for none, with the general case remaining open. For quadratic permutations, we provide explicit algebraic characterizations. We identify the first class of affine transformations preserving c-differential uniformity and derive tight nonlinearity bounds revealing fundamental incompatibility between PcN and APN properties. These results position perfect c-nonlinearity as a structurally distinct regime within permutation polynomial theory.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21623v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Jorge Olivares-Vinales",
      "Semin Yoo"
    ],
    "title": "Towers and Bratteli-Vershik systems in Fibonacci-like unimodal maps",
    "abstract": "For a class of Fibonacci-like unimodal maps, the restriction to the $ω$-limit set of the unique turning point defines a minimal Cantor system. We construct these Cantor sets geometrically using a nested sequence of finite covers with a tower structure. From this tower structure, we recover the associated Bratteli-Vershik model determined by the cutting times and obtain an explicit formula for the unique ergodic invariant probability measure supported on the $ω$-limit set. We conclude with applications illustrating the scope of the construction.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21609v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Huimin Lao",
      "Hao Chen",
      "San Ling",
      "Yaqi Chen"
    ],
    "title": "Concatenated Sum-Rank Codes",
    "abstract": "Sum-rank codes have wide applications in multishot network coding, distributed storage and the construction of space-time codes. Asymptotically good sequences of linearized algebraic geometry sum-rank codes, exceeding the Gilbert-Varshamov-like bound, were constructed in a recent paper published in IEEE Trans. Inf. Theory by E. Berardini and X. Caruso. We call this bound the Tsfasman-Vladut-Zink-like bound. In this paper, we introduce the concatenation of a sum-rank code and a Hamming metric code. Then many sum-rank codes with good parameters, which are better than sum-rank BCH codes, are constructed simply and explicitly. Moreover, we obtain an asymptotically good sequence of sum-rank codes exceeding the Tsfasman-Vladut-Zink-like bound and the Gilbert-Varshamov-like bound.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21574v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Na Li",
      "Yongchao Zhao"
    ],
    "title": "Convergence Analysis of a Linear, Unconditionally Energy-Stable SAV Finite Element Method for the Cahn-Hilliard Equation",
    "abstract": "This paper proposes a finite element scheme, based on the Scalar Auxiliary Variable (SAV) approach, for the Cahn-Hilliard equation--a model that possesses significant physical relevance and a rich mathematical structure. A convergence analysis of the fully discrete scheme is conducted under suitable regularity assumptions, confirming optimal-order convergence in both time and space for the phase variable, chemical potential, and auxiliary variable in the H1-norm. Furthermore, the scheme is proven to be unconditionally energy stable. Finally, a numerical example is presented to demonstrate the effectiveness of the method and to confirm the theoretical convergence rates.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21528v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Mohamed Akrout",
      "Amine Mezghani",
      "Faouzi Bellili",
      "Robert W. Heath"
    ],
    "title": "Guided Wireless Technology for Near-Field Communication",
    "abstract": "Guided wireless technology is an innovative approach that combines the strengths of guided waves and wireless communication. In traditional wireless systems, signals propagate through the air, where they are vulnerable to interference, attenuation, and jamming. Guided communication, in contrast, confines signals within a physical medium, significantly reducing interference and supporting higher data rates over longer distances. Guided wireless technology harnesses these benefits by creating guided wireless channels and offering a controlled pathway for electromagnetic waves. This work harnesses these benefits by focusing on the modeling of near-field communication through long connected arrays deployed in linear-cell environments. We derive a circuit model for long array as an infinitely long dipole with multiple periodic feed points before approximating it with a finite array through open circuiting. Through our simulations, we show how the standing wave phenomenon is confirmed by the oscillations in spectral efficiency. We also demonstrate the capability of the LMMSE transmit beamformer in mitigating interference and minimizing the mean square error by adaptively allocating more power to the user experiencing the most severe channel attenuation, resulting in a more balanced variation of achievable rates across users.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21506v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Guanghui Wang",
      "Lingda Xu",
      "Tong Yang",
      "Mingying Zhong"
    ],
    "title": "Hydrodynamic limit of rarefaction wave for the Vlasov-Maxwell-Landau system with Coulomb potential",
    "abstract": "In this paper, we investigate the hydrodynamic limit of rarefaction wave for the two-species Vlasov-Maxwell-Landau(VML) system with Coulomb potential. We prove that for any given time interval, the solution of the Vlasov-Maxwell-Landau system with appropriate initial data converges to a rarefaction wave as the Knudsen number $ε$ approaches zero. The main difficulty in the analysis lies in the loss of dissipation in the interaction between the electromagnetic field and the microscopic component, and the weak dissipation induced by the Lorentz force and the scaling with small parameter $ε$. For this, we introduce a velocity weight function and a space-time scaling parameter together with suitable $ε$-dependent energy estimates.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21465v1",
    "categories": [
      "math.ST",
      "math.PR"
    ],
    "authors": [
      "Nahom Seyoum"
    ],
    "title": "Exponential Concentration Inequalities For Independent Random Vectors Under Sublinear Expectations",
    "abstract": "Li and Hu recently established variance-type O(1/n) bounds for the sample mean of independent random vectors under sublinear expectations. We extend their results to the exponential concentration regime. For bounded, independent R^d-valued random vectors under a regular sublinear expectation, we prove: (i) a general concentration principle that reduces vector-valued tail bounds to scalar martingale inequalities via a three-layer architecture; (ii) an Azuma-Hoeffding inequality showing that the distance from the sample mean to the Minkowski average of the expectation sets has sub-Gaussian tails; (iii) a Bernstein inequality incorporating the variance parameter of Li and Hu, interpolating between sub-Gaussian and sub-exponential regimes; (iv) a dimension-free bound replacing the exponential covering prefactor with a polynomial one via the matrix Freedman inequality; and (v) an explicit construction demonstrating that the sub-Gaussian rate is optimal. To the best of our knowledge, these constitute the first exponential concentration inequalities for the multivariate sample mean under sublinear expectations in terms of the set-valued distance to the Minkowski average.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21423v1",
    "categories": [
      "math.ST",
      "stat.ME"
    ],
    "authors": [
      "Patrick Kramer",
      "Edward H. Kennedy",
      "Isaac M. Opper"
    ],
    "title": "Causal Inference with High-Dimensional Treatments",
    "abstract": "In this work, we consider causal inference in various high-dimensional treatment settings, including for single multi-valued treatments and vector treatments with binary or continuous components, when the number of treatments can be comparable to or even larger than the number of observations. These settings bring unique challenges: first, the treatment effects of interest are a high-dimensional vector rather than a low-dimensional scalar; second, positivity violations are often unavoidable; and third, estimation can be based on a smaller effective sample size. We first discuss fundamental limits of estimating effects here, showing that consistent estimation is impossible without further assumptions. We go on to propose a novel sparse pseudo-outcome regression framework for arbitrary high-dimensional statistical functionals, which includes generic constrained regression estimators and error guarantees. We use the framework to derive new doubly robust estimators for mean potential outcomes of high-dimensional treatments, though it can also be applied to other scenarios. We analyze the proposed estimators under exact and approximate sparsity assumptions, giving finite-sample risk bounds. Finally, we derive minimax lower bounds to characterize optimal rates of convergence and show our risk bounds are unimprovable.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21417v1",
    "categories": [
      "math.NT",
      "math.PR"
    ],
    "authors": [
      "Cristian Cobeli",
      "The Nguyen",
      "Alexandru Zaharescu"
    ],
    "title": "A statistical model for points expanding in higher dimensions while being tied to bijective involutions",
    "abstract": "Let $\\mathcal{M}$ be a set with $M$ elements, let $ψ:\\mathcal{M}\\to\\mathcal{M}$ be a bijective involution, and let~$\\boldsymbol{\\mathcal{X}}_ψ$ be the set of sequences $(x_1,\\dots,x_M)\\in\\mathcal{M}^M$ with the property that $x_{M+1-j} = ψ(x_j)$ for $1\\le j\\le M$. This framework can be used to infer the possible distribution of sequences, such as the modular ones, that pose challenges for conventional methods.\n  We prove that when $M$ is even, there exists a limit probability density function that weighs the parameter $k$ that counts the appearances of the elements of $\\mathcal{M}$ among the terms of sequences $\\textbf{x}\\in\\boldsymbol{\\mathcal{X}}_ψ$. It turns out that the number of fixed points of $ψ$ influences the probability density function, which decomposes into two pieces, each multiplied by complementary factors, and the smaller of the two pieces appears only when $k$ is even.\n  Applying the model, we find a threshold from which almost all sequences contain related terms with prescribed frequencies.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21352v1",
    "categories": [
      "math.OC",
      "math.AP",
      "math.NA"
    ],
    "authors": [
      "Chiu-Yen Kao",
      "Seyyed Abbas Mohammadi",
      "Braxton Osting"
    ],
    "title": "An accelerated rearrangement method for two-phase composite optimization",
    "abstract": "We propose and analyze an Accelerated Rearrangement Method (ARM) for solving a class of nonconvex optimization problems involving two-phase composites. These problems include maximizing the (work) energy of a membrane governed by the Poisson equation and minimizing the principal eigenvalue of a weighted Dirichlet-Laplacian, both subject to material distribution constraints. Building on the classical rearrangement method, we introduce momentum-like acceleration by extrapolating the Fréchet derivative, leading to a provably convergent algorithm. We also introduce a restarted variant that guarantees monotonic improvement of the objective. In one dimension, we derive asymptotic convergence rates for ARM and prove that they improve upon the classical rearrangement method. Numerical experiments in both two and three dimensions confirm the accelerated convergence and demonstrate practical efficiency.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21828v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Ariel Avital",
      "Aryeh Kontorovich",
      "George Salafatinos"
    ],
    "title": "TV over Bernoulli products: the small parameter regime",
    "abstract": "We study the total variation distance (TV) between two $n$-fold Bernoulli product measures parametrized by $\\vec p=(p_1,\\ldots,p_n)$ and $\\vec q=(q_1,\\ldots,q_n)$, respectively, in the \\emph{tiny} and \\emph{small} regimes. In the tiny regime, we have $p_i,q_i\\lesssim 1/n^2$, and in the small regime, $p_i,q_i\\lesssim 1/n$. We discover that in the tiny regime, the TV distance behaves as $\\|\\vec p-\\vec q\\|_1$, while in the small regime, it behaves as \\[ \\sum_{i=1}^n \\Big| p_i\\prod_{j\\neq i}(1-p_j) -\nq_i\\prod_{j\\neq i}(1-q_j) \\Big|, \\] both up to absolute constants. Along the way we discover some identities of possible independent interest.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21270v1",
    "categories": [
      "math.GM"
    ],
    "authors": [
      "Dimitris Vartziotis"
    ],
    "title": "Rigorous Geometric Obstructions for Fourier Curves Generated by Prime Numbers",
    "abstract": "We study planar curves defined by finite Fourier series of the form $F_n(t)=\\sum_{p\\le n} v_p(n!)\\, e^{i p t}$, where the frequencies are the prime numbers and $v_p(n!)$ denotes the exponent of the prime $p$ in the factorization of $n!$. We establish several rigorous obstructions to uniform geometric regularity as $n\\to\\infty$. In particular, we prove that the curve lengths grow without bound, that neither the first nor the second derivatives remain uniformly bounded, and that the diameters grow at least on the order of $n\\log\\log n$. As a consequence, the covering numbers of the curves satisfy explicit quantitative lower bounds. These results provide a rigorous explanation for the complex geometric behavior observed in numerical investigations of this model.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21258v1",
    "categories": [
      "math.DG",
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "Jose Franco",
      "Allan Merino"
    ],
    "title": "The Cone of J-Hermitian Matrices and a Geometric Mean",
    "abstract": "We study the cone $\\mathscr{P}_{\\text{J}}$ of positive J-Hermitian matrices associated with an indefinite signature matrix J = $\\text{Id}_{p,q}$. We show that the J-exponential map is bijective and use it to analyze the algebraic and geometric structure of $\\mathscr{P}_{\\text{J}}$. Through a canonical identification with the cone of positive definite matrices, we endow $\\mathscr{P}_{\\text{J}}$ with a natural Riemannian structure. In this setting, we define a J-geometric mean as the midpoint of geodesics and prove that it is uniquely characterized as the solution of a Riccati-type equation.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21211v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Avisek Bist",
      "Namita Behera"
    ],
    "title": "Structured Linearizations of Structured Rational Matrices",
    "abstract": "Numerical computations involving rational matrices often benefit from preserving underlying matrix structures such as symmetry, Hermitian properties, or sparsity that reflect physical, geometric, or algebraic characteristics of the system. Maintaining such structures enhances stability, accuracy, and efficiency. Linearization, a technique that reformulates rational matrix problems as generalized eigenvalue problems (GEPs) of larger matrices, is widely used but does not automatically retain structure. In this chapter, we focus on structured linearizations, which preserve both the spectral information of the original rational matrix and its intrinsic structural properties. To achieve this, we present the construction of a family of linearizations called generalized Fiedler pencils with repetition (GFPR), which we prove to be valid linearizations for rational matrices. Moreover, we demonstrate that the GFPR family serves as a versatile framework for generating structured linearizations, specifically symmetric, skew-symmetric, T-even, and T-odd linearizations, provided the original rational matrix exhibits the corresponding structure. These structured linearizations facilitate the use of specialized, structure-preserving algorithms, reduce numerical errors, and yield physically meaningful solutions in application",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21210v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Jobir Adashev",
      "Ivan Kaygorodov"
    ],
    "title": "$δ$-Leibniz algebras and related $δ$-type algebras",
    "abstract": "This paper introduces and investigates the structure of $δ$-Leibniz algebras, which serve as a parametric generalization of classical Leibniz algebras defined by a scalar $δ$. The authors define $δ$-Lie algebras, $δ$-Lie dialgebras, and $δ$-Zinbiel algebras via a standard procedure and study their fundamental properties. Furthermore, the research describes symmetric $δ$-Leibniz algebras and algebras of $δ$-biderivation type, establishing their connections with nilalgebras. Finally, these results provide a unified framework for understanding various classes of non-associative algebras through the lens of the $δ$ parameter.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21207v1",
    "categories": [
      "math.RA",
      "math.GR"
    ],
    "authors": [
      "Jaehwan Kim"
    ],
    "title": "Three-Sign Cancellation Hypernumber Systems and Associator Curvature",
    "abstract": "We introduce and study a three-sign cancellation hypernumber system $H$ which extends the real field by adjoining a third sign $Λ$. The underlying set is $H=\\{0\\}\\cup\\{+,-,Λ\\}\\times\\mathbb{R}_{>0}$, with a single-valued multiplication and a hyperaddition $\\boxplus$ designed to encode cancellation phenomena between positive and negative reals. The classical real line embeds as a genuine subfield $\\mathbb{R}_{\\mathrm{cl}}\\subset H$, and all field operations agree with the usual ones on $\\mathbb{R}$. The additive structure of $H$ is almost associative but not a canonical hypergroup. We give an explicit description of where associativity fails and compute, for triples of the form $(+,a),(-,b),(Λ,c)$, a closed formula for the associativity defect $κ(a,b,c)=2\\min(a,b)=a+b-|a-b|$, which coincides with the loss of absolute value when adding $a$ and $-b$ in $\\mathbb{R}$. To explain this behaviour, we construct an ambient ''cancellation monoid'' $(K,\\oplus)$ on $\\mathbb{R}\\times\\mathbb{R}_{\\ge 0}$ which is strictly associative and records both real sums and accumulated cancellation mass. We prove that $H$ cannot be recovered from $K$ by any simple projection, and formulate an ambient reconstruction problem. In addition, scalar multiplication by real numbers (defined via the embedded copy of $\\mathbb{R}$) distributes over $\\boxplus$, and the sign-layer admits a canonical hypergroup envelope governing the possible signs of hypersums. The results provide a controlled example of a nonassociative hyperaddition sitting over the real field and suggest several directions for multisign generalizations and connections with hyperfields and tropical geometry.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21532v1",
    "categories": [
      "math.DG",
      "math-ph"
    ],
    "authors": [
      "Lingrui Jiang",
      "Si-qi Liu",
      "Yingchao Tian",
      "Youjin Zhang"
    ],
    "title": "Generalized Frobenius Manifold Structures on the Orbit Spaces of Affine Weyl Groups II",
    "abstract": "This is a sequel to arXiv:2506.13656, in which an approach to construct a class of generalized Frobenius manifold structures on the orbit spaces of affine Weyl groups is presented. In this paper we apply this construction to the affine Weyl groups of type $A_\\ell, B_\\ell, C_\\ell$ and $D_\\ell$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21448v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Linheng Ruan",
      "Ilja Kröker",
      "Sergey Oladyshkin",
      "Iryna Rybak"
    ],
    "title": "Surrogate-assisted global sensitivity analysis of a hybrid-dimensional Stokes--Brinkman--Darcy model",
    "abstract": "Development of new multiscale mathematical models often entails considerable complexity and multiple undetermined parameters, typically arising from closure relations. To enable reliable simulations, one must quantify how uncertain physical parameters influence model predictions. We propose surrogate-assisted global sensitivity analysis that combines computational efficiency with a rigorous assessment of parameter influence. In this work, we analyze the recently proposed hybrid-dimensional Stokes--Brinkman--Darcy model, which describes fluid flows in coupled free-flow and porous-medium systems with arbitrary flow directions at the fluid--porous interface. The model results from vertical averaging and contains several unknown parameters. We perform surrogate-assisted global sensitivity analysis using Sobol' indices to investigate the sensitivity of the model to variations of physical parameters for two test cases: filtration and splitting flows. However, constructing surrogates for higher-dimensional random fields requires either many training runs or sophisticated sampling strategies. To address this, we compare polynomial chaos surrogates, including sparse and multi-resolution representations, for their efficiency in global sensitivity analysis, using a predefined Sobol' sequence of training samples. Across the tested cases, multi-resolution approach delivers the most accurate estimation of Sobol' indices.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21439v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Heiko Gimperlein",
      "Runan He",
      "Andrew A. Lacey"
    ],
    "title": "Analysis of a Model for Electrical Discharge in MEMS",
    "abstract": "We study the local well-posedness of the solution to a coupled nonlinear elliptic-parabolic system which models electrical discharge in a Micro-Electro-Mechanical System (MEMS). A simple MEMS capacitor device contains two plates acting as the capacitor's electrodes, one of which is flexible, and which are separated by a narrow gas-filled gap. In the event of the flexible plate approaching the other, electrical discharge can occur. This is modelled here by two parabolic equations, for densities of electrons and positive ions, and an elliptic equation for electric potential. We show the local-in-time existence of a weak solution for the coupled system. Compactness techniques, used previously in the study of drift-diffusion equations, are employed in our proof.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21384v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Patrick E. Farrell",
      "Josef Málek",
      "Ondřej Souček",
      "Umberto Zerbinati"
    ],
    "title": "A kinetic interpretation of thermomechanical restrictions of continua",
    "abstract": "Rajagopal and Srinivasa's thermodynamic framework derives constitutive relations in continuum mechanics from two scalar functions describing energy storage and entropy production via a constrained optimization principle. In parallel, kinetic theory obtains constitutive laws through moment closure, most notably via the Chapman-Enskog expansion.\n  In this work we establish a connection between these approaches by providing a kinetic interpretation of the Rajagopal-Srinivasa principle of maximal entropy production. For Bhatnagar-Gross-Krook-type kinetics, we show that this principle is equivalent to a minimal relaxation-time principle, selecting among admissible constitutive responses the one with the fastest compatible relaxation toward equilibrium.\n  We show how the caloric equation of state, entropy balance, and entropy production can be computed from kinetic theory, and we propose a hybrid methodology in which the Chapman--Enskog expansion is used only to compute entropy production and equilibrium thermodynamic relations, while full constitutive closures are obtained through constrained optimization. The proposed hybrid Chapman-Enskog-Rajagopal-Srinivasa approach recovers the standard Euler and Navier-Stokes-Fourier constitutive laws for monatomic gases. We demonstrate how different choices of selection procedure can be more informative than the classical Chapman-Enskog closure in the context of an inviscid compressible Leslie-Ericksen model arising in liquid crystals.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21362v1",
    "categories": [
      "math.CO",
      "cs.CE"
    ],
    "authors": [
      "Bibhas Adhikari"
    ],
    "title": "Signed network models for dimensionality reduction of portfolio optimization",
    "abstract": "In this paper, we develop a time-series-based signed network model for dimensionality reduction in portfolio optimization, grounded in Markowitz's portfolio theory and extended to incorporate higher-order moments of asset return distributions. Unlike traditional correlation-based approaches, we construct a complete signed graph for each trading day within a specified time window, where the sign of an edge between a pair of assets is determined by the relative behavior of their log returns with respect to their mean returns. Within this framework, we introduce a combinatorial interpretation of higher-order moments, showing that maximizing skewness and minimizing kurtosis correspond to maximizing balanced triangles and balanced 4-cliques with specific signed edge configurations respectively. We establish that the latter leads to an NP-hard combinatorial optimization problem, while the former is naturally guaranteed by the structural properties of the signed graph model. Based on this interpretation, we propose a dimensionality reduction method using a combinatorial formulation of the mean-variance optimization problem through a combinatorial hedge score metric for assets. The proposed framework is validated through extensive backtesting on 199 S\\&P 500 assets over a 16-year period (2006 - 2021), demonstrating the effectiveness of reduced asset universes for portfolio construction using both Markowitz optimization and equally weighted strategy.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21359v1",
    "categories": [
      "math.ST",
      "stat.ME"
    ],
    "authors": [
      "Swarnadeep Datta",
      "Monitirtha Dey"
    ],
    "title": "Some Asymptotic Results on Multiple Testing under Weak Dependence",
    "abstract": "This paper studies the means-testing problem under weakly correlated Normal setups. Although quite common in genomic applications, test procedures having exact FWER control under such dependence structures are nonexistent. We explore the asymptotic behaviors of the classical Bonferroni (when adjusted suitably) and the Sidak procedure; and show that both of these control FWER at the desired level exactly as the number of hypotheses approaches infinity. We derive analogous limiting results on the generalized family-wise error rate and power. Simulation studies depict the asymptotic exactness of the procedures empirically.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21348v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tarek Zöchling"
    ],
    "title": "Global Strong Well-posedness of the heat-conducting, compressible primitive Equations",
    "abstract": "The full heat-conducting compressible primitive equations are considered, extending the compressible primitive-equation framework by coupling the temperature through the ideal gas law and the thermal energy balance in the presence of gravity. Global strong well-posedness is established for small perturbations of an equilibrium state, thereby providing a result beyond the isothermal regime. The proof relies on a structural representation of the density in terms of the temperature and on a new Lagrangian transformation.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21313v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Valentin Gutev"
    ],
    "title": "Continuous Selections, Function Spaces and Partitions of Unity",
    "abstract": "The famous Michael selection theorem deals with the characterisation of paracompact spaces by continuous selections of lower semi-continuous mappings in Banach spaces. In this paper, we will discuss several equivalent forms of this theorem, without explicitly mentioning paracompactness. This will be based on a previous result, also obtained by Michael, that a space $X$ is paracompact if and only if every open cover of $X$ has an index-subordinated partition of unity. Thus, we will show that the existence of such partitions of unity on a space $X$ is equivalent to the existence of continuous selections for special lower semi-continuous mappings from $X$ to the nonempty convex subsets of special function spaces.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21775v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Laure Marêché"
    ],
    "title": "True self-repelling motion above a general barrier",
    "abstract": "The true self-repelling motion is a continuous-time random process which was introduced by Tóth and Werner in 1998 to be a limit for the \"true\" self-avoiding random walk defined by Tóth in 1995. The construction of the true self-repelling motion involves an uncountable system of coalescing Brownian motions starting from all points of the upper half-plane, related to the Brownian web, but reflected and absorbed on a \"barrier\" which is the abscissa axis. In this work, we consider much more general barriers, construct an uncountable system of coalescing Brownian motions reflected and absorbed on these barriers, and the true self-repelling motion associated to it. The extension of the proofs of Tóth and Werner to this more general case is surprisingly difficult, especially when the barrier is irregular.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21767v1",
    "categories": [
      "math.NA",
      "math.DS"
    ],
    "authors": [
      "P. Giesl",
      "S. Hafstein",
      "B. Hamzi",
      "J. Lee",
      "H. Owhadi",
      "G. Santin",
      "U. Vaidya"
    ],
    "title": "Kernel Methods for the Construction of Certified Lyapunov Functions via Approximate Koopman Eigenfunctions",
    "abstract": "We present a kernel-based methodology for constructing Lyapunov functions for nonlinear dynamical systems using approximate Koopman eigenfunctions. Our approach decomposes principal Koopman eigenfunctions into linear and nonlinear components, where the linear part is obtained from the system's linearization and the nonlinear part is computed by solving a partial differential equation using symmetric kernel collocation in reproducing kernel Hilbert spaces (RKHS). The resulting Lyapunov function is constructed as a quadratic form in the approximate eigenfunctions. We establish error bounds relating the approximation quality to the fill distance of collocation points and provide a certification procedure using continuous piecewise affine (CPA) methods. Numerical experiments on benchmark systems, including a polynomial system and the Duffing oscillator, demonstrate the effectiveness of our approach.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21764v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "William Wu",
      "Qidi Peng"
    ],
    "title": "Estimation of the Self-similarity Index of Non-stationary Increments Self-similar Processes via Lamperti Transformations",
    "abstract": "We introduce a novel method for estimating the self-similarity index of a general $H$-self-similar process with either stationary or non-stationary increments. The estimation algorithm is developed based on a modified Lamperti transformation, which transforms $H$-self-similar processes to stationary ones. As an application, we show how to use this approach to estimate the self-similarity index of fractional Brownian motion, subfractional Brownian motion, bifractional Brownian motion, and trifractional Brownian motion. Simulation study is performed to support the consistency of our estimators. Implementation in Python is publicly shared. Application on the estimation of the self-similarity index of the Nile river water level data from the year 900 to 1200 C.E..",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21759v1",
    "categories": [
      "math.SG",
      "math.CT"
    ],
    "authors": [
      "Stéphane Guillermou",
      "Claude Viterbo",
      "Bingyu Zhang"
    ],
    "title": "Density of fibers for the filtered Fukaya category of $T^*N$",
    "abstract": "We answer a question of Biran and Cornea about the density of iterated cones of fibers in the Fukaya category of a cotangent bundle. We prove that indeed if we take a dense set of basepoints, the iterated cones of the cotangent fibres are dense in the Filtered Fukaya category.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21753v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Lisa Stammen",
      "Wolfgang Dornisch"
    ],
    "title": "A dual lumping procedure for static condensation in mixed NURBS-based isogeometric elements with optimal convergence rates for arbitrary open knot vectors",
    "abstract": "Locking is a common effect in finite element and isogeometric analysis. In the case of plates, transverse shear locking is most prominent, for shells several other types of locking exist. A common cure are mixed methods that introduce additional fields of unknowns into the variational formulation. These fields reduce constraints and thus alleviate locking significantly. As a drawback, the discretized additional fields increase computational costs significantly. These fields are often eliminated by static condensation, which requires the inverse of a part of the stiffness matrix. In Lagrange-based finite elements, this inverse is computed on element level, due to a discontinuous interpolation of additional fields. Since isogeometric analysis features higher continuity, static condensation must be performed on patch level, which requires a costly matrix inversion on that level. In this contribution, the virtual shear parameters of a mixed isogeometric plate formulation are interpolated by enhanced approximate dual basis functions. This allows to conduct row-sum lumping of the relevant matrix part at a minimal loss of accuracy, since this part becomes diagonal dominant. For a properly chosen integration space, this lumped matrix becomes the identity matrix. Thus, the proposed condensation procedure does not require an inversion anymore. The crucial and novel point is the proposed treatment of knot vectors with limited internal continuity. With the help of several single- and multi-patch examples, both with full and with limited internal continuity, we show that the proposed procedure obtains optimal error convergence rates in all cases, while without these alterations, convergence rates are significantly deteriorated.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21751v1",
    "categories": [
      "math.AT",
      "math.AG"
    ],
    "authors": [
      "Victor M. Buchstaber",
      "Svjetlana Terzić"
    ],
    "title": "Cohomology of symplectic $T^n$ - reductions and compactifications of $\\mathcal{M}_{0, n}$",
    "abstract": "A symplectic $T^n$ - reduction on a complex Grassmann manifold $G_{n,2}$ for the canonical action of the maximal compact torus depends on the $S_n$ - orbit of a maximal chamber in a hypersimplex $Δ_{n,2}$. The chamber decomposition of $Δ_{n,2}$ is defined by the admissible polytopes, which can be realized as matroids. In our previous work we described this chamber decomposition by means of the hyperplane arrangement. It is important to note that to any chamber it corresponds the compact space, which is a smooth compact manifold for a chamber of maximal dimension. In this paper we obtain explicit description of the cohomology rings of the symplectic $T^n$ - reductions on $G_{n,2}$ for the standard moment map in terms of the chamber decomposition of $Δ_{n,2}$ and the well known results of Kirwan and Goldin.\n  We recently introduced the Hassett category whose objects are special compactifications of the space $\\mathcal{M}_{0, n}$. The initial object in this category is the Deligne-Mumford compactification $\\overline{\\mathcal{M}}_{0, n}$. In this paper we describe the cohomology rings of various compactifications for $\\mathcal{M}_{0, n}$, which correspond to the objects of the Hassett category. Our results show that even in the case $n=5$ there are objects in the Hassett category with different cohomology rings.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21679v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Malin Palö Forsström"
    ],
    "title": "Phase transitions in the charged compact abelian lattice Higgs model",
    "abstract": "We consider the (compact) abelian lattice Higgs model with charge \\( k \\geq 1 \\) and show, using charged Wilson~loop observables and charged versions of the Marcu--Fredenhagen ratio, that this model exhibits several distinct phase transitions. In particular, we show that if \\(k = 2\\), then the Marcu--Fredenhagen ratio and Wilson~loop observables together can distinguish among three distinct phases of the parameter space, and hence both can be used as order parameters for the model.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21639v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "András London"
    ],
    "title": "On the Maximum Number of Spanning Trees in $C_4$-Free Graphs",
    "abstract": "We introduce a ``Kirchhoff--Turán'' variant of the extremal $C_4$ problem: among all simple connected $n$-vertex $C_4$-free graphs $G$, maximize the number of spanning trees $τ(G)$. For the projective-plane orders $n=q^2+q+1$ we compute an exact formula for the Erdős--Rényi orthogonal polarity graph $ER_q$, namely $τ(ER_q)=n^{(n-3)/2}$, via a polarity spectral identity and Kirchhoff's matrix--tree theorem. We also give an explicit general upper bound on $\\mathrm{st}(n,C_4)$ at these $n$ using a sharp degree-sequence inequality for $τ(G)$ and a degree-balancing argument; this matches the lower bound in the leading exponential term.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21592v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Hiroki Kuroda",
      "Renato Luis Garrido Cavalcante"
    ],
    "title": "Sum-Rate Maximization via Convex Optimization Using Subgradient Projections Onto Nonlinear Spectral Radius Constraint Sets",
    "abstract": "We solve the (weighted) sum-rate maximization problem over the set of achievable rates characterized by a nonlinear spectral radius function. This set has been recently shown to be convex in some practically relevant settings in modern wireless networks, including cell-less networks. However, even under convexity, sum-rate maximization is challenging because the nonlinear spectral radius characterization of the achievable rate region is difficult to handle directly. We overcome this difficulty by exploiting subgradient projections onto the level sets of suitably reformulated spectral radius functions. Notably, the derived subgradient projection algorithm provably converges to the global optimum of the sum-rate maximization problem under the convexity condition. The efficacy of the proposed algorithm is illustrated in simulations for cell-less networks.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21570v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yi Xu",
      "Chunfeng Cui",
      "Liqun Qi"
    ],
    "title": "Narrowing the Gap: SOS Ranks of $4 \\times 3$ Biquadratic Forms and a Lower Bound of $8$",
    "abstract": "We investigate the maximum sum-of-squares (SOS) rank of biquadratic forms in the critical case of $4 \\times 3$ variables, where the general bounds are currently $7 \\leq \\mathrm{BSR}(4,3) \\leq 11$. By analyzing two important structured subclasses, we obtain exact determinations and improved upper bounds that significantly narrow this gap.\n  For simple biquadratic forms those containing only distinct terms of the type $x_i^2 y_j^2$ we prove that the maximum achievable SOS rank is exactly 7, a value attained by a form corresponding to a $C_4$-free bipartite graph with the maximum number of edges. This settles the question for simple forms.\n  For $y$-deficient biquadratic forms a class introduced here that permits cross terms among two of the three $y$-variables while the third appears only in pure square terms we prove an upper bound of $9$ by combining Calderön's theorem on $m\\times 2$ forms with the known value $\\mathrm{BSR}(4,2) = 5$.\n  Our main result is a constructive proof that $\\mathrm{BSR}(4,3) \\geq 8$. We present an explicit non-simple, non-deficient $4\\times 3$ biquadratic form and prove it requires exactly eight squares, thereby improving the general lower bound. This shows that any form achieving a rank higher than $8$ must possess a more complex algebraic structure, and it reduces the search space for determining the true value of $\\mathrm{BSR}(4,3)$. Connections to Zarankiewicz numbers, extremal graph theory, and classical results on sums of squares are highlighted throughout.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21561v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Pingchun Liu",
      "Jean-Claude Saut",
      "Shihan Sun",
      "Yuexun Wang"
    ],
    "title": "Refined wave breaking for the one-dimensional nonlinear shallow water equations",
    "abstract": "This paper aims to give a refined wave breaking description of the Cauchy problem to the one-dimensional nonlinear shallow water equations providing a sharp estimate of the lifespan of the solutions depending on the amplitude and topography parameters, under a non-cavitation condition which excludes the scenario that the solutions have compact support. We construct smooth initial data with finite $\\dot{H}^5$-norm such that the $L^\\infty$-norm of the spatial derivative of the solution blows up at one single point in finite time with a precise blowup profile.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21558v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Zhifeng Tang",
      "Nan Yang",
      "Salman Durrani",
      "Xiangyun Zhou",
      "Josep Miquel Jornet",
      "Markku Juntti"
    ],
    "title": "Impact of Pointing Errors and Correlated Wall Blockages on Practical Grid-based Indoor Terahertz Communication Systems",
    "abstract": "Terahertz (THz) communications has emerged as a promising technology for future wireless systems due to its potential to support extremely high data rates. However, severe path loss, blockage effects, and sensitivity to beam misalignment pose major challenges to reliable indoor THz communications. In this paper, we investigate the coverage probability of downlink transmission in a three-dimensional (3D) indoor THz communication system under structured access point (AP) deployments, with a focus on square and hexagonal grid topologies. A tractable analytical framework is developed to jointly account for human blockages, correlated wall blockages across APs, beam training, and residual pointing error. Numerical results demonstrate that wall blockage correlation significantly reduces the association and coverage probabilities, and its impact cannot be neglected in system performance analysis. Compared with square grid AP deployments, hexagonal grids consistently achieve higher coverage by mitigating correlated wall blockage effects and reducing the distances between user equipments (UEs) and their associated APs. Furthermore, coverage performance is shown to strongly depend on the UE location, with noticeable degradation as the UE moves away from its nearest AP. Residual pointing error is found to introduce substantial coverage loss, especially for longer links. In addition, beam training analysis reveals a non-monotonic relationship between antenna array size and training overhead, highlighting an inherent tradeoff among antenna configuration, beamwidth selection, and beam training efficiency. These findings provide useful insights into the design and deployment of practical indoor THz communication systems.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21554v1",
    "categories": [
      "math.AG",
      "math.DG"
    ],
    "authors": [
      "David Zhiyuan Bai"
    ],
    "title": "Topology of projective Tate-Shafarevich twists",
    "abstract": "A Tate-Shafarevich twist $X^φ\\to B$ of a fibration $X\\to B$ modifies it by a $1$-cocycle of flows of vector fields relative to the base, locally in the analytic topology. Saccà conjectured that the total spaces of two projective Lagrangian fibrations related by such a twist are deformation-equivalent.\n  Assuming that the class of the twist is torsion (which is often equivalent to the twist being realizable in the étale topology), we show that there is an isomorphism $H^\\ast(X;\\mathbb Q)\\cong H^\\ast(X^φ;\\mathbb Q)$ of graded vector spaces that respects (1) the Hodge structures and (2) the Hodge-Riemann pairing. Consequently, the rational Beauville-Bogomolov-Fujiki lattices of these two spaces are Hodge-similar.\n  Assuming further that $B$ is smooth, that the fibers of the fibrations are reduced outside of a locus of codimension $2$ in $B$, and that the integral homology classes of a general fiber in both spaces are primitive, we show Saccà's conjecture using a recent result of Bogomolov-Kamenova-Verbitsky. We also show that Beauville-Mukai systems for primitive classes satisfy the last condition.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22038v1",
    "categories": [
      "math.AP",
      "math.PR"
    ],
    "authors": [
      "Alexandre B. de Souza"
    ],
    "title": "Quantitative propagation of chaos for 2D stochastic vortex model on the whole space under moderate interactions",
    "abstract": "We derive the stochastic 2D vortex model on the whole Euclidean space from stochastic particle systems driven by individual and environmental noises, obtaining pathwise quantitative bounds in the sense of relative entropy. The main novelty is the application of the Donsker-Varadhan inequality in the context of moderately interacting particles to handle the nonlinearity, as well as the use of localization techniques combined with the probabilistic data setting, to derive estimates for the quadratic variation terms. Moreover, we prove the existence of a suitable solution to the aforementioned model.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21981v1",
    "categories": [
      "math.PR",
      "math-ph",
      "math.AP"
    ],
    "authors": [
      "Antonio Agresti"
    ],
    "title": "Fractal dimension of singular times for SPDEs: Energy bounds, criticality, and weak-strong uniqueness",
    "abstract": "For several physically relevant SPDEs, it is known that global weak solutions coexist with local strong ones. Typically, weak-strong uniqueness results are known, and ensure that the global and strong solutions coincide as long as the latter exist. Times at which a weak solution does not coincide with a strong one are called singular times. Determining their fractal dimension is fundamental to capturing the regularity of weak solutions.\n  We define singular times for a wide class of semilinear SPDEs. We show that sets of singular times have fractal dimension (i.e., Hausdorff and/or Minkowski) at most $ 1-\\ell\\, \\mathsf{Exc}$, where $\\ell$ and $\\mathsf{Exc}$ are the time integrability and the excess of spatial regularity compared to the critical regularity of the energy bound associated with weak solutions, respectively. Moreover, their corresponding $(1-\\ell\\,\\mathsf{Exc} )$-dimensional measure is zero. We formulate and apply our theory to quenched strong Leray-Hopf solutions of 3D Navier-Stokes equations (NSEs) with physically relevant noises, including rough Kraichnan and Lie transport. In particular, we extend the fundamental $1/2$-dimensional bound of Leray and Scheffer on singular times for 3D NSEs to the stochastic setting, and we prove new conditional results under supercritical Serrin's conditions, irrespective of the roughness of the noise. Our framework is new even in the deterministic case, and provides the first partial regularity results for weak solutions to SPDEs with multiplicative noise.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21958v1",
    "categories": [
      "math.NA",
      "astro-ph.SR"
    ],
    "authors": [
      "Pietro Benedusi",
      "Simone Riva",
      "Luca Belluzzi",
      "Stefano Serra-Capizzano"
    ],
    "title": "Analysis of eigenvalue clustering leads to optimal scaling in numerical radiative transfer",
    "abstract": "We consider a multidimensional polychromatic radiative transfer (RT) problem, accounting for scattering processes in a general form, i.e. anisotropic (dipole) scattering with partial frequency redistribution. Given a discrete ordinates discretization, we report the corresponding matrix structures, depending on model and discretization parameters. Despite the possibly dense nature of these matrices, the use of Krylov methods is effective (especially in the matrix-free context) and robust. We propose a theoretical analysis, using the spectral tools of the symbol theory, explaining why Krylov convergence is robust w.r.t. all the discretization parameters, even in the unpreconditioned case. In fact, the compactness of the continuous operators used in the modeling leads to zero-clustered dense matrix sequences plus identity, so that the clustering at the unity of the spectra is deduced. Numerical experiments confirm the theoretical results, which have a direct application, for example, in the simulation of radiative transfer in stellar atmospheres, a key problem in astrophysical research. In general, we demonstrate that optimal scaling with respect to RT discretization parameters is expected for Krylov solution strategies.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21925v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Chi Hin Chan",
      "Jun-Shuo Chen",
      "Cheng-Fang Su"
    ],
    "title": "Real analytic solutions to the divergence equation",
    "abstract": "In this paper, we develop a differential-topological method to yield explicit real analytic solutions $v$ to the divergence equation $div_{\\mathbb{R}^n} v = f$ on any annali $A(R_1 ,R_2) = \\{ x \\in \\mathbb{R}^n : R_1 < |x| < R_2\\}$, with $n \\geq 2$, and $0 < R_1 < R_2 < \\infty$. The prescribed source term $f$ is supposed to be real analytic on $\\overline{A(R_1 , R_2)} = \\{ x \\in \\mathbb{R}^n : R_1 \\leq |x| \\leq R_2\\}$ satisfying the zero integral condition on $A(R_1, R_2)$. The resulting solution $v$ is a real analytic vector field on $\\overline{A(R_1 , R_2)}$, which vanishes on $\\partial \\big( A(R_1, R_2 ) \\big )$. The method which we develop here is different from the standard Bogovski approach and the Kapitanskii-Pileckas approach. The first main step our method is a clever differential-topological argument, which we develop under the inspiration and guidance of the standard proof of the cohomological statement $H_c^n \\big ( \\mathbb{R}^n\\big ) = \\mathbb{R}$ in Spviak book A Comprehensive Introduction to Differential Geometry, Vol I. This allows us to reduce the problem to that of solving a linear algebra problem.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21924v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Armin Pirastehzad",
      "Bart Besselink"
    ],
    "title": "Comparison of Linear Systems Across Time Domains: Continuous-time vs. Discrete-time",
    "abstract": "We develop a formal framework for the behavioral comparison of linear systems across different time domains. We accomplish this by introducing the notion of system interpolation, which determines whether the input-state trajectories of a continuous-time system can be realized as piecewise polynomial interpolations of the input-state trajectories of a discrete-time system. In this context, a piecewise polynomial interpolation of a discrete-time signal is characterized as a continuous-time function that coincides with the discrete-time signal at given sampling instants and can be realized as a polynomial of a prescribed degree over intervals between these instants. By representing piecewise polynomial functions as linear combinations of shifted Legendre polynomials, we characterize system interpolation as a subspace inclusion that is completely in terms of system parameters. This therefore allows for a computationally efficient comparison of the input-state behavior of a continuous-time system with that of a discrete-time one. We then exploit this characterization to discretize a given continuous-time system into a discrete-time one. Lastly, given a control specification, we exploit system interpolation to synthesize controllers that ensure satisfaction at each given sampling instant, while they measure the extent of (possible) violation over intervals between these instants.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21907v1",
    "categories": [
      "math.AC"
    ],
    "authors": [
      "Ralf Fröberg"
    ],
    "title": "Betti numbers of skeletons of a class of squarefree monomial rings with l,inear resolution",
    "abstract": "The starting point is the class of the following simplicial complexes $Δ$ with 2-linear resolutions. The facets of $Δ$ are $F_1,\\ldots,F_n$, and we demand that for each $i$ $F_i\\cap (F_1\\cup \\cdots\\cup F_{i-1}\\cup F_{i+1}\\cdots\\cup F_n)$ be a point. We will determine the Betti numbers, and thus the projective dimension, the depth, and the regularity of the Stanley-Reisner rings of all skeletons of such complexes. It follows that we know when these complexes are Cohen-Macaulay. Also, there are two ways to determine the Hilbert series of $Δ$, giving sequences of identities for binomial coefficients.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21888v1",
    "categories": [
      "math.CA"
    ],
    "authors": [
      "Ankit Bhojak",
      "Saurabh Shrivastava"
    ],
    "title": "Endpoint Variation and jump inequalities for rough singular integrals",
    "abstract": "In this article, we prove weak type $(1,1)$ bounds for the variation and jump operators corresponding to the family of truncations of singular integrals with rough kernels. This resolves an open question raised by Jones, Seeger and Wright (Trans. Amer. Math. Soc. (2008)). Moreover, as an immediate consequence of the variational estimate, we recover the weak type $(1,1)$ boundedness of the maximal truncation operator corresponding to singular integrals with rough kernels.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21867v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Jie Han",
      "Seonghyuk Im",
      "Bin Wang",
      "Junxue Zhang"
    ],
    "title": "The perturbation threshold of degenerate graphs",
    "abstract": "We show that for any $d\\ge 2$ and $Δ>0$ there exists $η>0$ such that the following holds: Let $G$ be an $n$-vertex graph with at least $Ω(n^2)$ edges and let $H$ be an $n$-vertex $d$-degenerate graph with maximum degree at most $Δ$. Then with high probability, $G \\cup G(n, n^{-1/d - η})$ contains a copy of $H$. We also prove that the same conclusion extends to $d$-regular graphs with $d\\ge 4$ satisfying a certain edge expansion property, with the threshold improved to $n^{-2/d - η}$. Such a property is satisfied by almost all\n  $d$-regular graphs and for even $d$, by the $(d/2)$-th power of a Hamilton cycle.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21861v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Giorgio Navone",
      "Katerina Santicola",
      "Harry C. Shaw",
      "Haowen Zhang"
    ],
    "title": "Quartic del Pezzo surfaces over $\\mathbb{F}_p(t)$ without quadratic points",
    "abstract": "We construct an infinite family of quartic del Pezzo surfaces over $\\mathbb{F}_p(t)$ with no quadratic points, for all primes $p\\neq 2$. This answers a question of Colliot--Thélène, Creutz and Viray in the negative, which asks whether every quartic del Pezzo surface has quadratic points over $C_2$ fields. We exhibit a Brauer--Manin obstruction on the variety parametrising lines associated to the quartic del Pezzo surface.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21840v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Alejandra Alcantarilla Sánchez",
      "Jolijn Cottaar",
      "Tanja Lange",
      "Benne de Weger"
    ],
    "title": "Ours go to 211: Euler pseudoprimes to 47 prime bases (from Carmichael numbers)",
    "abstract": "In this paper we show that a certain subset of the Carmichael numbers contains good Euler pseudoprimes, composite numbers that for many bases survive the Solovay-Strassen primality test. We present a classification of Carmichael numbers, and use the knowledge gained from this to create a fast algorithm to compute new Euler pseudoprimes, by multiplying already found Euler pseudoprimes. We use this algorithm to find many Euler pseudoprimes that are pseudoprimes for several consecutive prime bases starting at 2, hence for all integer bases up to that number. The best Euler pseudoprime we find survives up to 211, i.e., survives the first 47 prime bases.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22210v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Gabriel Araújo",
      "Igor A. Ferra",
      "Max R. Jahnke",
      "Luis F. Ragognette"
    ],
    "title": "Real involutive systems on compact Lie groups",
    "abstract": "On a compact connected Lie group $G$, we study the global solvability and the cohomology spaces of the differential complex associated with an essentially real involutive structure that is invariant under left translations. We prove that solvability in the first degree of the complex implies solvability in all other degrees, and furnish a converse for this fact under a certain commutativity hypothesis (that always holds when $G$ is a torus). Additionally, it is proved that the solvability holds when the structure comes from the Lie algebra of a closed subgroup of $G$. We also investigate real tube structures when $G$ is the base manifold.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22181v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Peter J. Cameron"
    ],
    "title": "Around homogeneity",
    "abstract": "Forty-five years ago, a young researcher in finite permutation group theory encountered a paper by Robert Woodrow. The homogeneous triangle-free graph Woodrow described there seemed to be an infinite analogue of the Higman--Sims graph which had played an important role in the researcher's thesis. The encounter changed the course of the researcher's career. This paper is the story of that event and its aftermath.\n  The final section of the paper suggests that Fraïssé classes of rigid structures are a potentially interesting generalisation of Ramsey classes.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22173v1",
    "categories": [
      "math.OC",
      "cs.NE"
    ],
    "authors": [
      "Antonio A. Chaves",
      "Mauricio G. C. Resende",
      "Carise E. Schmidt",
      "J. Kyle Brubaker",
      "Helmut G. Katzgraber"
    ],
    "title": "Applying a Random-Key Optimizer on Mixed Integer Programs",
    "abstract": "Mixed-Integer Programs (MIPs) are NP-hard optimization models that arise in a broad range of decision-making applications, including finance, logistics, energy systems, and network design. Although modern commercial solvers have achieved remarkable progress and perform effectively on many small- and medium-sized instances, their performance often degrades when confronted with large-cale or highly constrained formulations. This paper explores the use of the Random-Key Optimizer (RKO) framework as a flexible, metaheuristic alternative for computing high-quality solutions to MIPs through the design of problem-specific decoders. The proposed approach separates the search process from feasibility enforcement by operating in a continuous random-key space while mapping candidate solutions to feasible integer solutions via efficient decoding procedures. We evaluate the methodology on two representative and structurally distinct benchmark problems: the mean-variance Markowitz portfolio optimization problem with buy-in and cardinality constraints, and the Time-Dependent Traveling Salesman Problem. For each formulation, tailored decoders are developed to reduce the effective search space, promote feasibility, and accelerate convergence. Computational experiments demonstrate that RKO consistently produces competitive, and in several cases superior, solutions compared to a state-of-the-art commercial MIP solver, both in terms of solution quality and computational time. These results highlight the potential of RKO as a scalable and versatile heuristic framework for tackling challenging large-scale MIPs.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22129v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Brandon Koprowski",
      "Joel Brewster Lewis"
    ],
    "title": "Enumeration of Nondegenerate $2 \\times (k+1) \\times k$ Hypermatrices",
    "abstract": "We consider the problem of enumerating hypermatrices of format $2 \\times (k + 1) \\times k$ over a finite field that have nonzero hyperdeterminant and whose nonzero entries are restricted to a plane partition. We conjecture an attractive product formula for the enumeration, and prove it in many cases. In general, we show that the enumeration is given (up to a power of $q - 1$) by a polynomial in $q$ with nonnegative integer coefficients, whose value at $q = 1$ enumerates a natural family of three-dimensional rook placements.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22104v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Jonas Köppl"
    ],
    "title": "On the absence of time-translation symmetry breaking in some non-reversible interacting particle systems",
    "abstract": "The conditions under which stochastic systems of infinitely many interacting particles can maintain sufficient spatial order to move coherently along a time-periodic orbit, thereby breaking the time-translation invariance of the underlying dynamical equation, have been an elusive issue. Via a free energy technique, we prove that if a non-reversible interacting particle system on $\\mathbb{Z}^d$, $d=1,2$, with strictly positive rates admits a product measure as a stationary measure, then it cannot exhibit time-periodic behaviour. This provides a first step towards a general conjecture that time-periodic behaviour cannot occur in one- and two-dimensional systems with short-range interactions and constitutes the first result for non-reversible dynamics in dimension two.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22089v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Robert Brignall",
      "Michal Opler",
      "Vincent Vatter"
    ],
    "title": "Linear clique-width and modular decomposition",
    "abstract": "A hereditary class of graphs has bounded clique-width if and only if its prime members do, but this lifting property fails for linear clique-width. We prove that a hereditary class has bounded linear clique-width if and only if its prime members do and it contains neither all quasi-threshold graphs nor all complements of quasi-threshold graphs. This generalizes a result of Brignall, Korpelainen, and Vatter, who established the result for cographs.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21972v1",
    "categories": [
      "math-ph",
      "physics.ao-ph",
      "physics.flu-dyn"
    ],
    "authors": [
      "Quanling Deng",
      "Seung-Yeal Ha",
      "Jaemoon Lee"
    ],
    "title": "Particle, kinetic and hydrodynamic models for sea ice floes. Part II: Rotating floes with nonlinear contact forces",
    "abstract": "This paper extends the multiscale modeling framework introduced in Part I (Deng and Ha, Physica D: Nonlinear Phenomena 483 (2025) 134951) for sea-ice floe dynamics with non-rotating floes to the case with rotational floes and nonlinear contact interactions. Building on the particle-kinetic-hydrodynamic hierarchy developed for non-rotating floes, we generalize the particle model to describe ice floes as rigid bodies characterized by position, linear velocity, angular velocity, size, and moment of inertia. The interaction rules now include nonlinear contact forces and torques arising from short-range compression, restitution, and tangential friction laws, together with hydrodynamic drag that couples translational and rotational motions. These particle descriptions lead to an enriched Vlasov-type kinetic equation posed on an extended phase space, whose moments yield a hydrodynamic system for mass, momentum, and angular-momentum balances. Compared with Part I, the resulting macroscopic equations feature additional stress contributions, rotational transport, and dissipative mechanisms stemming from nonlinear collisions. The proposed framework provides a more realistic description of sea-ice floe dynamics and offers a systematic pathway toward multiscale modeling of sea-ice rheology under complex environmental forcing.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21984v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Luke Jeffreys",
      "Carlos Matheus"
    ],
    "title": "Euler characteristics of $SL(2,\\mathbb{Z})$-orbit graphs of origamis",
    "abstract": "The $SL(2,\\mathbb{Z})$-orbits of primitive $n$-squared origamis can be represented by finite four-regular graphs. It is a conjecture of McMullen that the orbit graphs of such origamis in the stratum $\\mathcal{H}(2)$ form an expander family. We provide indirect evidence for this conjecture by proving that the absolute values of the Euler characteristics of the graphs in this family go to infinity with the number of squares $n$. This generalises previous work of the authors, in which we established eventual non-planarity for this family, and provides the strongest indirect evidence to date for McMullen's conjecture. We also prove that the same phenomenon holds for primitive origamis in the Prym loci of $\\mathcal{H}(4)$ and $\\mathcal{H}(6)$. Assuming conjectures of Zmiaikou and Delecroix--Lelièvre, we establish the same in $\\mathcal{H}(1,1)$ and for two families of non-Prym origamis in $\\mathcal{H}(4)$. Finally, assuming a stronger conjecture concerning orbit growth in low-complexity strata, we establish that for any family of $SL(2,\\mathbb{Z})$-orbit graphs of primitive origamis in a stratum with one or two conical singularities, the absolute values of the Euler characteristics of the graphs go to infinity with the number of squares along a density one subsequence. By relating the genus of the elliptic generator orbit graphs to the genus of the associated arithmetic Teichmüller curves, we also recover results of Mukamel and extend results of Torres-Teigel--Zachhuber establishing that the genus of these Teichmüller curves in $\\mathcal{H}(2)$ and the Prym loci of $\\mathcal{H}(4)$ and $\\mathcal{H}(6)$ also go to infinity. The proofs rely on counts of integral points on algebraic hypersurfaces using methods of Bombieri--Pila and Browning--Gorodnik, on counts of orbifold points on Teichmüller curves, and on counts of pseudo-Anosov diffeomorphisms with bounded dilatation.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21974v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Martina Iannacito",
      "Lorenzo Piccinini",
      "Valeria Simoncini"
    ],
    "title": "Subspace gradient descent method for linear tensor equations",
    "abstract": "The numerical solution of algebraic tensor equations is a largely open and challenging task. Assuming that the operator is symmetric and positive definite, we propose two new gradient-descent type methods for tensor equations that generalize the recently proposed Subspace Conjugate Gradient (SS-CG), D. Palitta et al, SIAM J. Matrix Analysis and Appl (2025). As our interest is mainly in a modest number of tensor modes, the Tucker format is used to efficiently represent low-rank tensors. Moreover, mixed-precision strategies are employed in certain subtasks to improve the memory usage, and different preconditioners are applied to enhance convergence. The potential of our strategies is illustrated by experimental results on tensor-oriented discretizations of three-dimensional partial differential equations with separable coefficients. Comparisons with the state-of-the-art Alternating Minimal Energy (AMEn) algorithm confirm the competitiveness of the proposed strategies.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21968v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Beomjong Kwak",
      "Soonsik Kwon"
    ],
    "title": "A universal bound on the blow-up rate for the focusing mass-critical nonlinear Schrödinger equation",
    "abstract": "In this paper, we investigate a universal blow-up bound for the focusing mass-critical nonlinear Schrödinger equation for general initial data in $L^2(\\mathbb R^d)$, extending previous knowledge for mass near the ground-state threshold due to Merle and Raphaël. The main results are twofold. First, we show the nonexistence of self-similar rate blow-up solutions. Second, under radial symmetry, we establish the sharp log--log correction to the self-similar bound on the blow-up rate. The proofs are based on a new analysis of general blow-up solutions, which does not rely on any ansatz or variational structure.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21932v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Swaraj Sharma Durgi",
      "Anjana A. Mahesh",
      "Anupriya Kumari",
      "Rajlaxmi Pandey",
      "B. Sundar Rajan"
    ],
    "title": "Function-Correcting Codes with Optimal Data Protection for Hamming Code Membership",
    "abstract": "This paper investigates single-error-correcting function-correcting codes (SEFCCs) for the Hamming code membership function (HCMF), which indicates whether a vector in $\\mathbb{F}_2^7$ belongs to the [7,4,3]-Hamming code. Necessary and sufficient conditions for valid parity assignments are established in terms of distance constraints between codewords and their nearest non-codewords. It is shown that the Hamming-distance-3 relations among Hamming codewords induce a bipartite graph, a fundamental geometric property that is exploited to develop a systematic SEFCC construction. By deriving a tight upper bound on the sum of pairwise distances, we prove that the proposed bipartite construction uniquely achieves the maximum sum-distance, the largest possible minimum distance of 2, and the minimum number of distance-2 codeword pairs. Consequently, for the HCMF SEFCC problem, sum-distance maximisation is not merely heuristic-it exactly enforces the optimal distance-spectrum properties relevant to error probability. Simulation results over AWGN channels with soft-decision decoding confirm that the resulting max-sum SEFCCs provide significantly improved data protection and Bit Error Rate (BER) performance compared to arbitrary valid assignments.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21913v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Raphael Leu",
      "Thomas P. Wihler"
    ],
    "title": "A fully iterative adaptive energy-based approach for monotone elliptic problems",
    "abstract": "We present a fully iterative adaptive algorithm for the numerical minimization of strongly convex energy functionals in Hilbert spaces. The proposed approach, which we first present in abstract form, generates a hierarchical sequence of adaptively refined finite-dimensional approximation spaces and employs a (nonlinear) conjugate gradient (CG) method to compute suitable approximations on each space. A core novelty of our approach is that all components of the algorithm are consistently driven by energy reduction principles rather than by classical a posteriori estimators. In particular, adaptive refinement is steered by local energy reduction indicators which aim to construct subsequent approximation spaces in a way that attains the largest potential decrease in energy. Likewise, the stopping criteria for the iterative solver are based on either relative or averaged energy reductions on each subspace. As a concrete realization, we present a concise implementation for $\\mathbb{P}_1$ finite element discretizations of second-order semilinear elliptic diffusion-reaction models, where the local indicators driving the element refinements are computed based on edge-wise energy reductions. Numerical experiments demonstrate that the resulting scheme achieves optimal convergence for various benchmark problems in two-dimensional polygonal domains.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21898v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Michal Botur",
      "David Kruml",
      "Jan Paseka"
    ],
    "title": "Quantales carrying ortholattice structure",
    "abstract": "This paper investigates the intersection of residuated structures from many-valued logic and orthomodular lattices from quantum logic. We explore whether non-Boolean structures can simultaneously satisfy residuation principles and orthocomplementation requirements. Our main contribution is a study of Girard posets with inversions, providing a characterization theorem where a unital residuated poset is Girard if and only if it admits an inversion satisfying specific adjointness conditions. We prove that any complemented lattice admitting an integral residuated structure must be Boolean, which motivates our search for orthomodular examples in the non-integral case. We answer this by demonstrating that the lattice $C(\\mathbb{R}^n)$ of closed subspaces of $n$-dimensional real coordinate space carries both an orthomodular and a commutative Girard quantale structure. This construction provides a concrete non-Boolean framework unifying quantum-logical and many-valued logical reasoning.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21870v1",
    "categories": [
      "math.RT",
      "math.GR"
    ],
    "authors": [
      "G. Lusztig"
    ],
    "title": "Strata of Weyl groups",
    "abstract": "A Weyl group W is a union of strata (certain subsets which are unions of conjugacy classes) which are the nonempty fibres of a map from W to the set of irreducible representations of W. We give an explicit description of strata in terms of a certain modified centralizer group. We also define superstrata of a connected reductive group and state a conjecture about them.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21851v1",
    "categories": [
      "math.PR",
      "math.OC"
    ],
    "authors": [
      "Matteo D'Achille",
      "Francesco Mattesini",
      "Dario Trevisan"
    ],
    "title": "Concentration for random Euclidean combinatorial optimization",
    "abstract": "We prove concentration bounds for random Euclidean combinatorial optimization problems with $p$--costs. For bipartite matching and for the (mono- and bi-partite) traveling salesperson problem in dimension $d\\ge 3$, we obtain concentration at the natural energy scale $n^{1-p/d}$ for $1\\le p<d^2/2$. Our method combines a Poincaré inequality with a robust geometric mechanism providing uniform bounds on the edges of optimizers. We also formulate a conjectural $p\\!\\to\\!q$ transfer principle for the $p$--optimal matching which, if true, would extend the concentration range to all $p\\ge 1$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22202v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Christian Bernert",
      "Jens Reinhold"
    ],
    "title": "Side lengths of cubes with vertices in $\\mathbb Z^n$",
    "abstract": "We determine the set of side lengths of $d$-dimensional cubes with vertices in $\\mathbb Z^n$ using Witt's cancellation theorem from the algebraic theory of quadratic forms.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22164v1",
    "categories": [
      "math.MG",
      "cs.CG"
    ],
    "authors": [
      "Klara Mundilova",
      "Oliver Gross"
    ],
    "title": "(Semi-)Invariant Curves from Centers of Triangle Families",
    "abstract": "We study curves obtained by tracing triangle centers within special families of triangles, focusing on centers and families that yield (semi-)invariant triangle curves, meaning that varying the initial triangle changes the loci only by an affine transformation. We identify four two-parameter families of triangle centers that are semi-invariant and determine which are invariant, in the sense that the resulting curves for different initial triangles are related by a similarity transformation. We further observe that these centers, when combined with the aliquot triangle family, yield sheared Maclaurin trisectrices, whereas the nedian triangle family yields Limaçon trisectrices.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22109v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Peter Gracar",
      "Benedikt Jahnel",
      "Lukas Lüchtrath",
      "Anh Duc Vu"
    ],
    "title": "Detection, coverage and percolation in dynamic Boolean models with random radii based on $α$-stable processes",
    "abstract": "We consider a dynamic network in continuum time and space in which nodes, with initial locations given by a Poisson point process, move according to i.i.d. isotropic $α$-stable processes. Each node is additionally equipped with an i.i.d. detection radius. Inspired by corresponding results by Peres et. al. on mobile networks based on Brownian sausages with fixed width, we investigate the tail behaviour of three stopping times: The detection time of the first discovery of a designated node, the first coverage of an entire set, and the first discovery of a node by the infinite connected component of the system. Broadly speaking, we discover that the stability index as well as the random radii manifest themselves only in constants in the otherwise exponential decay rates. The proofs rest on heat-kernel bounds for the underlying Lévy processes and a detailed multiscale analysis allowing us to control the space-time correlations of the system.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22084v1",
    "categories": [
      "math.NA",
      "math.SP"
    ],
    "authors": [
      "Francesco Hrobat",
      "Yuji Nakatsukasa"
    ],
    "title": "Matrix Perturbation Theory in the Tangent Space of Isospectral Matrices",
    "abstract": "Eigenvalue and eigenvector perturbation theory is a fundamental topic in several disciplines, including numerical linear algebra, quantum physics, and related fields. The central problem is to understand how the eigenvalues and eigenvectors of a matrix $A \\in \\mathbb{C}^{n \\times n}$ change under the addition of a perturbation matrix $E \\in \\mathbb{C}^{n \\times n}$. Much of the existing literature focuses on structured perturbations. For example, in [C.-K. Li and R.-C. Li, Linear Algebra Appl. 2005], the matrix $A$ is assumed to be Hermitian and block diagonal, while the perturbation $E$ is Hermitian and block off-diagonal. In this work, we investigate a different structured setting in which the perturbation has the commutator form $E = AB - BA$ for some matrix $B$, which we show to be a generalization of the block diagonal structure considered by Li and Li. First, we extend their main result by showing that the perturbation of the $i$-th eigenvalue of $A$, denoted by $λ_i$, is of order $\\|E\\|^2 / η_i$, where $η_i = \\min_{j \\neq i} |λ_i - λ_j|$ is the spectral gap associated with $λ_i$. Second, we provide a detailed analysis of the role played by the matrix $B$ in the perturbation of the eigenvectors. This analysis is further generalized to the case of block-diagonal matrices with multiple eigenvalues, as well as to perturbed singular values and eigenvalues of Jordan blocks.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22068v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Guillaume Bal",
      "Chushan Wang"
    ],
    "title": "Optimal error bounds on the exponential integrator for dispersive equations with highly concentrated potential",
    "abstract": "We study a one-dimensional linear dispersive equation of differential order $κ\\geq 2$ with concentrated potential of extension $\\varepsilon$ with $0 < \\varepsilon \\ll 1$, featuring a competition between weak dispersion of strength $\\varepsilon^α\\ (0 \\leq α\\leq κ)$ and localization induced by the concentrated potential. We first obtain precise regularity estimates of the exact solution in terms of $\\varepsilon$. We then apply a natural first-order exponential integrator with step size $τ$ to discretize the equation, and establish an optimal error bound of the form $O_{L^\\infty}(τ\\varepsilon^β)$ (up to logarithmic factors in $τ$ and $\\varepsilon$). Salient features of the result are: (i) error bounds are not only uniform in $\\varepsilon$ but improve as $\\varepsilon \\rightarrow 0$; and (ii) no restriction on $τ$ in terms of $\\varepsilon$. The analysis combines iterated Duhamel's expansions and a transformation that exploits cancellations in oscillatory phases that cannot be obtained directly from regularity estimates of the exact solution. We also show that other classical numerical schemes, such as Lie or centered splitting schemes and low regularity integrators, fail to display optimal rates of convergence. Extensive numerical results are presented and confirm the theoretical error estimates.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22060v1",
    "categories": [
      "math-ph",
      "hep-th",
      "nlin.SI"
    ],
    "authors": [
      "Myungbo Shim",
      "Xiaoyue Sun",
      "Hao Ellery Wang",
      "Junya Yagi"
    ],
    "title": "Solving the tetrahedron equation by Teichmüller TQFT",
    "abstract": "We propose an approach to construct three-dimensional lattice models using line defects in state integral models on shaped triangulations of 3-manifolds. The Boltzmann weights for these models satisfy a variant of the tetrahedron equation, which implies integrability under suitable assumptions on R-matrices and transfer matrices. As an explicit example, we present a solution produced by Teichmüller TQFT.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22002v1",
    "categories": [
      "math.MG"
    ],
    "authors": [
      "Kenneth J. Falconer"
    ],
    "title": "Seventy Years of Fractal Projections",
    "abstract": "Seventy years ago, John Marstrand published a paper which, among other things, relates the Hausdorff dimension of a plane set to the dimensions of its orthogonal projections onto lines. For some time this paper attracted little attention, but over the past 40 years Marstrand's projection theorems have become the prototype for many results in fractal geometry with numerous variants and applications and they continue to motivate leading research.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21895v1",
    "categories": [
      "math.CO",
      "cs.DM",
      "cs.FL",
      "math.DS",
      "math.FA"
    ],
    "authors": [
      "Julien Cassaigne",
      "Bastiàn Espinoza",
      "Michel Rigo",
      "Manon Stipulanti"
    ],
    "title": "Symbols frequencies in the Thue--Morse word in base $3/2$ and related conjectures",
    "abstract": "We study a binary Thue--Morse-type sequence arising from the base-$3/2$ expansion of integers, an archetypal automatic sequence in a rational base numeration system. Because the sequence is generated by a periodic iteration of morphisms rather than a single primitive substitution, classical Perron--Frobenius methods do not directly apply to determine symbol frequencies. We prove that both symbols ${\\tt 0},{\\tt 1}$ occur with frequency $1/2$ and we show uniform recurrence and symmetry properties of its set of factors. The proof reveals a structural bridge between combinatorics on words and harmonic analysis: the first difference sequence is shown to be Toeplitz, providing dynamical rigidity, while filtered frequencies naturally encode a dyadic structure that lifts to the compact group of $2$-adic integers. In this $2$-adic setting, desubstitution becomes a linear operator on Fourier coefficients, and a spectral contraction argument enforces uniqueness of limiting densities. Our results answer several conjectures of Dekking (on a sibling sequence) and illustrate how harmonic analysis on compact groups can be fruitfully combined with substitution dynamics.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22199v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Summer Eldridge",
      "Malin P. Forsström",
      "Benjamin Schweinhart"
    ],
    "title": "A Cellular Representation of the Potts Lattice Higgs Model",
    "abstract": "The $i$-dimensional Potts lattice Higgs model is a random assignment of spins in $\\mathbb{Z}_q$ to the $i$-dimensional cells of a cell complex induced by a Hamiltonian with a Potts interaction on the $(i+1)$-cells and an additional term playing the role of an external field. We develop a representation of this model as a pair of dependent plaquette percolations, and prove that Wilson line expectations can be expressed in terms of the probability of a topological event. As an application, we prove the existence of a phase transition for the Marcu--Fredenhagen ratio in the Potts lattice Higgs model on $\\mathbb{Z}^d$ when $i=1.$",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22192v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Osamu Fujino",
      "Eric Jovinelly",
      "Brian Lehmann",
      "Eric Riedl"
    ],
    "title": "A characterization of projective space via lengths of extremal rays",
    "abstract": "We prove a new characterization of complex projective space using lengths of extremal rays.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22166v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Katharina Hopf",
      "Bao Quoc Tang"
    ],
    "title": "Renormalised solutions to reaction-diffusion systems with interface conditions: Global existence and weak-strong uniqueness",
    "abstract": "We introduce an extension of the concept of renormalised solutions for entropy-dissipating reaction-diffusion systems due to J. Fischer (Arch. Ration. Mech. Anal. 218, 2015) to systems coupled by nonlinear interface conditions. For this notion of solution, we establish global existence as well as a weak-strong stability estimate. Our framework allows to handle entropy-dissipating interfacial transmission rates without growth restrictions, including power-law nonlinearities as arising in the thermodynamic modelling of dissipative bulk-interface systems via generalised gradient structures. Our analysis relies on suitable extensions of the species' densities across the interface as well as on a non-local truncated variant of the relative entropy.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22127v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Sumit Kumar",
      "K. Mallesham",
      "Suraj Panigrahy"
    ],
    "title": "Second moment of $\\textrm{GL(3)} \\times \\textrm{GL(2)}$ $L$--functions",
    "abstract": "For $M_1$ and $ M_2$ two distinct primes, let $ H_k^\\star(M_1M_2, ψ)$ denote the set of primitive newforms of level $M_1M_2$, weight $k\\geq 3$ and Nebentypus $ψ$ of conductor $M_1$. Let $π$ be a fixed $SL(3, \\mathbb{Z})$ Hecke cusp form. We prove a Lindelöf--consistent upper bound for the second moment\n  \\[ \\mathop{ \\sum_{\\substack{ψ(M_1) \\\\ ψ(-1)=(-1)^k }}} \\sideset{}{^h}\\sum_{f \\in H_k^{\\star}(M_1M_2,ψ)} |L(1/2, π\\times f)|^2 \\ll_{π,ε} M_1^{1+ε}\\]\n  in the range $M_2\\leq M_1^{1+ε}$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22123v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Volker Diekert",
      "Silas Natterer",
      "Alexander Thumm"
    ],
    "title": "Quadratic Equations over Graph Products and the Exponent of Periodicity",
    "abstract": "In 1977, Makanin established the decidability of equations in free monoids. A key ingredient in his proof is the exponent of periodicity: for a word $w$, it is the largest exponent $e$ such that $w$ contains a nonempty factor of the form $p^e$. Makanin showed that if a system of equations in a free monoid has a solution with sufficiently large exponent of periodicity, then it has infinitely many solutions. However, the converse -- whether the existence of infinitely many solutions implies the existence of solutions with arbitrarily large exponent of periodicity -- remains open.\n  In this paper, we investigate the analogous problem for quadratic equations in finitely generated groups. Using normal forms to define the exponent of periodicity, we identify structural conditions on groups and their normal forms that guarantee that infinite solution sets of quadratic systems have an unbounded exponent of periodicity. We prove that these conditions are preserved under graph products and, in particular, hold for all finitely generated right-angled Artin groups. In addition, we show that they also hold for finitely generated (graph products of) torsion-free nilpotent and hyperbolic groups, and we characterize the Baumslag-Solitar groups satisfying them.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21999v1",
    "categories": [
      "math.OC",
      "math.AP",
      "math.DS"
    ],
    "authors": [
      "Claudia Alvarez-Latuz",
      "Terence Bayen",
      "Jerome Coville"
    ],
    "title": "Target controllability for a minimum time problem in a trait-structured chemostat model",
    "abstract": "In this paper, we consider a minimum time control problem governed by a trait-structured chemostat model including mutation and one limiting substrate. Our first main result proves the well-posedness of the control-to-state mapping. We subsequently analyze the class of auxostat-type controls, feedback laws designed to regulate substrate concentration, and prove that the corresponding solutions converge to a stationary state of the system. These convergence results are used to show the reachability of a target set corresponding to the selection of a population with a low weighted averaged half-saturation constant. Finally, we show the existence of an optimal control for the minimum time problem associated with reaching the target set. These theoretical findings are completed by numerical simulations.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21985v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Keunyoung Jeong",
      "Junyeong Park"
    ],
    "title": "Goldfeld conjecture for non-hyperelliptic direction",
    "abstract": "Since the curve $y^2 = x^6+1$ has a large automorphism group, there exist twist families arising from non-hyperelliptic directions. In this paper, we give an explicit upper bound on the average analytic rank of such a family, assuming the generalized Riemann hypothesis for the $L$-functions. Also, we propose an analogue of the Goldfeld conjecture for the family following Katz--Sarnak philosophy.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21970v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Elliot Glazer",
      "Bokai Yao"
    ],
    "title": "Reflection Principles in ZFU",
    "abstract": "We separate the Collection Principle, the Reflection Principle, and the Partial Reflection Principle in ZF with urelements (ZFU), despite their equivalence under the Axiom of Choice. In particular, Collection and the Partial Reflection Principle are independent of one another, and Collection together with Partial Reflection does not imply the Reflection Principle. We show that Reflection and Collection are equivalent assuming either the Tail axiom or Small Violations of Choice.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21960v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Miguel Martins"
    ],
    "title": "There are only countably many locally tabular bi-intermediate logics of co-trees",
    "abstract": "A bi-Heyting algebra validates the Gödel-Dummett axiom $(p \\to q) \\lor (q \\to p)$ iff the poset of its prime filters is a disjoint union of co-trees. Bi-Heyting algebras of this kind are called bi-Gödel algebras and form a variety $\\operatorname{\\mathsf{bi-GA}}$ that algebraizes the extension $\\operatorname{\\mathsf{bi-GD}}$ of bi-intuitionistic logic axiomatized by the Gödel-Dummett axiom. In this paper we show that there are only countably many locally tabular bi-intermediate logics of co-trees, all of which are finitely axiomatizable.\n  The theory of canonical formulas of bi-Gödel algebras has shown that $\\operatorname{\\mathsf{bi-GA}}$ has continuum many subvarieties, among which the locally finite ones coincide with the subvarieties of the $\\mathsf{V}_n \\coloneqq \\{\\mathbf{A} \\in \\operatorname{\\mathsf{bi-GA}} \\colon \\mathbf{A} \\models β(\\mathfrak{C}_n)\\}$ (where $β(\\mathfrak{C}_n)$ is the subframe formula of the $n$-comb). We identify the multiset projectivity relation (a binary relation that, when defined on the set of finite multisets of a better partial order, is necessarily a better partial order) and use it to prove that every $\\mathsf{V}_n$ is a Specht variety, hence has only countably many subvarieties, all of which are finitely axiomatizable. By the algebraizability of $\\operatorname{\\mathsf{bi-GD}}$, the main result follows. We also provide an informative depiction of the lattice of varieties of bi-Gödel algebras.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21921v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Xin Liu",
      "Weinan Wang"
    ],
    "title": "2D incompressible inviscid Oldroyd-B equations: ill-posedness, long time existence, and high Weissenberg number limit",
    "abstract": "In this paper, we consider the high-Weissenberg number limit of a Voigt-regularized two-dimensional Oldroyd-B model for viscoelastic fluids. We first demonstrate that the Euler-Oldroyd-B system is both linearly and nonlinearly ill-posed in Sobolev spaces, exhibiting Hadamard instability. Then, we introduce a Voigt-type regularization on the stress tensor, which stabilizes the system. For the regularized model, we establish long time ($T \\sim \\mathcal O(\\varepsilon^{-2/3})$) well-posedness and uniform energy estimates with respect to the relaxation parameter $\\varepsilon>0$. Lastly, we prove that, as $\\varepsilon \\to 0$, the solutions converge to a solution of the 2-d incompressible Navier-Stokes equations over time intervals of size $\\mathcal O(\\varepsilon^{-2/3})$. The proof relies on a decomposition of the stress tensor, high-order energy estimates, and a detailed analysis of the nonlinear coupling terms. Our results provide a mathematical justification for the Newtonian limit of a regularized viscoelastic fluid model that is otherwise ill-posed.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21916v1",
    "categories": [
      "math.NA",
      "math.OC"
    ],
    "authors": [
      "Yunying Ke",
      "Hao Luo"
    ],
    "title": "Robust Kaczmarz methods for nearly singular linear systems",
    "abstract": "The Kaczmarz method is an efficient iterative algorithm for large-scale linear systems. However, its linear convergence rate suffers from ill-conditioned problems and is highly sensitive to the smallest nonzero singular value. In this work, we aim to extend the classical Kaczmarz to nearly singular linear systems that are row rank-deficient. We introduce a new concept of nearly singular property by treating the row space as an unstable subspace in the Grassman manifold. We then define a related important space called the approximate kernel, based on which a robust kernel-augmented Kaczmarz (KaK) is introduced via the subspace correction framework and analyzed by the well-known Xu--Zikatanov identity. To get an implementable version, we further introduce the approximate dual kernel and transform KaK into an equivalent kernel-augmented coordinate descent. Furthermore, we develop an accelerated variant and establish the improved rate of convergence matching the optimal complexity of first-order methods. Compared with existing methods, ours achieve uniform convergence rates for nearly singular linear systems, and the robustness has been confirmed by some numerical tests.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21883v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Markus Herrmann-Wicklmayr",
      "Kathrin Flaßkamp"
    ],
    "title": "Non-Extreme Individual Minima for Improved Pareto Front Sampling Efficiency and Decision-Making",
    "abstract": "In multi-objective optimization, the set of optimal trade-offs -- the Pareto front -- often contains regions that are extremely steep or flat. The Pareto optimal points in these regions are typically of limited interest for decision-making, as the marginal rate of substitution is extreme: a marginal improvement in one objective necessitates a significant deterioration in at least one other objective. These unfavorable trade-offs frequently occur near the individual minima, where single objectives attain their minimum values without considering the remaining criteria.\n  To address this, we propose the concept of \\emph{non-extreme individual minima} that relies on the notion of $L$-practical proper efficiency. These points can serve as a less sensitive replacement for \\emph{standard} individual minima in subsequent related methods. Specifically, they allow for a more practical restriction of the Pareto front sampling within a refined utopia-nadir hyperbox, provide a meaningful basis for image space normalization, and can enhance decision-making techniques, such as knee-point methods, by focusing on regions with acceptable trade-offs.\n  We provide a computationally efficient algorithm to determine these non-extreme individual minima by solving at most $2n_J$ standard weighted-sum scalarizations, where $n_J$ is the number of objectives. To ensure robustness across varying objective scales, the method incorporates an integrated image space normalization strategy. Numerical examples, specifically a convex academic case and a non-convex real-world application, demonstrate that the method successfully excludes practically irrelevant regions in the image space.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22189v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.RT"
    ],
    "authors": [
      "Ruishen Zhao"
    ],
    "title": "Perfectoid unitary Shimura varieties and $p$-adic Eichler-Shimura map I",
    "abstract": "We investigate $p$-adic automorphic forms on unitary groups through the geometry of infinite-level unitary Shimura varieties and the Hodge-Tate period map. We first develop a perfectoid construction of overconvergent automorphic forms. Building on this, we establish a canonical overconvergent Eichler-Shimura map linking overconvergent cohomology to these $p$-adic automorphic forms. This map induces a comparison between the corresponding coherent sheaves on the eigenvariety, with applications to the study of its geometry and to $p$-adic $L$-functions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22184v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Kohei Noda"
    ],
    "title": "Two-dimensional Coulomb gases with multiple outposts",
    "abstract": "We study two-dimensional Coulomb gases in the presence of $m\\in\\mathbb{N}_{>0}$ outposts. An outpost is a connected component of the coincidence set that lies outside the droplet.\n  The case $m=1$ was previously investigated by Ameur, Charlier, and Cronvall. They showed that, as the total number of particles in the Coulomb gas tends to infinity, the number of particles accumulating near the outpost remains of order one and converges in distribution to the Heine distribution.\n  In this work, we extend this analysis to the case of an arbitrary but fixed number $m$ of outposts. We prove that the joint distribution of the numbers of particles near the outposts converges to a multidimensional Heine distribution. Our results reveal a interesting phenomenon: although the outposts are geometrically disconnected, the particle count near each outpost is strongly correlated with the particle counts near all other outposts, not only the nearest ones (provided the outposts are not separated by a component of the droplet).",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22178v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Céline Cunen",
      "Nils Lid Hjort",
      "Tore Schweder"
    ],
    "title": "Confidence in confidence distributions!",
    "abstract": "The recent article `Satellite conjunction analysis and the false confidence theorem' (Balch, Martin, and Ferson, 2019, Proceedings of the Royal Society, Series A) points to certain difficulties with Bayesian analysis when used for models for satellite conjuntion and ensuing operative decisions. Here we supplement these previous analyses and findings with further insights, uncovering what we perceive of as being the crucial points, explained in a prototype setup where exact analysis is attainable. We also show that a different and frequentist method, involving confidence distributions, is free of the false confidence syndrome.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22167v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Aishik Chattopadhyay"
    ],
    "title": "Estimates for Character Sums in Finite Fields, $\\mathbb{F}_{p^n}$",
    "abstract": "We improve upon our previous result \\cite{Ch} on short character sums over finite fields $\\mathbb{F}_{p^n}$. Specifically, we show that for intervals $I_1,I_2,\\ldots,I_k$ of lengths of at least $p^{n/4k+\\varepsilon}$ and $k\\leq n$, the sum \\[ \\sum_{x_0\\in I_0,\\; x_1\\in I_1,\\;\\ldots,\\; x_{k}\\in I_{k}} χ\\!\\bigl(x_1ω_1 + x_2ω_2 + \\cdots + x_{k}ω_{k}\\bigr) \\] exhibits nontrivial cancellation, where $\\{ω_1,\\ldots,ω_n\\}$ is any basis of $\\mathbb{F}_{p^n}$ over $\\mathbb{F}_p$.\n  More generally, let $|I_1|\\le |I_2|\\le \\cdots \\le |I_n| \\le \\sqrt{p/2}$ and fix $\\varepsilon>0$ such that $ |I_1|\\cdots|I_n| \\ge p^{\\,n(1/4+\\varepsilon)}. $ Then, for any nontrivial multiplicative character $χ$ of $\\mathbb{F}_{p^n}$, we have \\[ \\Biggl|\\sum_{x_1\\in I_1,\\;\\ldots,\\;x_n\\in I_n} χ\\!\\Bigl(\\sum_{i=1}^{n} x_i ω_i\\Bigr)\\Biggr| \\;\\ll\\; |I_1|\\cdots|I_n|\\, p^{-δ(\\varepsilon)}, \\] where \\[ δ(\\varepsilon) = \\varepsilon^2 \\frac{1-\\frac{1}{2n}}{\\left(1+\\frac{1}{4n}\\right)\\left(2-\\frac{1}{2n}\\right)}. \\]\n  The proof relies on Minkowski's second theorem, which is applied to estimate the multiplicative energy of sets arising from products of intervals.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22147v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "M. Archita",
      "Karim Johannes Becher"
    ],
    "title": "Similitudes over fields with I^4=0",
    "abstract": "This article studies the set of R-equivalence classes of the group of proper projective similitudes of an algebra with involution of the first kind. The main results concern base fields of characteristic different from 2 over which every 9-dimensional quadratic form has a nontrivial zero. This includes function fields of p-adic curves and extensions of transcendence degree 3 of C. Main results of [28] and [29] are extended by relaxing the condition on the base field as well as on the Clifford invariant for orthogonal involutions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22135v1",
    "categories": [
      "math.LO",
      "cs.LO"
    ],
    "authors": [
      "Danel Ahman",
      "Andrej Bauer"
    ],
    "title": "Sheaves as oracle computations",
    "abstract": "In type theory, an oracle may be specified abstractly by a predicate whose domain is the type of queries asked of the oracle, and whose proofs are the oracle answers. Such a specification induces an oracle modality that captures a computational intuition about oracles: at each step of reasoning we either know the result, or we ask the oracle a query and proceed upon receiving an answer. We characterize an oracle modality as the least one forcing the given predicate. We establish an adjoint retraction between modalities and propositional containers, from which it follows that every modality is an oracle modality. The left adjoint maps sums to suprema, which makes suprema of modalities easy to compute when they are given in terms of oracle modalities. We also study sheaves for oracle modalities. We describe sheafification in terms of a quotient-inductive type of computation trees, and describe sheaves as algebras for the corresponding monad. We also introduce equifoliate trees, an intensional notion of oracle computation given by a (non-propositional) container. Equifoliate trees descend to sheaves, and lift from sheaves in case the container is projective. As an application, we give a concrete description of all Lawvere-Tierney topologies in a realizability topos, closely related to a game-theoretic characterization by Takayuki Kihara.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22097v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yacine Mokhtari",
      "Christina Frederick",
      "Yunan Yang",
      "Bjorn Engquist"
    ],
    "title": "Velocity Reconstruction from Flow-Induced Magnetic Fields",
    "abstract": "We study the inverse problem of reconstructing an incompressible velocity field $\\boldsymbol{v}$ from observations of the induced magnetic field $\\boldsymbol{b}$.\n  In the presence of a strong, constant background field $\\mathbf{F}$, the evolution of the magnetic perturbation $\\boldsymbol{b}$ is governed by the linearized induction equation. We analyze the system on both the entire space $Ω= \\mathbb{R}^d$ and a periodic domain $Ω= \\prod_{i=1}^d [0, L_i)$, which models a homogeneous medium with side lengths $L_i > 0$. We analyze this problem by decomposing it into the injectivity of a parabolic forward map and the solvability of a divergence-free transport sub-problem. On the whole space $\\mathbb{R}^d$, we show that the transport sub-problem is well-posed when data is prescribed on a non-characteristic hypersurface transverse to $\\mathbf{F}$. On the torus, we establish a sharp uniqueness criterion based on the rational dependence of the ratios $\\{F_i/L_i\\}_{i=1}^d$ between the background-field components and the corresponding domain periods. Furthermore, we show that for the reconstructed velocity to belong to $L^2$, a sufficient condition is that the background field must satisfy a Diophantine condition. The proof combines injectivity of the parabolic forward map with uniqueness for a steady transport equation along $\\mathbf{F}$.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22042v1",
    "categories": [
      "cs.IT",
      "math.CO"
    ],
    "authors": [
      "Joshua Brakensiek",
      "Venkatesan Guruswami"
    ],
    "title": "Maximal Recoverability: A Nexus of Coding Theory",
    "abstract": "In the modern era of large-scale computing systems, a crucial use of error correcting codes is to judiciously introduce redundancy to ensure recoverability from failure. To get the most out of every byte, practitioners and theorists have introduced the framework of maximal recoverability (MR) to study optimal error-correcting codes in various architectures. In this survey, we dive into the study of two families of MR codes: MR locally recoverable codes (LRCs) (also known as partial MDS codes) and grid codes (GCs).\n  For each of these two families of codes, we discuss the primary recoverability guarantees as well as what is known concerning optimal constructions. Along the way, we discuss many surprising connections between MR codes and broader questions in computer science and mathematics. For MR LRCs, the use of skew polynomial codes has unified many previous constructions. For MR GCs, the theory of higher order MDS codes shows that MR GCs can be used to construct optimal list-decodable codes. Furthermore, the optimally recoverable patterns of MR GCs have close ties to long-standing problems on the structural rigidity of graphs.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22027v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Henri Berestycki",
      "Antoine Mellet"
    ],
    "title": "Range expansion by growth and congestion",
    "abstract": "We introduce a nonlinear and nonlocal model that describes the range expansion of a population resulting from growth and competition for space. This type of phenomenon underlies the expansion of colonies of immotile cells which motivated this work; Similar mechanisms are at play in urban sprawling which we briefly discuss as well. We rigorously derive a singular limit of this model corresponding to a regime where dispersal occurs only from saturated areas. The limiting model, which has the structure of an obstacle free boundary problem in time, provides an effective approach to the description of the range expansion of a population as a result of growth, saturation and dispersion. We then establish the main mathematical properties of this singular problem. In particular, we characterize the evolution of a free boundary that delimits the saturated area. We identify traveling wave solutions and characterize the asymptotic speed of spreading of compactly supported solutions.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21982v1",
    "categories": [
      "math.AG",
      "math.CO"
    ],
    "authors": [
      "Piotr Pokora"
    ],
    "title": "On combinatorial bounds for the total Tjurina numbers of certain curves and surfaces with isolated singularities",
    "abstract": "We investigate combinatorial bounds for the total Tjurina numbers of plane curve arrangements. Focusing on arrangements of lines and conics in $\\mathbb{P}^2$ that admit only ordinary quasi-homogeneous singularities, we derive new structural inequalities governing the distribution of multiple intersection points. As a consequence, we establish sharp lower bounds for the total Tjurina numbers of free line arrangements with bounded maximal multiplicity and, more generally, for free conic-line arrangements. In particular, we show that for a free arrangement of $d$ lines and $k$ conics, the total Tjurina number grows at least quadratically in $d$ and $k$, and we demonstrate that this bound is sharp. As an application, we construct a particular family of surfaces in $\\mathbb{P}^3$ with only isolated singularities having arbitrarily large total Tjurina numbers. This provides new lower bounds for the total Tjurina numbers of certain hypersurfaces that are independent of detailed homological data.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21938v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Andrea Braides",
      "Irene Fonseca"
    ],
    "title": "Asymptotic analysis of higher-order perturbations of the Perona--Malik functional",
    "abstract": "The Gamma-limit of higher-order singular perturbations of the Perona-Malik functional is analyzed. The energies considered combine the critically scaled logarithmic term with a k-th order regularization designed to balance bulk and interfacial effects. A compactness result is obtained, and the Gamma-limit is identified as a free-discontinuity functional on SBV, given by the sum of the Dirichlet energy and a surface term proportional to the jump amplitude to the power 1/k. The surface density is characterized through a one-dimensional optimal-profile problem with homogeneous boundary conditions on derivatives up to order k-1. As a consequence, the limit of the same energies at a different scaling is determined. That scaling had been previously studied in the second-order case to address the so-called staircasing phenomenon.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21911v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Gino I. Montecinos",
      "Eleuterio F. Toro",
      "Lucas O. Müller"
    ],
    "title": "A generalized Riemann problem-based compact reconstruction method for finite volume schemes",
    "abstract": "We present a Generalized Riemann Problem-based reconstruction method (GRPrec) for high-order finite volume schemes applied to hyperbolic partial differential equations. The method constructs spatial polynomials using cell averages at the current time level and GRP solution data from the previous time level. The resulting GRPrec stencil is as compact as that of discontinuous Galerkin (DG) schemes but unlike DG, our finite volume schemes obey a generous CFL stability condition that is independent of the order of accuracy. We assess the method's performance through test problems for smooth and discontinuous solutions of the linear advection equation and the Euler equations of gas dynamics in one space dimension. Results are compared against exact solutions and against numerical results from well-known spatial reconstruction finite volume and DG schemes, with all methods implemented in the fully discrete ADER framework. The performance of GRPrec is very promising, especially in terms of efficiency, that is error against CPU cost.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21902v1",
    "categories": [
      "math.CO",
      "math.RT"
    ],
    "authors": [
      "Vu Tung Lam Dinh",
      "Ivan Chi-Ho Ip"
    ],
    "title": "On the expansion formulas of cluster varieties from surfaces and their combinatorial properties",
    "abstract": "This paper explores the cluster algebra structure of the moduli space $\\mathscr{A}_{\\mathrm{SL}_{n+1},\\mathbb{S}}$ of twisted $\\mathrm{SL}_{n+1}$-local systems on a surface. We derive general recurrence relations for cluster variables arising from flips of a triangulation, corresponding to specific sequences of mutations. Our approach is grounded in a detailed combinatorial analysis over the standard $n$-triangulated $m$-gon (with explicit calculations for $n=1,2$). As a generalization, the non-simply-laced $G_2$ type is also considered. We prove the \"well-triangulated\" property for cluster mutations under flips, which provides a combinatorial framework for understanding the stability and transformation rules of these cluster algebra structures, and compute the monomial counts for the cluster expansion formula.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21894v1",
    "categories": [
      "math.NT",
      "math.AG",
      "math.KT"
    ],
    "authors": [
      "Tess Bouis",
      "Quentin Gazda"
    ],
    "title": "The cyclosyntomic regulator of a number field",
    "abstract": "We construct a q-deformation of the p-adic regulator of a number field, called the cyclosyntomic regulator, building on the Habiro ring of Garoufalidis-Scholze-Wheeler-Zagier. The key new ingredient in our construction is a refinement of Sulyma's norm maps in prismatic cohomology, which interpolate between classical powers and Frobenius maps at various prime numbers p. Furthermore, we compute the values of the cyclosyntomic regulator at units of the form $1-ζ$, where $ζ$ is a root of unity.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21878v1",
    "categories": [
      "math.NT",
      "math.AG"
    ],
    "authors": [
      "Beat Zurbuchen"
    ],
    "title": "Equidistribution for Tannakian monodromy groups",
    "abstract": "We prove that a perverse sheaf on a connected commutatitve algebraic group over a finite is generically unramified. This implies an equidistribution theorem for Tannakian monodromy groups in previously unavailable generality. We also prove a stratification theorem for exponential sums in families indexed by a scheme and the characters of a connected commutative algebraic group. Our method is based on Tannakian categories introduced by Gabber and Loeser. This method naturally yields fiber functors. We also prove vanishing theorems over a connected commutative algebraic group, classify the negligible sheaves, and prove relative weak propagation theorems for tori.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21859v1",
    "categories": [
      "math.CO",
      "cs.CC",
      "cs.DM",
      "cs.DS"
    ],
    "authors": [
      "Tala Eagling-Vose",
      "David C. Kutner",
      "Felicia Lucke",
      "Dániel Marx",
      "Barnaby Martin",
      "Daniël Paulusma",
      "Erik Jan van Leeuwen"
    ],
    "title": "Steiner Forest for $H$-Subgraph-Free Graphs",
    "abstract": "Our main result is a full classification, for every connected graph $H$, of the computational complexity of Steiner Forest on $H$-subgraph-free graphs. To obtain this dichotomy, we establish the following new algorithmic, hardness, and combinatorial results:\n  Algorithms: We identify two new classes of graph-theoretical structures that make it possible to solve Steiner Forest in polynomial time. Roughly speaking, our algorithms handle the following cases: (1) a set $X$ of vertices of bounded size that are pairwise connected by subgraphs of treewidth $2$ or bounded size, possibly together with an independent set of arbitrary size that is connected to $X$ in an arbitrary way; (2) a set $X$ of vertices of arbitrary size that are pairwise connected in a cyclic manner by subgraphs of treewidth $2$ or bounded size.\n  Hardness results: We show that Steiner Forest remains NP-complete for graphs with 2-deletion set number $3$. (The $c$-deletion set number is the size of a smallest cutset $S$ such that every component of $G-S$ has at most $c$ vertices.)\n  Combinatorial results: To establish the dichotomy, we perform a delicate graph-theoretic analysis showing that if $H$ is a path or a subdivided claw, then excluding $H$ as a subgraph either yields one of the two algorithmically favourable structures described above, or yields a graph class for which NP-completeness of Steiner Forest follows from either our new hardness result or a previously known one.\n  Along the way to classifying the hardness for excluded subgraphs, we establish a dichotomy for graphs with $c$-deletion set number at most $k$. Specifically, our results together with pre-existing ones show that Steiner Forest is polynomial-time solvable if (1) $c=1$ and $k\\geq 0$, or (2) $c=2$ and $k\\leq 2$, or (3) $c\\geq 3$ and $k=1$, and is NP-complete otherwise.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.21842v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Surojit Ghosh"
    ],
    "title": "Bredon cohomology methods in mass partition problems on spheres",
    "abstract": "We apply $\\mathrm{RO}(G)$-graded Bredon cohomology to mass assignment problems, extending classical mass partition methods. Within this framework, we reprove a recent result of Lessure and Soberón: for $n+1$ mass assignments on $k$-dimensional affine subspaces of $\\mathbb{R}^n$, there exists a $k$-subspace containing a sphere that simultaneously bisects all measures. This approach highlights a flexible topological framework with potential for broader applications.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22191v1",
    "categories": [
      "math.AC",
      "math.AG"
    ],
    "authors": [
      "Manav Batavia"
    ],
    "title": "Vanishing of local cohomology in unramified mixed characteristic",
    "abstract": "Given an ideal $I$ in a regular local ring $A$, the cohomological dimension of $I$ in $A$ is the index of the highest non-vanishing local cohomology of $A$ supported at $I$. Determining effective upper bounds on the cohomological dimension in terms of topological invariants of $\\text{Spec}(A/I)$ is a central problem in commutative algebra. In equal characteristic, Faltings proved in 1980 a general bound on the cohomological dimension of an ideal in terms of its big height. In this article, we extend Faltings' result to the unramified mixed characteristic setting and show that the resulting bound is sharp.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22162v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Ana María Botero",
      "José Ignacio Burgos Gil",
      "David Holmes",
      "Robin de Jong"
    ],
    "title": "Pure extension of the theta divisor over the moduli space of abelian varieties",
    "abstract": "A theta divisor on the universal principally polarised abelian variety can be extended to a compactification either by taking the Zariski closure, or by taking the unique extension which is pure of weight 2. For the latter, following ideas of Yuan and Zhang, we need to pass to the category of adelic- or b-divisors. We show that the two choices of extension differ by a tropicalisation of the Riemann theta function. We prove an extension of Moret-Bailly's ''key formula'' that features the pure weight 2 extension of the theta divisor, and discuss various arithmetic applications, including a ''universal'' formula for the Néron--Tate height of a point. A key technical input is the systematic use of the theory of logarithmic abelian varieties due to Kajiwara, Kato, and Nakayama.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22081v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Kangkang Xu",
      "Yuan-Hsun Lo",
      "Tsai-Lien Wong",
      "Yijin Zhang",
      "Kenneth W. Shum"
    ],
    "title": "Multichannel Conflict-Avoiding Codes for Expanded Scenarios",
    "abstract": "A conflict-avoiding code (CAC) of length L and weight w is used for deterministic multiple-access without feedback. When the number of simultaneous active users is less than or equal to w, such a code is able to provide a hard guarantee that each active user has a successful transmission within every consecutive L time slots. Recently, CACs were extended to multichannel CAcs (MC-CACs) over M orthogonal channels with the aim of increasing the number of potential users that can be supported. While most existing results on MC-CAC are derived under the assumption that M is not less than w, this paper focuses on the case that M is less than w, which is more relevant to practical application scenarios. In this paper, we first introduce the concept of exceptional codewords in MC-CACs. By employing some techniques from additive combinatorics, we derive a series of optimal MC-CACs. Along the way, several previously known optimal CAC results are generalized. Finally, our results extend naturally to AM-OPPTS MC-CACs and mixed-weight MC-CACs, two classes of relevant codes.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22080v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Marco Damele Vicent Pérez Calabuig"
    ],
    "title": "On a Cauchy theorem for finite skew braces",
    "abstract": "One of the major problems in the structural theory of skew braces consists in the classification of skew braces of finite order up to isomorphism. In this light, the open question of the existence of a Cauchy theorem for finite skew braces is of great interest. We prove a positive answer for the classes of finite two-sided skew braces and bi-skew braces. Consequences and related structural results are also outlined.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22058v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Bin Tian",
      "Kai Pan",
      "Chung-Lun Li"
    ],
    "title": "A Polyhedral Study on Unit Commitment with a Single Type of Binary Variables",
    "abstract": "Efficient power production scheduling is a crucial concern for power system operators aiming to minimize operational costs. Previous mixed-integer linear programming formulations for unit commitment (UC) problems have primarily used two or three types of binary variables. The investigation of strong formulations with a single type of binary variables has been limited, as it is believed to be challenging to derive strong valid inequalities using fewer binary variables, and the reduction of the number of binary variables is often accompanied by a compromise in tightness. To address these issues, this paper considers a formulation for unit commitment using a single type of binary variables and develops strong valid inequality families to enhance the tightness of the formulation. Conditions under which these strong valid inequalities serve as facet-defining inequalities for the single-generator UC polytope are provided. For those large-size valid inequality families, the existence of efficient separation algorithms for determining the most violated inequalities is also discussed. The effectiveness of the proposed single-binary formulation and strong valid inequalities is demonstrated through computational experiments on network-constrained UC problems. The results indicate that the strong valid inequalities presented in this paper are effective in solving UC problems and can also be applied to UC formulations that contain more than one type of binary variables.",
    "date": "02-26"
  },
  {
    "link": "https://arxiv.org/pdf/2602.22047v1",
    "categories": [
      "math.OC",
      "math.ST"
    ],
    "authors": [
      "Johannes Milz",
      "Alexander Shapiro",
      "Enlu Zhou"
    ],
    "title": "Stochastic Optimal Control with Side Information and Bayesian Learning",
    "abstract": "We study infinite-horizon stochastic optimal control problems with observable side information: a Markov chain that modulates an unknown context-conditional randomness distribution. Since this distribution is unknown, we propose a Bayesian reformulation based on a parametric density model and posterior predictive dynamics, which yields a Bayesian Bellman equation. We prove posterior consistency under Markov samples and, under correct specification and identifiability, uniform convergence of the Bayesian value function. Finally, we establish Bernstein--von Mises-type asymptotic normality for the data-driven contextual optimal value.",
    "date": "02-26"
  }
]