[
  {
    "link": "https://arxiv.org/pdf/2602.12438v1",
    "categories": [
      "math.DG",
      "cs.LG",
      "hep-th"
    ],
    "authors": [
      "Elli Heyes",
      "Edward Hirst",
      "Henrique N. Sá Earp",
      "Tomás S. R. Silva"
    ],
    "title": "Neural and numerical methods for $\\mathrm{G}_2$-structures on contact Calabi-Yau 7-manifolds",
    "abstract": "A numerical framework for approximating $\\mathrm{G}_2$-structure 3-forms on contact Calabi-Yau manifolds is presented. The approach proceeds in three stages: first, existing neural network models are employed to compute an approximate Ricci-flat metric on a Calabi-Yau threefold. Second, using this metric and the explicit construction of a $\\mathrm{G}_2$-structure on the associated 7-dimensional Calabi-Yau link in the 9-sphere, numerical approximations of the 3-form are generated on a large set of sampled points. Finally, a dedicated neural architecture is trained to learn the 3-form and its induced Riemannian metric directly from data, validating the learned structure and its torsion via a numerical implementation of the exterior derivative, which may be of independent interest.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12400v1",
    "categories": [
      "math.DS",
      "math.PR"
    ],
    "authors": [
      "Diego Marcondes",
      "Sandro Vaienti"
    ],
    "title": "Metastability of random maps: a resolvent approach",
    "abstract": "We present a general framework to study the metastability of random perturbations of dynamical systems. It integrates techniques from the theory of Markov processes, in particular the resolvent approach to metastability, with the spectral analysis of transfer operators associated to the dynamics. The proposed framework is applied to study the metastability of one-dimensional dynamical systems generated by a map randomly perturbed by sub-Gaussian noise.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12369v1",
    "categories": [
      "math.PR",
      "math-ph"
    ],
    "authors": [
      "Farrukh Mukhamedov",
      "Muzaffar Rahmatullaev",
      "Obid Karshiboev"
    ],
    "title": "Splitting Gibbs Measures for a Periodic Triple Mixed-Spin Ising Model on a Cayley Tree",
    "abstract": "We consider an Ising model on the Cayley tree $Γ_k$ of arbitrary order $k\\ge1$ with three spin species of values $(\\tfrac12,1,\\tfrac32)$ distributed deterministically with period three along the generations. Within the framework of splitting Gibbs measures, we derive the exact boundary-law compatibility equations and characterize translation-invariant splitting Gibbs measures (TISGMs) via a finite system of algebraic relations. In the ferromagnetic regime $J>0$, writing $θ=\\exp(βJ/2)$, we further reduce the translation-invariant problem to a one-dimensional scalar fixed-point equation $x=f(x,θ,k)$ for a rational map $f$. We show that $f$ is strictly increasing and obtain an explicit sufficient condition for phase coexistence: if $s_k(θ)=f'(1,θ,k)-1>0$, then $x=f(x,θ,k)$ admits at least three distinct positive solutions, yielding at least three distinct TISGMs and hence a phase transition driven by the periodic inhomogeneity of the spin structure.\n  For the binary tree $k=2$ we exploit attractiveness to construct plus and minus Gibbs measures as weak limits with extremal boundary conditions, prove that they are TISGMs corresponding to the minimal and maximal fixed points of $f(\\cdot,θ,2)$, and show that they are the minimal and maximal Gibbs measures in the natural stochastic order. Finally, we construct the tree-indexed Markov chain associated with a TISGM and apply the Kesten--Stigum criterion to the disordered TISGM, identifying nonempty parameter regions where this measure is non-extremal and reconstruction occurs.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12698v1",
    "categories": [
      "math.OC",
      "math.AP"
    ],
    "authors": [
      "Hoai-Minh Nguyen"
    ],
    "title": "Optimal bounds for the cost of fast controls of a KdV system",
    "abstract": "We study the cost of fast controls for a linearized KdV system and a nonlinear KdV system locally, using right Neumann boundary control for non-critical lengths. Since the operator associated with the linearized system is neither self-adjoint nor skew-adjoint, its (known) spectral properties are not directly amenable to the moment method, leaving optimal cost bounds an open problem. We address this difficulty by shifting attention to a related KdV system and deriving the optimal bounds from the new one.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12654v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Ge Lin",
      "Changjiang Bu"
    ],
    "title": "All eigenvalues of the blowup of a graph",
    "abstract": "The $s$-blowup of a graph ($s\\geq2$) is the $2s$-uniform hypergraph obtained by replacing each vertex with a set of size $s$ and preserving the adjacency relation. In this paper, we define $2s$-weighted graphs and use them to give all eigenvalues of the $s$-blowup of a graph.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12576v1",
    "categories": [
      "math.DG",
      "hep-lat",
      "hep-th",
      "math.GT",
      "math.KT"
    ],
    "authors": [
      "Shoto Aoki",
      "Hajime Fujita",
      "Hidenori Fukaya",
      "Mikio Furuta",
      "Shinichiroh Matsuo",
      "Tetsuya Onogi",
      "Satoshi Yamaguchi"
    ],
    "title": "Capturing the Atiyah-Patodi-Singer index from the lattice",
    "abstract": "Using the Wilson Dirac operator in lattice gauge theory with a domain-wall mass term, we construct a discretization of the Atiyah-Patodi-Singer index for domains with compact boundary in a flat torus. We prove that, for sufficiently small lattice spacings, this discretization correctly captures the continuum Atiyah-Patodi-Singer index.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12568v1",
    "categories": [
      "math.ST",
      "cs.SI",
      "math.PR"
    ],
    "authors": [
      "Anirudh Sridhar",
      "Arnob Ghosh"
    ],
    "title": "Finding Super-spreaders in SIS Epidemics",
    "abstract": "In network epidemic models, controlling the spread of a disease often requires targeted interventions such as vaccinating high-risk individuals based on network structure. However, typical approaches assume complete knowledge of the underlying contact network, which is often unavailable. While network structure can be learned from observed epidemic dynamics, existing methods require long observation windows that may delay critical interventions.\n  In this work, we show that full network reconstruction may not be necessary: control-relevant features, such as high-degree vertices (super-spreaders), can be learned far more efficiently than the complete structure. Specifically, we develop an algorithm to identify such vertices from the dynamics of a Susceptible-Infected-Susceptible (SIS) process. We prove that in an $n$-vertex graph, vertices of degree at least $n^α$ can be identified over an observation window of size $Ω(1/α)$, for any $α\\in (0,1)$. In contrast, existing methods for exact network reconstruction requires an observation window that grows linearly with $n$. Simulations demonstrate that our approach accurately identifies super-spreaders and enables effective epidemic control.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12516v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Chengyang Lu",
      "Yanyong Hong"
    ],
    "title": "Jacobi algebras and Jacobi Novikov-Poisson algebras",
    "abstract": "In this paper, we introduce the notion of Jacobi Novikov-Poisson algebras and demonstrate that their affinization yields Jacobi algebras. We note that every unital differential Novikov-Poisson algebra is also a Jacobi Novikov-Poisson algebra. Additionally, any Jacobi Novikov-Poisson algebra gives rise to a Jacobi algebra, either by taking the commutator bracket of its underlying Novikov algebra or by using a derivation. We provide classifications of low-dimensional Jacobi Novikov-Poisson algebras including those of dimensions 2 and 3 over $\\mathbb{C}$ up to isomorphism and show that the tensor product of two such algebras remains a Jacobi Novikov-Poisson algebra. Several further constructions of Jacobi Novikov-Poisson algebras from existing ones are also presented. The notion of Frobenius Jacobi Novikov-Poisson algebras is introduced, and several equivalent characterizations are established in terms of quadratic structures and integrals. Classifications of quadratic Jacobi Novikov-Poisson algebras of dimensions 2 and 3 over $\\mathbb{C}$ are given. Finally, we provide an explicit construction of Frobenius Jacobi algebras using finite-dimensional quadratic Jacobi Novikov-Poisson algebras and finite-dimensional quadratic right Jacobi Novikov-Poisson algebras.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12513v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Jiashuo Jiang",
      "Mengxiao Zhang"
    ],
    "title": "An LP-Based Approach for Bilinear Saddle Point Problem with Instance-dependent Guarantee and Noisy Feedback",
    "abstract": "In this work, we study the sample complexity of obtaining a Nash equilibrium (NE) estimate in two-player zero-sum matrix games with noisy feedback. Specifically, we propose a novel algorithm that repeatedly solves linear programs (LPs) to obtain an NE estimate with bias at most $\\varepsilon$ with a sample complexity of $O\\left(\\frac{m_1 m_2}{\\varepsilon\\min\\{δ^2,σ_0^2,σ^3\\}} \\log\\frac{m_1 m_2}{\\varepsilon}\\right)$ for general $m_1 \\times m_2$ game matrices, where $σ$, $σ_0$, $δ$ are some problem-dependent constants. To our knowledge, this is the first instance-dependent sample complexity bound for finding an NE estimate with $\\varepsilon$ bias in general-dimension matrix games with noisy feedback and potentially non-unique equilibria. Our algorithm builds on recent advances in online resource allocation and operates in two stages: (1) identifying the support set of an NE, and (2) computing the unique NE restricted to this support. Both stages rely on a careful analysis of LP solutions derived from noisy samples.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12807v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Alessandra Cutrì",
      "Paola Mannucci",
      "Claudio Marchi",
      "Nicoletta Tchou"
    ],
    "title": "Constrained Mean Field Games with Grushin type dynamics",
    "abstract": "This paper is devoted to a class of finite horizon deterministic mean field games with Grushin type dynamics, state constraints and nonlocal coupling. First, we consider the optimal control problem that each agent aims to solve when the evolution of the population is given and we establish some properties as: the existence of an optimal trajectory for any starting point $(x,t)$, the closed graph property for the multivalued map which associates to each point $(x,t)$ the set of optimal trajectories starting from that point, endowed with a suitable notion of convergence, the continuity of the value function. The main issue to overcome is due to the local interplay at boundary points between the set of state constraints and the degenerate dynamics. To this end, we shall point out two different sets of assumptions which are both sufficient for these properties. Afterwards, we tackle the mean field games; taking advantage of the aforementioned properties, we prove the existence of a relaxed equilibrium (which describes the evolution of the game in terms of a probability on the set of admissible trajectories) and derive the existence of a mild solution (which is a couple formed by the value function for the generic player and a family of time dependent measures on the state).",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12788v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Daniele Corallo",
      "Pascal Lehner",
      "Christian Wieners"
    ],
    "title": "A parallel space-time $p$-adaptive discontinuous Galerkin method for nonlinear acoustics",
    "abstract": "In this paper, we introduce and analyze a space-time $p$-adaptive discontinuous Galerkin method for nonlinear acoustics. We first present the underlying mathematical model, which is based on a recently derived formulation involving, in particular, only first order in time derivatives. We then propose a spacetime discontinuous Galerkin discretization of this model, combining a symmetric Friedrichs systems discretization for symmetric hyperbolic systems with an interior penalty discretization for damping terms. The resulting nonlinear system is solved using Newton's method. Next, we present a well-posedness analysis of the discrete problem. The analysis begins with a linearized system, for which stability is shown. Using a fixed point argument, these results are extended to the fully discrete nonlinear system, yielding a priori error estimates in a natural discontinuous Galerkin norm. Finally, we present numerical experiments demonstrating the parallel solvability of the spacetime formulation and the effectiveness of p-adaptivity. The results confirm the theoretical convergence rates and show that adaptive refinement can reduce the number of degrees of freedom required to accurately approximate selected goal functionals. Moreover, the experiments demonstrate that the model reproduces characteristic phenomena of nonlinear acoustics, such as harmonic generation, thereby validating the proposed model.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12784v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Artur Jorge Marinho",
      "Carlo Mercuri",
      "Kanishka Perera"
    ],
    "title": "New solutions to Schrödinger-Poisson-Slater equations in Coulomb-Sobolev spaces",
    "abstract": "We prove existence and multiplicity results for the nonlinear and nonlocal PDE $$ - Δu + (I_α\\star |u|^p)\\, |u|^{p-2}\\, u = f(|x|,u) \\quad \\textrm{in} \\,\\,\\mathbb {R}^N, $$ where $N \\geq 2$, $I_α: \\mathbb{R}^N \\setminus \\{0\\} \\rightarrow \\mathbb{R}$ is the Riesz potential of order $α\\in (1,N),$ $p>1,$ and the local nonlinearity $f: [0,\\infty) \\times \\mathbb{R} \\rightarrow \\mathbb R$ is subject to a new class of assumptions. We find solutions to this zero-mass problem in a Coulomb-Sobolev space using a new scaling based approach in critical point theory, by which we classify the possibly different behaviour of the nonlinearity $f$ at zero and at infinity in terms of the scaling properties of the left hand side of the equation. This is accomplished identifying a scaling invariant PDE which can be interpreted as a nonlinear eigenvalue problem, for which a sequence of eigenvalues $\\{λ_k\\}$ is conveniently defined via the ${\\mathbb{Z}}_2$-cohomological index of Fadell and Rabinowitz. This index allows us to use new critical group estimates (and scaling-based linking sets) which might not be possible via the classical genus. Within a fairly broad set of parameters $N,α, p$ and class of assumptions on the local nonlinearity $f,$ we establish compactness results for an associated action functional and find multiple solutions as critical points, whose existence and number is sensitive to the ''resonance'' of $f$ with the sequence of eigenvalues for the scaling invariant problem, a construction which is at places reminiscent, in the present nonlinear setting, of the classical Fredholm alternative. As a byproduct of our analysis, letting $p\\neq 2$ allows us to capture general nonlinearities $f$ of Sobolev-subcritical, critical, or supercritical growth.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12733v1",
    "categories": [
      "math.SG",
      "cs.CG"
    ],
    "authors": [
      "Stefan Goessner"
    ],
    "title": "A New Approach in Plane Kinematics",
    "abstract": "The kinematics of particles and rigid bodies in the plane are investigated up to higher-order accelerations. Discussion of point trajectories leads from higher-order poles to higher-order Bresse circles of the moving plane. Symplectic geometry in vector space R^2 is used here as a new approach and leads to some new recursive vector formulas. This article is dedicated to the memory of Professor Pennestri.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12795v1",
    "categories": [
      "math.AT",
      "math.GT",
      "math.QA"
    ],
    "authors": [
      "Ruiliang Li"
    ],
    "title": "Canonical torsion linking pairings and explicit TMF state spaces of closed 3-manifolds",
    "abstract": "We study the TMF-valued $(3+1)$-dimensional TQFT of Gukov--Krushkal--Meier--Pei and give an explicit description of the TMF-module state space assigned to a closed $3$-manifold. Our starting point is the torsion linking pairing on $H_1$, viewed as a discriminant form. We construct a canonical, computable package of invariants for torsion linking pairings (uniformly for odd and $2$-primary parts), and from it a canonical tokenization together with an explicit symmetric integral matrix representative realizing the same stable class. This yields an explicit model for the GKMP state space in terms of a rank-one TMF-module $L_b$ with a canonical degree shift determined by signature data. As applications we identify the values on $CP^2$ and, conditional on a natural functoriality/duality statement in GKMP, on $S^2\\times S^2$ with the Hopf elements $\\pmν$ and $η$, respectively. Finally, we establish a rank-one time-reversal duality $L_{(-n)}\\simeq L_{(n)}^\\vee[1]$ for all integers $n$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12760v1",
    "categories": [
      "math-ph"
    ],
    "authors": [
      "Alain Joye",
      "Andreas Schaefer",
      "Simone Warzel"
    ],
    "title": "Dynamical Localization for General Scattering Quantum Walks",
    "abstract": "We consider quantum walks defined on arbitrary infinite graphs, parameterized by a family of scattering matrices attached to the vertices. Multiplying each scattering matrix by an i.i.d. random phase, we obtain a random scattering quantum walk. We prove dynamical localization for random scattering walks in a large-disorder regime. The result is based on a relation between fractional moment estimates and eigenfunction correlators of independent interest, which we establish for general random unitary operators.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12738v1",
    "categories": [
      "math.AT",
      "math.CT"
    ],
    "authors": [
      "Aowen Fan",
      "Foling Zou"
    ],
    "title": "On the Kelly monoidal structure of $Λ$-sequences and unital operads",
    "abstract": "Let $Λ$ be the category of based finite sets $\\mathbf{n}$ and based injections. We study properties of monoids and modules in $Λ$-sequences under the Kelly monoidal structure. In particular, we show that the forgetful functor from right modules in $Λ$-sequences to right modules in symmetric sequences is an isomorphism. We show that any compatible lower data extends to a normal oplax monoidal structure and use this to establish a universal normal oplax monoidal structure on $Λ$-sequences extending the Kelly product, identifying unital operads to monoids in unital $Λ$-sequences for a general symmetric monoidal category $\\mathscr{V}$. We also establish a closed monoidal localization theorem.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12736v1",
    "categories": [
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "David Fabian",
      "Patrick Morris",
      "Tibor Szabó"
    ],
    "title": "Graph bootstrap percolation -- a discovery of slowness",
    "abstract": "Graph bootstrap percolation is a discrete-time process capturing the spread of a virus on the edges of $K_n$. Given an initial set $G\\subseteq K_n$ of infected edges, the transmission of the virus is governed by a fixed graph $H$: in each round of the process any edge $e$ of $K_n$ that is the last uninfected edge in a copy of $H$ in $K_n$ gets infected as well. Once infected, edges remain infected forever. The process was introduced by Bollobás in 1968 in the context of weak saturation and has since inspired a vast array of beautiful mathematics. The main focus of this survey is the extremal question of how long the infection process can last before stabilising. We give an exposition of our recent systematic study of this maximum running time and the influence of the infection rule $H$. The topic turns out to possess a wide variety of interesting behaviour, with connections to additive, extremal and probabilistic combinatorics. Along the way we encounter a number of surprises and attractive open problems.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12718v1",
    "categories": [
      "math.AG",
      "math.NT"
    ],
    "authors": [
      "Hyuk Jun Kweon"
    ],
    "title": "Pro-Algebraic Site",
    "abstract": "For any type of fundamental groupoid scheme, we construct an algebraic cohomology theory for varieties with coefficients in the base field. This is a minor variant of étale cohomology, involving neither de Rham complexes nor hypercohomology. The main idea is to delegate the role of étale morphisms to fundamental groupoids, thereby bypassing the Grothendieck topology. To validate this theory, we prove a comparison theorem between the algebraically defined cohomology using the pro-algebraic fundamental groupoid over $\\mathbb{C}$ and singular cohomology. Furthermore, our construction naturally extends to other types of fundamental groupoids, providing a uniform foundation for various cohomology theories.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12710v1",
    "categories": [
      "math.ST",
      "stat.AP"
    ],
    "authors": [
      "Dietmar Bauer Kurtulus Kidik"
    ],
    "title": "On the relation between Global VAR Models and Matrix Time Series Models with Multiple Terms",
    "abstract": "Matrix valued time series (MaTS) and global vector autoregressive (GVAR) models both impose restrictions on the general VAR for multidimensional data sets, in order to bring down the number of parameters. Both models are motivated from a different viewpoint such that on first sight they do not have much in common. When investigating the models more closely, however, one notices many connections between the two model sets. This paper investigates the relations between the restrictions imposed by the two models. We show that under appropriate restrictions in both models we obtain a joint framework allowing to gain insight into the nature of GVARs from the viewpoint of MaTS.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12447v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "physics.class-ph"
    ],
    "authors": [
      "Rodrigo Bissacot",
      "Henrique Corsini"
    ],
    "title": "A Cluster Expansion and the Decay of Correlations of the 1D Long-Range Ising Model at Low Temperatures",
    "abstract": "In this work, a convergent low-temperature cluster expansion of the one-dimensional long-range ferromagnetic Ising model with polynomial decay $α\\in (1,2]$ is developed; that is, $J(r)=r^{-α}$. As an application, the $n$-point correlations are studied and the two-point correlation is shown to be algebraic with rate of decay exactly $α$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12409v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Bankim C. Mandal",
      "Deeksha Tomer"
    ],
    "title": "Dirichlet-Neumann Waveform Relaxation Method with Multiple Subdomains for Reaction-Diffusion Equation with a Time Delay",
    "abstract": "In this study, we present the numerical investigation of the Dirichlet-Neumann Waveform Relaxation (DNWR) algorithm applied to multiple subdomains for the reaction-diffusion equation with time delay. Various arrangements of transmission conditions between subdomains are explored and a series of numerical experiments are conducted to evaluate and compare the efficiency and effectiveness of these configurations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12383v1",
    "categories": [
      "math.DG",
      "gr-qc"
    ],
    "authors": [
      "Jeffrey L. Jauregui"
    ],
    "title": "Maximum capacity of Bartnik data and a generalization of static metrics",
    "abstract": "Inspired by R. Bartnik's mass minimization problem in general relativity, we investigate a dual problem of maximizing the capacity among asymptotically flat extensions (with nonnegative scalar curvature) of some fixed two-dimensional boundary data. Using the method of Lagrange multipliers on the constraint space of scalar-flat extensions, we derive the variational condition satisfied by a maximal capacity extension. The resulting equation is an inhomogeneous generalization of the well-known static equation, now coupled with the Baird--Eells stress-energy tensor for a harmonic function. We analyze these ``harmonic-static'' metrics in a local sense, proving they have constant scalar curvature and serve as critical points for a metric-dependent Dirichlet energy functional. We conclude with a number of open questions.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12377v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Meselem Karras"
    ],
    "title": "Note on Fractional Sums with Fixed GCD",
    "abstract": "We investigate fractional sums of arithmetic functions over products of two or three integers, with emphasis on fixed greatest common divisors and multiplicative weights. Let $f$ be an arithmetic function satisfying $f(n) \\ll n^α$ for some $0 \\le α< 1$. For $r \\ge 2$, let $τ_r(n)$ denote the number of representations of $n$ as a product of $r$ positive integers, and more generally, $τ_r^{(d)}(n)$ the number of representations with $\\gcd$ factors equal to $d$. We establish asymptotic formulas for the fractional sums \\[ S_{f,r}^{(d)}(x) = \\sum_{n \\le x} τ_r^{(d)}(n) f\\!\\left(\\left\\lfloor \\frac{x}{n}\\right\\rfloor \\right), \\] in the cases $r=2$ and $r=3$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12363v1",
    "categories": [
      "math.CT",
      "math.FA"
    ],
    "authors": [
      "Nizar El Idrissi"
    ],
    "title": "Parametrized equivalence relation on the global class of morphisms of a category and frame-theoretic examples",
    "abstract": "We introduce an equivalence relation on the global class of morphisms of a category that extends several classical notions of equivalence in mathematics. We show that the standard group-action equivalence is a special case of our framework. A more interesting example is provided by an equivalence relation defined on the class of Bessel families and based on a coarse invariant that is the pointwise norm of the analysis operator of the Bessel family -- this is also a special case of our framework, and the formalism developed here can be seen as a first step toward a categorical invariant theory for Bessel families and continuous frames.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12678v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "S. Ray"
    ],
    "title": "Soft Bitopological Groups via Soft Elements",
    "abstract": "Working in the soft-element (classical) viewpoint, we introduce \\emph{soft bitopological groups}: soft groups endowed with two soft topologies such that the induced topologies on the set of soft elements make the soft-element group into a (classical) bitopological group. This approach unifies and simplifies continuity proofs, because the group operations become coordinatewise and standard topological-group methods apply. We organize the theory in a standard ``definitions--characterizations--properties--examples'' format. In particular, we (i) record the induced topology and induced bitopology on soft elements of a soft set; (ii) characterize soft bitopological groups by continuity of the map $(a,b)\\mapsto a\\ast b^{-1}$ in each induced topology; (iii) show that translations and inversion are homeomorphisms in each induced topology; (iv) collect pairwise soft separation axioms and pairwise soft compactness results (including the finiteness principle for compactness when the parameter set is finite); and (v) define soft bitopological group homomorphisms and basic invariants. Several examples illustrat that the two topologies can be independent (non-comparable) even in Hausdorff situations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12676v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Changjian Xie"
    ],
    "title": "Semi-implicit Structure Preserving Method for The Landau-Lifshitz Equation",
    "abstract": "A critical challenge inherent to the projection method applied to the Landau-Lifshitz equation is the deficiency of rigorous theoretical justifications for the stability of its projection step. To mitigate this limitation, we introduce a semi-implicit numerical scheme, which is formulated on the basis of the first-order Backward Differentiation Formula (BDF) incorporated with one-sided extrapolation and a Crank-Nicolson-type norm-preserving procedure. This proposed scheme exhibits three fundamental characteristics: structure preservation, numerical stability, and first-order accuracy in time. In practical implementations, the scheme not only ensures stable computation and adheres to the norm constraint but also guarantees the uniqueness of the numerical solution, thereby providing substantial facilitation for the theoretical analysis of the normalizing step.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12646v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Qi Ding",
      "Lei Zhang"
    ],
    "title": "Topology of complete minimal submanifolds in $\\mathbb{R^{n+m}}$ with finite total curvature",
    "abstract": "In [CKM17], Chodosh, Ketover, and Maximo proved finite diffeomorphism theorems for complete embedded minimal hypersurfaces of dimension $\\leqslant$ 6 with finite index and bounded volume growth ratio. In this paper, we adapt their method to study finite diffeomorphism types for complete immersed minimal submanifolds of arbitrary codimension in Euclidean space with finite total curvature and Euclidean volume growth.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12621v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Anuj Jakhar",
      "Anwesh Ray"
    ],
    "title": "On the distribution of shapes of octic Kummer extensions",
    "abstract": "The shape of a number field $K$ of degree $n$ is defined as the equivalence class of the lattice of integers under linear operations generated by rotations, reflections, and positive scalar dilations. It may be viewed as a point in the space of shapes $\\mathscr{S}_{n-1} =\n\\mathrm{GL}_{n-1}(\\mathbb{Z})\\backslash \\mathrm{GL}_{n-1}(\\mathbb{R})/\\mathrm{GO}_{n-1}(\\mathbb{R})$. In this paper, we study the distribution of shapes of octic Kummer extensions $L=\\mathbb{Q}(i,\\sqrt[4]{m})$, where $m\\in\\mathbb{Z}[i]$ is fourth-power-free. We parametrize these shapes by explicit invariants known as shape parameters and establish an asymptotic formula for their joint distribution ordered by absolute discriminant. The limiting distribution is given by an explicit measure that factors as the product of a continuous measure and a discrete measure arising from local arithmetic conditions.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12589v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Zhijun Cai",
      "Xiang Li",
      "Lihu Xu"
    ],
    "title": "Berry-Esseen Bounds and Moderate Deviations for Catoni-Type Robust Estimation",
    "abstract": "A powerful robust mean estimator introduced by Catoni (2012) allows for mean estimation of heavy-tailed data while achieving the performance characteristics of classical mean estimator for sub-Gaussian data. While Catoni's framework has been widely extended across statistics, stochastic algorithms, and machine learning, fundamental asymptotic questions regarding the Central Limit Theorem and rare event deviations remain largely unaddressed. In this paper, we investigate Catoni-type robust estimators in two contexts: (i) mean estimation for heavy-tailed data, and (ii) linear regression with heavy-tailed innovations. For the first model, we establish the Berry--Esseen bound and moderate deviation principles, addressing both known and unknown variance settings. For the second model, we demonstrate that the associated estimator is consistent and satisfies a multi-dimensional Berry-Esseen bound.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12581v1",
    "categories": [
      "math.PR",
      "math.FA",
      "math.NA",
      "math.SP"
    ],
    "authors": [
      "Paulo Manrique"
    ],
    "title": "The condition number of a random banded Toeplitz matrix is typically large",
    "abstract": "It is well known that square matrices with independent and identically distributed (iid) random entries are typically well conditioned. A natural question is whether this favorable behavior persists for random matrices whose entries obey additional structure, i.e., their position inside of the matrix. A prominent class of structured matrices is given by {\\it Toeplitz matrices}, characterized by constant diagonals. A particular tractable subclass is that of circulant matrices, whose additional characteristic (its entries {\\it circulate} row by row) allows one to express their conditioning in terms of the localization of the zeros of a associated polynomial. When the entries of a circulant matrix are iid, the matrix is well conditioned precisely when the corresponding random polynomial has no zeros on the unit circle. This connection is especially relevant because, as the degree of a random polynomial increases, its zeros tend to concentrate near the unit circle, making it a delicate problem to quantify how close the closest zeros lie to the unit circle. Another notable family within the Toeplitz class is that of {\\it banded Toeplitz matrices}, namely matrices for which only finitely many diagonals around the main diagonal may be nonzero. These matrices have been extensively studied in Operator Theory, nevertheless, despite their apparent simplicity, they raise subtle questions regarding the behavior of their condition numbers. In present work we show that the bandwidth asymmetry plays a decisive role: if the band contains $r$ diagonals below and $s$ diagonal above the main diagonal, then if $r=s$ the banded Toeplitz matriz is well conditioned with high probability, whereas if $r\\neq s$ it is typically ill conditioned. This highlights that structural constraints can have a impact on the numerical behavior of random matrices.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12555v1",
    "categories": [
      "math.SG"
    ],
    "authors": [
      "Honghao Gao",
      "Hanming Liu"
    ],
    "title": "Isomorphism in the augmentation category",
    "abstract": "Given a Legendrian submanifold in any dimension, we prove that two augmentations are isomorphic within the positive augmentation category exactly when they differ by a combination of a dga homotopy and a dilation. This extends the corresponding statement for Legendrian knots and links, but instead of relying on the dga for consistent copies, we make use of quantum flow tree techniques. Consequently, we can strengthen and clarify a result of the first author as follows: for knot contact homology, the augmentation category is not in general equivalent to the microlocal rank 1 sheaf category.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12519v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Jiarou Jin",
      "Yanyong Hong"
    ],
    "title": "Transposed Novikov-Poisson algebras",
    "abstract": "In this paper, we introduce the definition of transposed Novikov-Poisson algebras, whose affinization are transposed Poisson algebras. Moreover, we show that there is a natural transposed Poisson algebra structure on the tensor product of a transposed Novikov-Poisson algebra and a right differential Novikov-Poisson algebra. A transposed Poisson algebra also naturally arises from a transposed Novikov-Poisson algebra by taking the commutator Lie algebra of the Novikov algebra. We show that the tensor products of two transposed Novikov-Poisson algebras are also transposed Novikov-Poisson algebras. Several constructions of transposed Novikov-Poisson algebras are presented. Moreover, transposed Novikov-Poisson algebras are closely related to $\\frac{1}{2}$-derivations of the associated Novikov algebras. By using $\\frac{1}{2}$-derivations, we show that there are non-trivial transposed Novikov-Poisson algebra structures on solvable Novikov algebras with some conditions. We also prove that if a non-trivial transposed Novikov-Poisson algebra is simple, then the associated Novikov algebra is simple. Therefore, if the base field is algebraically closed and of characteristic 0, then any simple transposed Novikov-Poisson is of dimension $1$. Transposed Novikov-Poisson algebra structures on some simple Novikov algebras are also characterized.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12463v1",
    "categories": [
      "math.HO",
      "cs.AI"
    ],
    "authors": [
      "James Owen Weatherall",
      "Jesse Wolfson"
    ],
    "title": "Correctness, Artificial Intelligence, and the Epistemic Value of Mathematical Proof",
    "abstract": "We argue that it is neither necessary nor sufficient for a mathematical proof to have epistemic value that it be \"correct\", in the sense of formalizable in a formal proof system. We then present a view on the relationship between mathematics and logic that clarifies the role of formal correctness in mathematics. Finally, we discuss the significance of these arguments for recent discussions about automated theorem provers and applications of AI to mathematics.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12653v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Tianxing Mei",
      "Chen Wang",
      "Jianfeng Yao"
    ],
    "title": "Many-sample tests for the dimensionality hypothesis for large covariance matrices among groups",
    "abstract": "In this paper, we consider procedures for testing hypotheses on the dimension of the linear span generated by a growing number of $p\\times p$ covariance matrices from independent $q$ populations. Under a proper limiting scheme where all the parameters, $q$, $p$, and the sample sizes from the $q$ populations, are allowed to increase to infinity, we derive the asymptotic normality of the proposed test statistics. The proposed test procedures show satisfactory performance in finite samples under both the null and the alternative. We also apply the proposed many-sample dimensionality test to investigate a matrix-valued gene dataset from the Mouse Aging Project and gain some new knowledge about its covariance structures.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12598v1",
    "categories": [
      "math.CV"
    ],
    "authors": [
      "Franc Forstneric"
    ],
    "title": "The Oka principle for holomorphic fibre bundles of Holder-Zygmund classes on strongly pseudoconvex domains",
    "abstract": "Let $\\overline Ω$ be a compact strongly pseudoconvex domain with smooth boundary in a Stein manifold, and let $h:Z\\to \\overline Ω$ be a fibre bundle of Hölder-Zygmund class $Λ^r$, $r>0$, which is holomorphic over $Ω$. Assuming that the fibre is an Oka manifold, we prove that every continuous section $f_0:\\overline Ω\\to Z$ is homotopic to a section $f_1:\\overline Ω\\to Z$ of class $Λ^r(\\overline Ω)$ which is holomorphic on $Ω$, and we establish a parametric version of the same result. As an application, we obtain the Oka principle for the classification of vector bundles and principal bundles of Hölder-Zygmund classes.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12595v1",
    "categories": [
      "math.PR",
      "cond-mat.dis-nn",
      "math-ph"
    ],
    "authors": [
      "Sourav Chatterjee"
    ],
    "title": "Michel Talagrand and the Rigorous Theory of Mean Field Spin Glasses",
    "abstract": "Michel Talagrand played a decisive role in the transformation of mean field spin glass theory into a rigorous mathematical subject. This chapter offers a narrative account of that development. We begin with the physical origins of the Sherrington-Kirkpatrick (SK) model and the emergence of the TAP and Almeida-Thouless stability frameworks, culminating in Parisi's replica symmetry breaking (RSB) ansatz and its hierarchical order parameter. We then review early rigorous milestones, including high-temperature results and stability identities, and describe the consolidation of interpolation and cavity methods through the work of Guerra and of Aizenman-Sims-Starr. The central event in this narrative is Talagrand's 2006 proof of the Parisi formula for the SK model and for a broad class of mixed $p$-spin models, and his subsequent analysis of Parisi measures. We also discuss Talagrand's later program constructing pure states under extended Ghirlanda-Guerra identities and an atom at the maximal overlap, together with the structural results that followed, notably Panchenko's ultrametricity theorem and extensions of the Parisi formula. Throughout, we indicate how related contributions by many authors fit into the same long-running program across probability, analysis, and mathematical physics.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12580v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yaguang Gu",
      "Guanghui Hu",
      "Tao Tang"
    ],
    "title": "Adaptive mesh methods for hyperbolic conservation laws with bound-preserving flux limiters",
    "abstract": "In this paper, we develop bound-preserving (BP) finite-volume schemes for hyperbolic conservation laws on adaptive moving meshes. For scalar conservative laws, we rewrite the conventional high-order discretization as a convex combination of first-order counterparts on each sub-cell, which is mathematically equivalent to introducing a bound-preserving flux limiter. Such a limiter is inexpensive to evaluate, with a feature that the corresponding BP CFL conditions depend solely on the first-order sub-cell schemes. A mild CFL restriction is derived under which high-order spatial accuracy is retained. The proposed BP schemes are extend to two nonlinear systems, namely, the Euler equations and the five-equation transport model of two-medium flows. Numerical results demonstrate that the present schemes possess high resolution and strong robustness properties.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12559v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Zhiqiang Cai",
      "Anastassia Doktorova",
      "Robert D. Falgout",
      "César Herrera"
    ],
    "title": "Convergence Analysis of Block Newton Methods for 1D Shallow Neural Network Approximation",
    "abstract": "This paper analyzes local convergence of the block Newton (BN) method introduced in [5, 6] for one-dimensional shallow neural network approximation to functions and diffusion-reaction problems. The BN method consists of the 2x2 block nonlinear Gauss-Seidel, linear Gauss-Seidel, or Jacobi method for outer iteration and the Newton method for inner iteration. The blocks are corresponding to the linear and the nonlinear parameters. Under some reasonable assumptions, we establish local convergence of the BN methods as well as the reduced BN (rBN) method for one-dimensional diffusion-reaction problems and least-squares function approximation. Unlike common optimization methods, the rBN allows for the reduction of the number of parameters during the optimization process when some neurons contribute little to the approximation or are at nearly optimal locations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12551v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Daniel Král'",
      "Matjaž Krnc",
      "Filip Kučerák",
      "Bernard Lidický",
      "Jan Volec"
    ],
    "title": "Sidorenko property and forcing in regular tournaments",
    "abstract": "We give a complete characterization of tournaments H that have the Sidorenko property with respect to nearly regular tournaments, i.e., the homomorphism density of H among all nearly regular tournaments is minimized by a random tournament. Corollaries of our result are a positive answer to the question of Noel, Ranganathan and Simbaqueba whether there exist infinitely many non-transitive tournaments that are quasirandom forcing for nearly regular tournaments, and a negative answer to their question whether almost every tournament is quasirandom forcing for nearly regular tournaments.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12523v1",
    "categories": [
      "math.PR",
      "math.OC"
    ],
    "authors": [
      "Jose Correa",
      "Marcos Kiwi",
      "Vasilis Livanos",
      "Eilon Solan",
      "Ron Solan"
    ],
    "title": "About a Ball Removal Process on Bins",
    "abstract": "Consider the following process whereby $n$ balls are distributed into $k$ bins. Repeatedly, a ball is removed from a non-empty bin chosen uniformly at random. The process ends when a single non-empty bin remains. Will Ma (see~\\cite[Sec.~1.1]{GS24}) asked whether the initial assignment that minimizes the expected number of remaining balls is one that is as balanced as possible. Using a coupling argument we answer this conjecture positively, and we discuss the case of non-uniform choice among the non-empty bins.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12491v1",
    "categories": [
      "math.NA",
      "math.AP"
    ],
    "authors": [
      "Dominic Blanco"
    ],
    "title": "Proving periodic solutions and branches in the 2D Swift Hohenberg PDE with hexagonal and triangular symmetry",
    "abstract": "In this article, we enforce space group symmetries in Fourier series to rigorously prove the existence of smooth, periodic solutions in partial differential equations (PDEs) with hexagonal and triangular symmetries. In particular, we provide the necessary analytical and numerical tools to construct Fourier series of functions on the hexagonal lattice. This allows one to build approximate solutions that are periodic. Moreover, to generate the periodic tiling, we can use one symmetric hexagon for $D_6$ symmetry and two symmetric triangles for $D_3$ symmetry. We derive a Newton-Kantorovich approach based on the construction of an approximate inverse around an approximate solution, $\\overline{u}$. More specifically, we verify a condition based on the computation of explicit bounds. The strategy for constructing $\\overline{u}$, the approximate inverse, and the computation of these bounds will be presented. We demonstrate our approach on the 2D Swift-Hohenberg PDE by proving the existence of $D_3$ and $D_6$ periodic solutions. We then perform proofs of branches of solutions by using Chebyshev series. The algorithmic details to perform the proof can be found on Github.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12483v1",
    "categories": [
      "math.NA",
      "stat.ME"
    ],
    "authors": [
      "Sofiia Shvaiko",
      "Longxiu Huang",
      "Elizaveta Rebrova"
    ],
    "title": "Quantile Randomized Kaczmarz Algorithm with Whitelist Trust Mechanism",
    "abstract": "Randomized Kaczmarz (RK) is a simple and fast solver for consistent overdetermined systems, but it is known to be fragile under noise. We study overdetermined $m\\times n$ linear systems with a sparse set of corrupted equations, $ {\\bf A}{\\bf x}^\\star = {\\bf b}, $where only $\\tilde{\\bf b} = {\\bf b} + \\boldsymbol{\\varepsilon}$ is observed with $\\|\\boldsymbol{\\varepsilon}\\|_0 \\le βm$. The recently introduced QuantileRK (QRK) algorithm addresses this issue by testing residuals against a quantile threshold, but computing a per-iteration quantile across many rows is costly. In this work we (i) reanalyze QRK and show that its convergence rate improves monotonically as the corruption fraction $β$ decreases; (ii) propose a simple online detector that flags and removes unreliable rows, which reduces the effective $β$ and speeds up convergence; and (iii) make the method practical by estimating quantiles from a small random subsample of rows, preserving robustness while lowering the per-iteration cost. Simulations on imaging and synthetic data demonstrate the efficiency of the proposed method.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12474v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Hamid Abban",
      "Ivan Cheltsov",
      "Adrien Dubouloz",
      "Kento Fujita",
      "Takashi Kishimoto",
      "Jihun Park"
    ],
    "title": "On K-stability of singular hyperelliptic Fano 3-folds",
    "abstract": "We study the K-stability of singular Fano 3-folds with canonical Gorenstein singularities whose anticanonical linear system is base-point-free but not very ample.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12801v1",
    "categories": [
      "math.NT",
      "math.CO"
    ],
    "authors": [
      "Ingrid Vukusic"
    ],
    "title": "Balanced rectangles over Sturmian words and minimal discrepancy intervals",
    "abstract": "We consider $m\\times n$ rectangular matrices formed from Sturmian words with slope $α$ and we fully characterise their balance properties in terms of the Ostrowski representations of $m$ an $n$ with respect to $α$. This generalises recent results by Anselmo et al., as well as by Shallit and Vukusic, where only quadratic irrationals $α$ were considered. In contrast to the two mentioned papers, our approach is based on the distribution of $nα\\bmod 1$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12772v1",
    "categories": [
      "math.AC",
      "math.RA"
    ],
    "authors": [
      "Junyu Guo",
      "Hao Shen",
      "Junqi Liu",
      "Lihong Zhi"
    ],
    "title": "Formalizing Gröbner Basis Theory in Lean",
    "abstract": "We present a formalization of Gröbner basis theory in Lean 4, built on top of Mathlib's infrastructure for multivariate polynomials and monomial orders. Our development covers the core foundations of Gröbner basis theory, including polynomial division with remainder, Buchberger's criterion, and the existence and uniqueness of reduced Gröbner bases. We develop the theory uniformly for polynomial rings indexed by arbitrary types, enabling the treatment of Gröbner bases in rings with infinitely many variables. Furthermore, we connect the finite and infinite settings by showing that infinite-variable reduced Gröbner bases can be characterized via reduced Gröbner bases on finite-variable subrings through monomial-order embeddings and filter-based limit constructions.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12766v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Zhe Zhai",
      "Sheng Jin",
      "Qifu Tyler Sun",
      "Zongpeng Li"
    ],
    "title": "Construction of MRD Codes Based on Circular-Shift Operations",
    "abstract": "Most well-known constructions of $(N \\times n, q^{Nk}, d)$ maximum rank distance (MRD) codes rely on the arithmetic of $\\mathbb{F}_{q^N}$, whose increasing complexity with larger $N$ hinders parameter selection and practical implementation. In this work, based on circular-shift operations, we present a construction of $(J \\times n, q^{Jk}, d)$ MRD codes with efficient encoding, where $J$ equals to the Euler's totient function of a defined $L$ subject to $\\gcd(q, L) = 1$. The proposed construction is performed entirely over $\\mathbb{F}_q$ and avoids the arithmetic of $\\mathbb{F}_{q^J}$. We further characterize the constructed MRD codes, Gabidulin codes and twisted Gabidulin codes using a set of $q$-linearized polynomials over the row vector space $\\mathbb{F}_{q}^N$, and clarify their inherent difference and connection. For the case $J \\neq m_L$, where $m_L$ denotes the multiplicative order of $q$ modulo $L$, we show that the proposed MRD codes, in a family of settings, are different from any Gabidulin code and any twisted Gabidulin code. For the case $J = m_L$, we prove that every constructed $(J \\times n, q^{Jk}, d)$ MRD code coincides with a $(J \\times n, q^{Jk}, d)$ Gabidulin code, yielding an equivalent circular-shift-based construction that operates directly over $\\mathbb{F}_q$. In addition, we prove that under some parameter settings, the constructed MRD codes are equivalent to a generalization of Gabidulin codes obtained by summing and concatenating several $(m_L \\times n, q^{m_Lk}, d)$ Gabidulin codes. When $q=2$, $L$ is prime and $n\\leq m_L$, it is analyzed that generating a codeword of the proposed $((L-1) \\times n, 2^{(L-1)k}, d)$ MRD codes requires $O(nkL)$ exclusive OR (XOR) operations, while generating a codeword of $((L-1) \\times n, 2^{(L-1)k}, d)$ Gabidulin codes, based on customary construction, requires $O(nkL^2)$ XOR operations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12707v1",
    "categories": [
      "math.AG",
      "hep-th",
      "math-ph",
      "math.SG"
    ],
    "authors": [
      "Mark Gross",
      "Tyler L. Kelly",
      "Ran J. Tessler"
    ],
    "title": "Open enumerative geometries for Landau-Ginzburg models",
    "abstract": "We survey the recent progress in defining open enumerative theories for Landau-Ginzburg models. We illustrate the ideas required to develop these new foundations. In particular, we describe how to define the open enumerative invariants as integrals of multisections of certain vector bundles over a moduli space that is a real orbifold with corners, after prescribing boundary conditions for the multisections. We then explain the known situations where the open invariants satisfy certain forms of topological recursion relations, integrable hierarchies, or mirror symmetry. We end with a list of open questions and problems.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12439v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Alessandro Pilastro"
    ],
    "title": "On Fujita's conjecture for a general hyperkähler manifold in the standard series of examples",
    "abstract": "For the moduli spaces $Σ_{d,t}^n$ and $Υ_{d,t}^n$ of polarized hyperkähler manifolds of Hilb$^n$(K3)-type and Kum$^n$-type respectively, with polarization with square $2d$ and divisibility $t$, we study general base point freeness and very ampleness of the polarization. We provide cases where these moduli space are connected and a formula characterizing when these spaces are non-empty.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12374v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Vadim Zverovich"
    ],
    "title": "On Camby-Plein's Characterization of Domination Perfect Graphs",
    "abstract": "We show that all results stated in [E. Camby, F. Plein, Discrete Appl. Math. 217 (2017) 711-717] are either previously known or incorrect. For example, Camby and Plein claimed to provide counterexamples to the 1995 characterization of domination perfect graphs due to Zverovich and Zverovich; however, these counterexamples are not valid. Moreover, the new characterization of domination perfect graphs proposed in that paper is incorrect.\n  For completeness, we present a relatively brief proof of the 1995 characterization of domination perfect graphs due to Zverovich and Zverovich.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12352v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Ethan Addison",
      "Tedi Draghici",
      "Mehdi Lejmi"
    ],
    "title": "On pluricanonical locally conformally almost Kähler metrics",
    "abstract": "On an almost complex manifold $(M,J)$, a pluricanonical locally conformally almost Kähler (LCAK) metric $g$ is induced by a locally conformally symplectic structure $(F,θ)$ of the first kind and characterized by the fact that $Dθ$ is $J$-anti-invariant and that the image of the Nijenhuis tensor is $g$-orthogonal to the distribution spanned by $\\{θ^\\sharp,Jθ^\\sharp\\}$, where $θ$ is the Lee form and $D$ is the Levi-Civita connection. On a compact complex manifold, pluricanonical locally conformally Kähler (LCK) metrics have parallel Lee form. The same conclusion holds for LCK Chern--Ricci flat Gauduchon metrics. We generalize both results to pluricanonical LCAK metrics. We also observe that on a compact pluricanonical LCAK manifold with a non-trivial Lee form, there is no symplectic form compatible with the same almost complex structure. Moreover, we give a simple characterization of the pluricanonical LCAK condition on Lie algebras. Finally, we study LCAK metrics with $θ^\\sharp$ being real holomorphic, proving in that case $Dθ=0$ when the metric is Gauduchon.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12604v1",
    "categories": [
      "math.ST",
      "stat.ML"
    ],
    "authors": [
      "Joowon Lee",
      "Guanhua Chen"
    ],
    "title": "Differentially Private Two-Stage Empirical Risk Minimization and Applications to Individualized Treatment Rule",
    "abstract": "Differential Privacy (DP) provides a rigorous framework for deriving privacy-preserving estimators by injecting calibrated noise to mask individual contributions while preserving population-level insights. Its central challenge lies in the privacy-utility trade-off: calibrating noise levels to ensure robust protection without compromising statistical performance. Standard DP methods struggle with a particular class of two-stage problems prevalent in individualized treatment rules (ITRs) and causal inference. In these settings, data-dependent weights are first computed to satisfy distributional constraints, such as covariate balance, before the final parameter of interest is estimated. Current DP approaches often privatize stages independently, which either degrades weight efficacy-leading to biased and inconsistent estimates-or introduces excessive noise to account for worst-case scenarios.\n  To address these challenges, we propose the Differentially Private Two-Stage Empirical Risk Minimization (DP-2ERM), a framework that injects a carefully calibrated noise only into the second stage while maintaining privacy for the entire pipeline and preserving the integrity of the first stage weights. Our theoretical contributions include deterministic bounds on weight perturbations across various widely used weighting methods, and probabilistic bounds on sensitivity for the final estimator. Simulations and real-world applications in ITR demonstrate that DP-2ERM significantly enhances utility over existing methods while providing rigorous privacy guarantees.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12570v1",
    "categories": [
      "math.DS",
      "math-ph"
    ],
    "authors": [
      "Christopher Cox",
      "Renato Feres",
      "Zijie Hu"
    ],
    "title": "Nonholonomic billiards and bounded motion in cylinders",
    "abstract": "A widely used mathematical model for the bouncing motion of an ideally elastic ball -- referred to in previous work by the first two authors and collaborators as a {\\em no-slip billiard} system -- exhibits some notable dynamical behavior that is not well-understood. For example, under certain initial conditions, the axial component of the position of the center of the ball moving inside a vertical solid cylinder under constant gravitational force does not accelerate downward as might be expected but remains bounded. There is not as yet, as far as we know, any analytical study of the bouncing ball dynamics, under gravity, in general cylinders (not necessarily having a circular cross-section) in $\\mathbb{R}^3$. In this paper, we propose an approach by comparing the no-slip system with a smooth approximation of it that we call {\\em nonholonomic billiards}. It consists of a $4$-dimensional ball rolling on the solid $3$-dimensional cylinder.\n  We first review earlier work on no-slip billiards and their connection with nonholonomic (rolling) systems, explain how nonholonomic billiards approximate the no-slip kind (after work by the first two authors and B. Zhao), and illustrate the relationship with a few numerical case studies that demonstrate the utility of the soft (nonholonomic) system as a helpful tool for exploring the dynamics of no-slip billiard systems.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12799v1",
    "categories": [
      "cs.IT",
      "eess.SP"
    ],
    "authors": [
      "Ran Tao",
      "Jiajia Guo",
      "Yiming Cui",
      "Xiangyi Li",
      "Chao-Kai Wen",
      "Shi Jin"
    ],
    "title": "FPNet: Joint Wi-Fi Beamforming Matrix Feedback and Anomaly-Aware Indoor Positioning",
    "abstract": "Channel State Information (CSI) provides a detailed description of the wireless channel and has been widely adopted for Wi-Fi sensing, particularly for high-precision indoor positioning. However, complete CSI is rarely available in real-world deployments due to hardware constraints and the high communication overhead required for feedback. Moreover, existing positioning models lack mechanisms to detect when users move outside their trained regions, leading to unreliable estimates in dynamic environments. In this paper, we present FPNet, a unified deep learning framework that jointly addresses channel feedback compression, accurate indoor positioning, and robust anomaly detection (AD). FPNet leverages the beamforming feedback matrix (BFM), a compressed CSI representation natively supported by IEEE 802.11ac/ax/be protocols, to minimize feedback overhead while preserving critical positioning features. To enhance reliability, we integrate ADBlock, a lightweight AD module trained on normal BFM samples, which identifies out-of-distribution scenarios when users exit predefined spatial regions. Experimental results using standard 2.4 GHz Wi-Fi hardware show that FPNet achieves positioning accuracy above 97% with only 100 feedback bits, boosts net throughput by up to 22.92%, and attains AD accuracy over 99% with a false alarm rate below 1.5%. These results demonstrate FPNet's ability to deliver efficient, accurate, and reliable indoor positioning on commodity Wi-Fi devices.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12790v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Yu Feng",
      "Shuo Ling",
      "Wenjun Ying",
      "Zhennan Zhou"
    ],
    "title": "A Stabilized Numerical Framework for Necrotic Tumor Growth via Coupled Boundary Integral and Obstacle Solvers",
    "abstract": "We present a robust computational framework for Hele-Shaw tumor growth with necrotic cores, a problem identified as the incompressible limit of the Porous Media Equation. Simulating this system presents a fundamental challenge: while the outer boundary evolves via advection, the inner necrotic interface is defined by an obstacle problem and lacks an explicit advection structure, causing standard schemes to fail. To address this, we introduce a stabilized predictor-corrector strategy that iteratively resolves the bidirectional coupling between the nutrient-pressure fields and the domain geometry, ensuring robust time-stepping for both the advection-driven outer surface and the obstacle-defined necrotic core. We establish rigorous convergence theory for the single-interface case and demonstrate the method's robustness in capturing the topological transition of necrotic core nucleation and complex geometric evolution.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12731v1",
    "categories": [
      "math.KT",
      "math.QA",
      "math.RA"
    ],
    "authors": [
      "Julien Bichon"
    ],
    "title": "Monoidal invariance of the cohomological dimension of Hopf algebras: the finite case",
    "abstract": "A consequence of the recent work of Ren and Zhu on Gorenstein projective dimensions of modules over Hopf algebras is that if $A$ and $B$ are Hopf algebras with bijective antipodes having equivalent linear tensor categories of comodules and both having finite global dimensions, then their global dimensions coincide. In this note we provide a direct proof of this result, without using Gorenstein projective dimensions, and we notice that the assumption on the bijectivity of the antipodes can be removed.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12720v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Sufang Yang",
      "Longguang Li",
      "Jintao Wang",
      "Ya Li",
      "Liang Xia",
      "Hongjun He",
      "Qixing Wang",
      "Guangyi Liu"
    ],
    "title": "Secrecy Capacity Analysis and Beamforming Optimization for MIMO-VLC Wiretap Channels",
    "abstract": "This paper investigates a multiple-input multipleoutput (MIMO) visible light communication (VLC) wiretap channel consisting of a transmitter, a legitimate receiver, and an eavesdropper. The optical input is subject to both peakand average-intensity constraints. By applying the generalized entropy-power inequality to truncated exponential inputs, we derive a novel closed-form expression for the achievable secrecy rate for general MIMO VLC configurations. To enhance transmission confidentiality, a fully-connected beamforming scheme is proposed, along with a low-complexity sub-connected alternative. Although the resulting beamforming design problems are nonconvex, they are efficiently addressed by transforming them into a sequence of convex subproblems solvable via the successive convex approximation framework. Numerical results demonstrate that the proposed schemes achieve significant secrecy performance improvements compared with the benchmark scheme.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12671v1",
    "categories": [
      "math.RA"
    ],
    "authors": [
      "Damien Houndedji",
      "Ibrahima Bakayoko"
    ],
    "title": "Structures and comodules of Hom-post Lie coalgebras",
    "abstract": "In this paper, we introduce the notions of Hom-tridendriform coalgebras and Hom-post-Lie coalgebras as the dual notions of Hom-tridendriform algebras and Hom-post-LIe algebras respectively. We give some properties related to them. Then, we study the relationships between them and their connection with post-Hom-Poisson coalgebras. Next, using the Yau stwisting in the modules case, we give some constructions of comodules over post-Hom-Lie coalgebras by twisting either the comodule structures or post-Hom-Lie coalgebra structures.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12666v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Shijun Liao",
      "Shijie Qin"
    ],
    "title": "Non-uniqueness of smooth solutions of the Navier-Stokes equations from almost the same initial conditions",
    "abstract": "Using clean numerical simulation (CNS) which can give very accurate spatiotemporal trajectory of Navier-Stokes turbulence in a finite but long enough interval of time, we give some numerical evidences that the Navier-Stokes equations admit distinct global solutions from almost the same initial conditions whose difference is very small, i.e. even at the order $10^{-40}$ of magnitude. Hopefully these examples could provide some enlightenments for the uniqueness and existence of Navier-Stokes equations, which are related to one Millennium Prize Problem of Clay Institute.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12657v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Tapio Kurkinen",
      "Qing Liu"
    ],
    "title": "Quantitative stability for quasilinear parabolic equations",
    "abstract": "We examine the stability of a class of quasilinear parabolic partial differential equations under perturbations. We are interested in the behavior of viscosity solutions as the perturbation parameter vanishes and establish explicit convergence rates by adapting standard comparison arguments. Despite the possible singular or degenerate nature of the parabolic operator, our framework covers, in particular, both the normalized and the variational $p$-parabolic equations, providing quantitative estimates for perturbations of the exponent $p$ and limits arising from regularized approximations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12644v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Matthew Ryan",
      "Michael T. Schultz"
    ],
    "title": "Line congruences associated to Appell's hypergeometric functions of rank-4",
    "abstract": "Line congruences - two-parameter families of lines in projective 3-space - are the genesis of many beautiful examples of transformations of surfaces, such as the Laplace transform. This subject is less well-known today than in previous generations. We survey and review results related to projective differential geometry of surfaces, line congruences, and close connections to linear systems of PDEs of finite type whose solutions define the data of an immersion of a surface into projective 3-space. We then derive formulae for the Laplace transform of the entire rank-4 linear system associated to such an immersed surface, obtaining explicit formulae for the rank-4 systems that define the Laplace transformed surfaces. We apply our results to study the geometry of surfaces defined by Appell's hypergeometric functions of rank-4, namely the functions $F_2$ and $F_4$. We show that the sequence of Laplace invariants for each is determined respectively by the Euler-Poisson-Darboux equation in the case of $F_2$, and Darboux's Harmonic equation in the case of $F_4$. Further, we show that for all parameter values of the hypergeometric functions, the natural line congruences generated by the Laplace transforms of the surfaces determined by either $F_2$ or $F_4$ constitute a $W$-congruence, an important example of line congruence.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12614v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Tian Zhang",
      "Zhirong Su",
      "Yueyi Dong"
    ],
    "title": "Secure Beamforming for ISAC Systems Under Communication Eavesdropper and Sensing Eavesdropper",
    "abstract": "Due to great efficiency improvement in resource and hardware space, integrated sensing and communication (ISAC) has gained much attention. In the paper, the physical layer security (PLS) of ISAC system under communication eavesdropper together with sensing eavesdropper is investigated. The system secrecy rate is maximized by transmit beamforming design of communication and sensing signals when taking sensing security, sensing performance and transmit power constraint into consideration. To deal with the formulated non-convex optimization problem, the successive convex approximation (SCA) together with the first-order Taylor expansion and semidefinite relaxation (SDR) is utilized. Additionally, it is theoretically validated that the SDR does not yield sub-optimality in the paper. Thereafter, an iterated joint secure beamforming algorithm against communication and sensing eavesdroppers is proposed. Simulation results validate the effectiveness and advance of the proposed scheme.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12602v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "He Sun",
      "Lipeng Zhu",
      "Jie Xu",
      "Rui Zhang"
    ],
    "title": "Channel Gain Map Reconstruction Based on Virtual Scatterer Model",
    "abstract": "This paper proposes an efficient method for modeling and reconstructing the channel gain map (CGM) based on virtual scatterers. Specifically, we develop a virtual scatterer model to characterize the channel power gain distribution in three-dimensional (3D) space, by capturing the multi-path propagation environment structure and exploiting the angular-domain spatial correlation of scatterer response. In this model, the CGM is represented as a function over a set of tunable parameters for virtual scatterers, including their number, positions, and scatterer response coefficients (SRCs), which can be estimated from a limited number of channel power gain measurements at a given set of locations within the region of interest. This new representation offers a flexible and scalable modeling framework for efficient and accurate CGM reconstruction. Furthermore, we propose a progressive estimation algorithm to acquire the scatterers' parameters. In this algorithm, we gradually increase the number of virtual scatterers to balance the computational complexity and estimation accuracy. In addition, by exploiting the spatial correlation of scatterer response, we propose a Gaussian process regression (GPR)-based inference method to predict the SRCs that cannot be directly estimated. Finally, ray-tracing-based simulation results under realistic physical environments validate the effectiveness of the proposed method, demonstrating that it achieves higher reconstruction accuracy compared to conventional CGM estimation approaches.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12512v1",
    "categories": [
      "math-ph",
      "math.FA",
      "math.OA"
    ],
    "authors": [
      "Jui-Hui Chung",
      "Jacob Shapiro"
    ],
    "title": "Topological Classification of Insulators: III. Non-interacting Spectrally-Gapped Systems in All Dimensions",
    "abstract": "We study non-interacting electrons in disordered materials which exhibit a spectral gap, in each of the ten Altland-Zirnbauer symmetry classes, in all space dimensions. We define an appropriate space of Hamiltonians and a topology on it so that the so-called strong topological invariants become complete invariants yielding the Kitaev periodic table, but now derived as the set of path-connected components of the space of Hamiltonians, rather than as $K$-theory groups. We thus confirm the conjecture regarding a one-to-one correspondence between topological phases of gapped non-interacting systems and the respective Abelian groups $\\{0\\},\\mathbb{Z},2\\mathbb{Z},\\mathbb{Z}_2$ in the spectral gap regime. We do this by providing the appropriate notion of locality, as well as a novel, so-called bulk non-triviality, which together reproduce the Kitaev table. Once the natural definitions are identified, the main technical achievement is lifting $K$-theory calculations to $π_0$ of unitaries and projections.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12511v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yi-Long Luo",
      "Jing-Xin Nie"
    ],
    "title": "Global renormalized solutions for hard potential non-cutoff Boltzmann equation without defect measure",
    "abstract": "The existence of global renormalized solutions to the Boltzmann equation with long-range interactions without angular cutoff was first established by Alexandre and Villani [Comm. Pure Appl. Math., 55(1), 30-70, 2002]. Their result relies on a definition of renormalized solutions involving a non-negative defect measure. In this paper, we address this issue for the inverse power law model in the case of hard potentials ($0 \\leq γ\\leq 1$). By exploiting the stronger coercivity estimates provided by hard potentials, we prove that the defect measure actually vanishes. Consequently, we establish the global existence of renormalized solutions for the non-cutoff Boltzmann equation with hard potentials in the standard sense, without any defect measure. Finally, we construct a counterexample showing that the approach developed for the hard potential case fails for soft potential model ($-3 < γ< 0$).",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12505v1",
    "categories": [
      "math.RA",
      "math.CT"
    ],
    "authors": [
      "Abhishek Banerjee",
      "Surjeet Kour"
    ],
    "title": "Coalgebra measurings, cyclic theory and homologies of matrix algebras",
    "abstract": "In this paper, we consider coalgebra measurings and the maps induced by them between Hochschild and cyclic homology of algebras. We show that these induced maps are well behaved with respect to the various structures appearing on Hochschild and cyclic homology, such as the $λ$-decomposition, the product structure, as well as the module structure of Hochschild homology over cyclic homology. Thereafter, we relate the maps between homology theories of algebras induced by a coalgebra measuring to those induced between homologies of matrix algebras. This is done in the following contexts: (a) cyclic homology and the primitive part of Lie algebra homology of the matrix algebra, (b) Hochschild homology and the primitive part of Leibniz homology of the matrix algebra, and (c) Dihedral homology of an involutive algebra and the primitive part of Lie algebra homology of symplectic or skew symmetric matrices.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12456v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Jinlong Wei",
      "Junhao Hu",
      "Guangying Lv",
      "Chenggui Yuan"
    ],
    "title": "Strong solutions and sharp Euler--Maruyama approximations for SDEs with Lebesgue--Dini drift",
    "abstract": "We investigate the strong approximation of stochastic differential equations whose drift is square-integrable in time and Dini continuous in space, while the diffusion coefficient is non-constant and uniformly elliptic. Using a refined Itô--Tanaka trick combined with parabolic regularity estimates, we first establish strong well-posedness and the stochastic flow property. Under additional Lipschitz regularity of the diffusion matrix, we then analyze a polygonal-type Euler--Maruyama scheme and prove the strong error estimate \\[ \\Big\\|\\sup_{0\\le t\\le1}|X_t-X_t^n|\\Big\\|_{L^p(Ω)} \\le C n^{-\\frac12}\\log(n)^{\\frac32}, \\quad p\\ge2. \\] We further show that this rate is sharp: even under smooth and uniformly elliptic diffusion coefficients with vanishing drift, the convergence order $1/2$ cannot be improved. These results provide the first sharp quantitative strong convergence estimates in a Lebesgue--Dini drift framework.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12451v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Andrey L. Shilnikov answered Leonid P. Shilnikov"
    ],
    "title": "On a stable torus in a 3D system with a saddle-focus",
    "abstract": "This paper proposes a conceptual model for the onset of a stable torus near a saddle-focus equilibrium. This bifurcation scenario is typical of slow-fast systems that generate elliptic bursting in a variety of neuronal models in mathematical neuroscience. Variants of the model also capture other dynamical regimes recurring in a neighborhood of the saddle-focus. We also discuss homoclinic bifurcations for which the model assumptions are feasible.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12412v1",
    "categories": [
      "math.QA",
      "math-ph",
      "math.AT",
      "math.GT"
    ],
    "authors": [
      "Kevin Costello",
      "John Francis",
      "Owen Gwilliam"
    ],
    "title": "Chern-Simons factorization algebras and knot polynomials",
    "abstract": "This work identifies the Reshetikhin-Turaev invariant of links in terms of a trace map on factorization homology. In particular, to recover the knot invariants associated to Chern-Simons theories, we construct a filtered $\\mathcal{E}_3$-algebra $\\mathcal{A}^λ$ by BV quantization of Chern-Simons theory for a semi-simple Lie algebra ${\\frak g}$ with invariant pairing~$λ$, and we prove that a finite-dimensional representation $V$ of the Drinfeld-Jimbo quantum group $U_\\hbar{\\frak g}$ defines a perfect $\\mathcal{A}^λ$ module~$\\mathcal{V}$. For any framed link $K$ in $\\mathbb{R}^3$, we then prove that there is an equality \\[\\int_{K\\subset\\mathbb{R}^3}{\\rm tr}(V) = Z_V(K\\subset\\mathbb{R}^3) \\] between the factorization homology trace for $V$ and the Reshetikhin-Turaev link invariant determined by~$V$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12404v1",
    "categories": [
      "math.GT",
      "math.QA",
      "math.RT"
    ],
    "authors": [
      "Ben Webster",
      "Meri Zaimi"
    ],
    "title": "Knot contact homology as a planar limit of Chern-Simons theory",
    "abstract": "We prove a conjecture relating augmentation varieties to the large $N$ limit of Chern-Simons theory. Although this does not directly establish that the augmentation polynomial of a knot is the classical limit of a deformed $\\hat{A}$-polynomial -- as suggested by Aganagić and Vafa -- it reduces the problem to characterizing certain algebraic properties of a module over the quantum torus, introduced in work of Gaiotto, Kannagi, and Sanjurjo. We term this the \\emph{HOMFLYPT difference module}, which captures relations between the colored HOMFLYPT polynomials of different antisymmetric colorings. We demonstrate that the classical limit of this difference module for a knot is precisely the degree 0 abelianized knot contact homology of the knot, and we provide a natural extension of this result to links.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12397v1",
    "categories": [
      "math.DS",
      "math.PR"
    ],
    "authors": [
      "Isabella Alvarenga",
      "Daniel Miranda Machado"
    ],
    "title": "Sharkovskiis theorem under small random perturbations",
    "abstract": "We establish a Sharkovskii-type theorem for a class of discrete random dynamical systems via the random Conley index. Using the continuation property of the Conley index, we extend classical forcing results to random systems obtained from small random perturbations of one-dimensional maps. In contrast to earlier measure-theoretic results, which are typically subject to an inherent period-doubling ambiguity (realizing period $n$ or $2n$), our topological approach allows us to detect random periodic points and orbits with precise minimal periods. This yields realisation results for arbitrary finite tails of the Sharkovskii ordering. These results are illustrated by constructing random periodic orbits for perturbed versions of the tent map and the logistic map.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12372v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Akin Scott",
      "Michele Torielli"
    ],
    "title": "Enumerative combinatorics package for CoCoA",
    "abstract": "We introduce the package combinatorics for the software CoCoA. This package provides a data structure and the necessary methods for computing several known enumerative combinatorial invariants.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12366v1",
    "categories": [
      "math.QA",
      "math.RA"
    ],
    "authors": [
      "Gaston Andres Garcia",
      "Josefina Vallejos"
    ],
    "title": "Quantum subgroups of $SL_q(2)$ at roots of unity of arbitrary order",
    "abstract": "We complete the classification of quantum subgroups of $SL_q(2)$ with $q$ a root of unity of arbitrary order, that is, Hopf algebra quotients of the quantum function algebras $\\mathcal{O}_{q} (SL_2(\\mathbb{C}))$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12336v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Shenghao Li"
    ],
    "title": "Base change fundamental lemma for Bernstein centers of principal series blocks",
    "abstract": "Let $G$ be an unramified group over a $p$-adic field $F$. This article introduces a base change homomorphism for the Bernstein center of a principal series block, and proves that two functions related by this base change homomorphism are associated. This result provides new evidence for the conjecture on twisted endoscopic transfer of the stable Bernstein center proposed by T. Haines, which will be applied to a general conjecture on test functions for Shimura varieties due to R. Kottwitz and T. Haines.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12333v1",
    "categories": [
      "math.RT",
      "math.NT"
    ],
    "authors": [
      "Jean-François Dat",
      "Jessica Fintzen"
    ],
    "title": "Parametrization and reduction to depth zero of $\\overline{\\mathbb{Z}}[\\frac{1}{p}]$-blocks of tame $p$-adic groups",
    "abstract": "Let $G$ be a reductive group over a non-archimedean local field $F$ of residue characteristic $p$. We consider pairs $(φ,I)$ consisting of a \"wild inertia\" Langlands parameter $φ: P_F \\longrightarrow \\hat{G}$ whose centralizer $C_{\\hat{G}}(φ)$ is a Levi subgroup of $\\hat{G}$, and a cohomological invariant $I$ whose definition is inspired by the theory of endoscopy. Assuming that $p$ is odd and not a torsion prime of $G$ nor of $\\hat{G}$, we associate to each such pair $(φ,I)$ a Serre subcategory $\\mathrm{Rep}^{φ,I}(G(F))$ of the category of smooth $\\overline{\\mathbb{Z}}[\\frac{1}{p}]$-representations of $G(F)$. Then we construct an equivalence between this Serre subcategory and the category of depth-zero $\\overline{\\mathbb{Z}}[\\frac{1}{p}]$-representations of a twisted Levi subgroup $G_{φ,I}$ of $G$, which is dual to $C_{\\hat{G}}(φ)$. This pattern for reduction to depth zero fits well with the conjectural (categorical) local Langlands correspondence.\n  When $G$ is tamely ramified and $p$ does not divide the order of its Weyl group, then the above Serre subcategories provide the block decomposition of the category of all smooth $\\overline{\\mathbb{Z}}[\\frac{1}{p}]$-representations of $G(F)$. In this case, we thus obtain a reduction-to-depth-zero process for smooth representations of $G(F)$ valued in any algebraically closed field of characteristic different from $p$. When that field has characteristic 0, this recovers some of the recent results of Adler--Fintzen--Mishra--Ohara. When that field is $\\overline{\\mathbb{F}}_{\\ell}$, we use our results together with Zhu's unipotent categorical correspondence to produce a fully faithful embedding of $D\\mathrm{Rep}_{\\overline{\\mathbb{F}}_{\\ell}}(\\mathrm{GL}_{n}(F))$ into a suitable category of coherent sheaves on the moduli space of $n$-dimensional $\\overline{\\mathbb{F}}_{\\ell}$-representations of the Weil group.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12312v1",
    "categories": [
      "math.QA"
    ],
    "authors": [
      "Maneesha Ampagouni",
      "Geoffrey Mason",
      "Michael H. Mertens"
    ],
    "title": "Balanced root systems and a Schellekens-type list for holomorphic vertex operator algebras of central charge $32$",
    "abstract": "We study a special class of holomorphic vertex operator algebras (VOAs) that we call \\emph{balanced}.\\ For a balanced, holomorphic VOA $V=\\mathbb{C}\\mathbf{1}\\oplus V_1\\oplus\\dots$ with $c=32$ or $40$ we show that the Virasoro vectors of $V$ and the subVOA generated by $V_1$ coincide and use this result to provide a Schellekens-type list of possible root systems that may occur.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12297v1",
    "categories": [
      "math-ph",
      "cond-mat.stat-mech",
      "math.ST",
      "physics.data-an"
    ],
    "authors": [
      "Jae Wan Shim"
    ],
    "title": "When Stein-Type Test Detects Equilibrium Distributions of Finite N-Body Systems",
    "abstract": "Starting from the probability distribution of finite N-body systems, which maximises the Havrda--Charvát entropy, we build a Stein-type goodness-of-fit test. The Maxwell--Boltzmann distribution is exact only in the thermodynamic limit, where the system is composed of infinitely many particles as N approaches infinity. For an isolated system with a finite number of particles, the equilibrium velocity distribution is compact and markedly non-Gaussian, being restricted by the fixed total energy. Using Stein's method, we first obtain a differential operator that characterises the target density. Its eigenfunctions are symmetric Jacobi polynomials, whose orthogonality yields a simple, parameter-free statistic. Under the null hypothesis that the data follows the finite-N distribution, the statistic converges to a chi-squared law, so critical values are available in closed form. Large-scale Monte Carlo experiments confirm exact size control and give a clear picture of the power. These findings quantify how quickly a finite system approaches the classical limit and provide a practical tool for testing kinetic models in regimes where normality cannot be assumed.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12800v1",
    "categories": [
      "cs.IT"
    ],
    "authors": [
      "Ran Tamir",
      "Nir Weinberger",
      "Albert Guillén i Fàbregas"
    ],
    "title": "Concatenated Codes for Short-Molecule DNA Storage with Sequencing Channels of Positive Zero-Undetected-Error Capacity",
    "abstract": "We study the amount of reliable information that can be stored in a DNA-based storage system with noisy sequencing, where each codeword is composed of short DNA molecules. We analyze a concatenated coding scheme, where the outer code is designed to handle the random sampling, while the inner code is designed to handle the random sequencing noise. We assume that the sequencing channel is symmetric and choose the inner coding scheme to be composed by a linear block code and a zero-undetected-error decoder. As a byproduct, the resulting optimal maximum-likelihood decoder land itself for an amenable analysis, and we are able to derive an achievability bound for the scaling of the number of information bits that can be reliably stored. As a result of independent interest, we prove that the average error probability of random linear block codes under zero-undetected-error decoding converges to zero exponentially fast with the block length, as long as its coding rate does not exceed some critical value, which is known to serve as a lower bound to the zero-undetected-error capacity.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12762v1",
    "categories": [
      "math.AG",
      "cs.CC"
    ],
    "authors": [
      "Matěj Doležálek",
      "Mateusz Michałek"
    ],
    "title": "Nonlinear methods for tensors: determinantal equations for secant varieties beyond cactus",
    "abstract": "We present a family of flattening methods of tensors which we call Kronecker-Koszul flattenings, generalizing the famous Koszul flattenings and further equations of secant varieties studied among others by Landsberg, Manivel, Ottaviani and Strassen. We establish new border rank criteria given by vanishing of minors of Kronecker-Koszul flattenings. We obtain the first explicit polynomial equations -- tangency flattenings -- vanishing on secant varieties of Segre variety, but not vanishing on cactus varieties. Additionally, our polynomials have simple determinantal expressions. As another application, we provide a new, computer-free proof that the border rank of the $2\\times2$ matrix multiplication tensor is $7$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12729v1",
    "categories": [
      "math.FA",
      "math-ph",
      "quant-ph"
    ],
    "authors": [
      "Mohsen Kian"
    ],
    "title": "Fractional $k$-positivity: a continuous refinement of the $k$-positive scale",
    "abstract": "We introduce a real-parameter refinement of the classical integer hierarchies underlying Schmidt number, block-positivity, and $k$-positivity for maps between matrix algebras. Starting from a compact family of $α$-admissible unit vectors ($α\\in[1,d]$), we define closed cones $\\mathsf K_α$ of bipartite positive operators that interpolate strictly between successive Schmidt-number cones, together with their dual witness cones. Via the Choi--Jamiołkowski correspondence this yields a matching filtration of map cones $\\mathsf P_α$, recovering the usual $k$-positive/$k$-superpositive classes at integer parameters and complete positivity at the top endpoint.\n  Two results show that the fractional levels capture genuinely new structure. First, we prove a \\emph{fractional Kraus theorem}: $α$-superpositive maps are precisely the completely positive maps admitting a Kraus decomposition whose Kraus operators satisfy an explicit singular-value (Ky--Fan) constraint, extending the classical rank-$k$ characterization. Second, for non-integer $α$ the cones $\\mathsf P_α$ fail stability under CP post-composition, highlighting a sharp structural transition away from the integer theory. Finally, we derive sharp thresholds on canonical symmetric families (including the depolarizing ray and the isotropic slice), turning familiar stepwise criteria into continuous, computable profiles.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12713v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Gérard Letac",
      "Mauro Piccioni",
      "Jacek Wesołowski"
    ],
    "title": "GIG random matrices and a Yang-Baxter extension of the Matsumoto-Yor property",
    "abstract": "Sasada and Uozumi, \\cite{SasUoz2024}, identified independence preserving $[2:2]$ quadrirational parametric Yang-Baxter maps, see \\eqref{YBEQ}, on $(0,\\infty)$. In particular, the map denoted there by $H_{III,B}^{(α,β)}$, see \\eqref{CS}, was connected to the independence preserving property of the GIG distributions on $(0,\\infty)$. Remarkably, the property appears also naturally in probabilistic integrable models of discrete Korteweg de Vries type, as observed by Croydon and Sasada, \\cite{CroSas2020}. In the case of $(α,β)=(1,0)$ the independence reduces to the classical Matsumoto-Yor property, \\cite{MatYor2001}. In \\cite{LetWes2024} we proposed an extension of $H_{III,B}^{(α,β)}$ to a map on the cone of symmetric positive definite matrices of a fixed dimension, showing that such extended map preserves independence of GIG random matrices. In the present paper we prove two results: (i) the matrix GIG distributions are characterized by the independence property governed by this map; (ii) the matrix variate extension of $H_{III,B}^{(α,β)}$ we use, is a parametric Yang-Baxter map.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12699v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Sudeshna Basu",
      "Priyanka Priyadarshini Behera",
      "Susmita Seal"
    ],
    "title": "Semi denting points and related notions in Banach spaces",
    "abstract": "In this work, we study the stability properties of semi denting, semi PC, and semi SCS points, as well as their $w^*$-analogues, in Banach spaces, with respect to $l_p$-sums ( $1\\leq p \\leq \\infty),$ ideals, and projective tensor products.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12692v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Andrew Lobb"
    ],
    "title": "Khovanov concordance minima and the (4,5) torus knot",
    "abstract": "Ribbon concordance gives a partial order on knot types, and applying a knot homology functor to a ribbon concordance gives an inclusion of the homologies. The question of the existence of global ribbon minima in each concordance class is a generalization of the slice-ribbon conjecture, which asserts that the unknot is the global minimum in its class. We show that the (reduced rational) Khovanov homology of the (4,5) torus knot is a summand in the Khovanov homology of any knot in its concordance class.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12672v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Emma Yu Jin",
      "Xiaowei Lin"
    ],
    "title": "Combinatorial formulas for symmetric Macdonald polynomials by superizations",
    "abstract": "In this paper, we derive new combinatorial formulas for symmetric Macdonald polynomials $P_λ(X;q,t)$ and integral Macdonald polynomials $J_λ(X;q,t)$, in terms of several new statistics and the major index for a partition $λ$. Moreover, three existing formulas for symmetric Macdonald polynomials established by Corteel--Mandelshtam--Williams (2022), Corteel--Haglund--Mandelshtam--Mason--Williams (2022) and Mandelshtam (2025) are recovered. Our proof relies on a new statistic on super fillings, employing the superization formula of Ayyer--Mandelshtam--Martin (2023) and our recent approach to modified Macdonald polynomials.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12637v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Guodong Tang",
      "Chen Wan",
      "Lei Zhang"
    ],
    "title": "Anomaly-free Hyperspherical Hamiltonian spaces for simple reductive groups",
    "abstract": "In this paper, we provide a complete list of anomaly-free hyperspherical Hamiltonian spaces for simple reductive groups, as well as their conjectural dual spaces in the sense of BZSV duality.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12626v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Rahul Garg",
      "Sundaram Thangavelu"
    ],
    "title": "Quantum Hermite functions and Fourier Transform of operators",
    "abstract": "We construct operator analogues of Hermite functions which form an orthonormal basis for the Hilbert space $ \\mathcal{S}_2$ of Hilbert-Schmidt operators on $ L^2(\\R^n).$ We use this orthonormal basis to define Fourier transform on $ \\mathcal{S}_2 $ and study some of its basic properties.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12623v1",
    "categories": [
      "math.CO",
      "math.AC",
      "math.RT"
    ],
    "authors": [
      "Hai Zhu"
    ],
    "title": "Plethysm and orbit harmonics",
    "abstract": "Let $Π_{(b^a)}$ be the locus of unordered set partitions of $[ab]$ with $a$ blocks of size $b$. We embed unordered set partitions of $[n]$ into the affine space $\\mathbb{C}^{\\binom{[n]}{2}}$ with coordinate ring $\\mathbb{C}\\Big[\\mathbf{x}_{\\binom{[n]}{2}}\\Big]$. Then, we apply orbit harmonics to $Π_{(2^a)}$ and $Π_{(a^2)}$, yielding graded $\\mathfrak{S}_{2a}$-modules whose graded character formulae respectively refine the Schur expansions of $h_a[h_2]$ and $h_2[h_a]$ according to $λ_1$. We further extend this $λ_1$-separation phenomenon to quotients of $\\mathbb{C}^{\\binom{[n]}{2}}$ where $n$ is odd. Combining $Π_{(b^a)},Π_{(a^b)}$ and orbit harmonics, we propose a conjecture related to Foulkes' conjecture, and we prove the special case $b=2$. We also apply orbit harmonics to the locus $Π_{n,m}$ of unordered set partitions of $[n]$ without blocks of size greater than $m$, yielding a graded $\\mathfrak{S}_n$-module $R(Π_{n,m})$. We determine the standard monomial basis of $R(Π_{n,m})$ with respect to any monomial order, as well as its graded character formula.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12619v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Yoshikazu Giga",
      "Sho Katayama"
    ],
    "title": "Asymptotically self-similar graph-like solutions to a multi-dimensional surface diffusion flow equation under contact angle and no-flux boundary conditions",
    "abstract": "This paper studies Mullins' model of thermal grooving which consists of a surface diffusion flow equation with contact angle and no-flux boundary conditions. We consider this problem in a multi-dimensional half space and prove that if the slope of the initial data is close to that consistent with the contact angle, then there exists a unique global-in-time solution. In particular, we show the existence of a self-similar solution for a given behavior at the space infinity. We also show that our global solution converges to a self-similar solution as the time tends to infinity if the initial data is asymptotically homogeneous at the space infinity. No assumption on the size of the contact angle is imposed.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12494v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Mario DeFranco"
    ],
    "title": "On recurrence relations arising from NRS(2) applied to a cubic polynomial",
    "abstract": "We prove that the leading coefficient of the \"error\" terms of NRS(2) applied to a cubic polynomial $f(z)$ with starting point $(-\\frac{a_1}{a_2}, -\\frac{a_1}{a_2})$ are positive-coefficient rational functions in the zeros of $f(z)$. We express these terms as a sum over combinatorial objects which we call radius-value trees.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12493v1",
    "categories": [
      "math.QA",
      "math-ph"
    ],
    "authors": [
      "Andrzej Borowiec",
      "Patryk Mieszkalski"
    ],
    "title": "Bicovariant Codifferential Calculi",
    "abstract": "We develop a technique for studying first-order codifferential calculi initiated by Doi and Quillen in the context of cyclic cohomology. Introducing the concept of first-order codifferential calculi (FOCCs) for a given coalgebra, we can show that their classification can be reduced to the classification of subbicomodules in the universal bicomodule. For completing this task, the role of one-dimensional generating spaces (a.k.a. singletons) is found to be useful. We are particularly interested in classifying bicovariant codifferential calculi, which we define over Hopf algebras. This, in turn, can be reduced to classifying Yetter-Drinfeld submodules. We argue that such codifferential calculi are better suited to Drinfeld-type quantized enveloping algebras, as they are dual to Woronowicz calculi for matrix quantum groups. Some classification results are presented in numerous examples.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12467v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Taylan Demir",
      "Niaz Ali Shah"
    ],
    "title": "State dependent delay differential equations with distributed memory",
    "abstract": "We investigate state dependent delay differential equations with distributed memory, combining discrete state dependent delays and a convolution type memory operator. Under Lipschitz type assumptions on the delay, kernel, and nonlinear term, we establish local well posedness using a fixed point argument in a Banach space of histories. The distributed memory operator is shown to be locally Lipschitz, ensuring existence and uniqueness. As a benchmark, we analyze a logistic model with a Gamma distributed memory kernel of order two. The convolution term is reduced to a finite dimensional form, yielding an explicit characteristic equation and closed form Hopf bifurcation threshold and frequency. The results show that higher order memory kernels may induce oscillatory dynamics, unlike purely exponential memory, and provide a rigorous framework for stability and bifurcation analysis in delay systems with state dependent memory.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12462v1",
    "categories": [
      "math.GT",
      "math.NT"
    ],
    "authors": [
      "Pierre Lochak",
      "Hiroaki Nakamura",
      "Leila Schneps"
    ],
    "title": "The Grothendieck-Teichmüller group $\\widehat{GT}$ acts on the genus $g$ mapping class group with $0$ or $1$ marked point",
    "abstract": "The goal of this article is to prove that the Grothendieck-Teichmüller group $\\widehat{GT}$ acts on $\\widehatΓ_{g,0}$ and $\\widehatΓ_{g,1}$,the (full) profinite genus $g$ mapping class group with $0$ or $1$ marked point, for every $g>0$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12455v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "M. H. Alizadeh",
      "F. Lara"
    ],
    "title": "Existence Results and KKT Optimality Conditions for Generalized Quasiconvex Functions",
    "abstract": "We studied a new notion of generalized convex functions called $e$-quasi\\-con\\-ve\\-xi\\-ty, which encompasses both quasiconvex and $e$-convex functions, including all Lipschitz functions. By extending the standard properties of quasiconvex functions to $e$-quasiconvex functions, we establish sufficient conditions for the nonemptiness and compactness of the solution set when minimizing an $e$-quasiconvex function, leveraging generalized asymptotic functions, a result which remains applicable even when the set of minimizers is nonconvex. Furthermore, in the differentiable case, we ensure the sufficiency of the KKT optimality conditions when the constraint functions in the mathematical programming problems are $e$-quasiconvex. Finally, we illustrate our new results with several nonconvex (non-quasiconvex) examples.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12453v1",
    "categories": [
      "math.CA",
      "math.AP"
    ],
    "authors": [
      "Gaik Ambartsoumian",
      "Raluca Felea",
      "Venkateswaran P. Krishnan",
      "Clifford J. Nolan",
      "Eric Todd Quinto"
    ],
    "title": "Microlocal analysis of Radon transforms over quadric surfaces",
    "abstract": "We study the microlocal properties of generalized Radon transforms over a family of quadric hypersurfaces whose centers lie on an orientable hypersurface $S$. The quadric surfaces we consider are level sets of the quadratic form associated to a symmetric, invertible matrix $A$, with real entries. We study the singularities of the right and left projections of the canonical relation associated with these operators and show that they are determined by the signature of the matrix $A$ and the hypersurface $S$. If the matrix is positive/negative definite (i.e., the surface of integration is an ellipsoid) and $S$ is strictly convex, we prove that the singularities are folds. If the matrix is indefinite (i.e., the surface of integration is a hyperboloid-type quadric) and $S$ is either strictly convex or a cylinder, then cusp, fold, or blowdown singularities are present. We also study the case when the surface of integration is a paraboloid and show that the Bolker condition is satisfied.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12399v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "M. Oliveira"
    ],
    "title": "Periodic Shadowing for Set-Valued Maps",
    "abstract": "We study shadowing-type properties for set-valued dynamical systems. In particular, we investigate the periodic shadowing property and its relationship with expansivity and chain transitivity. We establish that for positively expansive set-valued maps on compact metric spaces, the shadowing property implies the periodic shadowing property. Furthermore, we show that for chain transitive maps, periodic shadowing implies both shadowing and topological transitivity. We also present a general construction of set-valued maps with shadowing arising from single-valued systems admitting an isometric involution. Several examples, including systems from symbolic dynamics, are provided to illustrate the theory.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12371v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Meselem Karras"
    ],
    "title": "On the Mean Value of $D_k(n)$ in Arithmetic Progressions",
    "abstract": "Let $k \\ge 2$ be a fixed integer. We define the multiplicative function $D_k(n) = d_k(n)/d_k^*(n)$, such that $d_k(n)$ is the Piltz divisor function and $d_k^*(n) = k^{ω(n)}$ is its unitary analogue, where $ω(n)$ is the number of distinct prime divisors of $n$. We establish an asymptotic formula for the sum\n  \\[\n  \\sum_{\\substack{n \\le x \\\\ n \\equiv a \\pmod q}} D_k(n),\n  \\]\n  where $\\gcd(a,q)=1$. This result is a generalization of the study presented in \\cite{Derbal 2023}.\n  \\noindent",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12365v1",
    "categories": [
      "math.NA",
      "cond-mat.soft"
    ],
    "authors": [
      "Mohit Pundir",
      "Flavio Lorez",
      "David S. Kammer"
    ],
    "title": "A versatile FEM framework with native GPU scalability via globally-applied AD",
    "abstract": "Energy-based finite-element formulations provide a unified framework for describing complex physical systems in computational mechanics. In these energy-based methods, the governing equations can be obtained directly by considering the derivatives of a single global energy functional. While Automatic Differentiation (AD) can be used to automate the generation of these derivatives, current frameworks face a clear trade-off based primarily on the scale upon which the AD method is applied. Globally applied AD offers high expressivity but cannot currently be scaled to large problems. Locally applied AD scales well through traditional assembly methods, but the variety of physics and couplings that the framework can easily represent is more limited than the global approach. Here, we introduce an energy-centric framework tatva (https://github.com/smec-ethz/tatva) that defines the physics of a problem as a single global functional and applies AD globally to generate residual and tangent operators. By leveraging Jacobian-vector products for matrix-free solvers and coloring-based sparse differentiation for materializing sparse tangent stiffness matrices when needed, our flexible design scales linearly with the problem size on GPUs. We demonstrate that our framework can handle large problems (with millions of degrees of freedom) without memory exhaustion. Additionally, it offers a unified, fully differentiable methodology that can address a wide range of problems, including multi-point constraints, mixed-dimensional coupling, and the incorporation of neural networks, while maintaining high performance and scalability on modern GPU architectures.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12362v1",
    "categories": [
      "math.FA",
      "math-ph",
      "math.DG",
      "math.GR"
    ],
    "authors": [
      "Helge Gloeckner",
      "Karl-Hermann Neeb"
    ],
    "title": "Infinite-Dimensional Lie Groups",
    "abstract": "This is a preliminary version of a book on infinite-dimensional Lie groups. It covers the basics of calculus and manifolds in the context of locally convex spaces, based on Bastiani's notion of a smooth map. Starting from this concept, we develop the basics of smooth manifolds and define Lie groups as manifolds with smooth group operations. We discuss in particular several classes of Lie groups, such as regular ones, or those with an exponential function that is a local diffeomorphism. The local theory, subgroups and quotients are explored in some detail. Classes of Lie groups that are discussed in detail include: unit groups of continuous inverse algebras, groups of smooth maps, direct limit groups and groups of diffeomorphism. We also included chapters on the topology of infinite-dimensional Lie group and on various selected topics.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12337v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Shun Li",
      "Yan Jiang",
      "Mengping Zhang",
      "Tao Xiong"
    ],
    "title": "Temporal-Stability-Enhanced and Energy-Stable Dynamical Low-Rank Approximation for Multiscale Linear Kinetic Transport Equations",
    "abstract": "In this paper, we develop an asymptotic-preserving dynamical low-rank method for the multiscale linear kinetic transport equation. The proposed scheme is unconditionally stable in the diffusive regime while preserving the correct asymptotic behavior, and can achieve significant reductions in computational cost through a low-rank representation and large time step stability. A low-rank formulation consistent with the discrete energy is introduced under the discrete ordinates discretization, and energy stability of the resulting scheme is established. Numerical experiments confirm the energy stability and demonstrate that the method is efficient while maintaining accuracy across different regimes and capturing the correct asymptotic limits.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12293v1",
    "categories": [
      "math.OC",
      "eess.SY"
    ],
    "authors": [
      "Ayrton Almada",
      "Laurent Pagnier",
      "Igal Goldshtein",
      "Saif R. Kazi",
      "Michael",
      "Chertkov"
    ],
    "title": "Real-Time Dynamic N-1 Screening: Identifying High-Risk Lines and Transformers After Common Faults",
    "abstract": "Power system operators routinely perform N-1 contingency analysis, yet conventional tools provide limited guidance on which lines or transformers deserve heightened attention during fast post-fault transients. In particular, static screening does not reveal whether (1) the same faulted line repeatedly triggers severe downstream overloads, or (2) a specific transformer emerges as vulnerable across many distinct fault scenarios. This paper introduces a real-time dynamic N-1 screening framework that addresses this gap by estimating, for each counterfactual single-phase transmission fault, the probability of transient overcurrent on critical grid elements. The output is an operator-facing dashboard that ranks (a) faulted lines whose outages most frequently lead to dangerous transformer overloads, and (b) transformers that consistently overload across top-risk scenarios, both of which are actionable indicators for real-time situational awareness. The approach models post-fault electromechanical dynamics using a linear stochastic formulation of the swing equations with short-lived, fault-localized uncertainty, and combines analytic transient evaluation with cross-entropy based importance sampling to efficiently estimate rare but high-impact events. All N-1 contingencies are evaluated in parallel with linear computational complexity. The framework is demonstrated on the IEEE 118-bus system, where it reveals latent high-risk lines and transformers that remain invisible under deterministic dynamic or static N-1 analysis. Results show orders-of-magnitude computational speedup relative to brute-force Monte Carlo, enabling practical deployment within real-time operational cycles.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12434v1",
    "categories": [
      "math.DS"
    ],
    "authors": [
      "Abdullah Ahmed",
      "Maria Cameron",
      "Antonio Palacios",
      "Hengyuan Qi",
      "Samir Sahoo"
    ],
    "title": "Effects of Heterogeneity in Two-Cell Feedforward Networks",
    "abstract": "As the need for higher performance from biological and electronic sensors continues to outpace current technologies, new strategies for designing, developing, and implementing novel sensor systems are emerging. A recently introduced feedforward network-based approach can simultaneously enhance a signal while steering a radiating beam in radio frequency communication systems. Furthermore, the approach is also model-independent, thus making it suitable for other applications. In this work, we aim to understand the effects of inhomogeneities in feedforward arrays, which are inevitable in real-world implementations. We investigate a collection of two-cell feedforward networks composed of pitch-fork cells and Stuart-Landau oscillators and quantify the effects of parameter inhomogeneities using system reduction, analytical and computational bifurcation analyses, and a singularity theory approach. Contrary to common intuition, inhomogeneity in the excitation parameter can be exploited to enhance the network output growth rate. While frequency inhomogeneity in Stuart-Landau networks primarily has an adverse effect on signal amplification, phase locking persists over a surprisingly broad range of inhomogeneity.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13157v1",
    "categories": [
      "math.OC",
      "cs.RO",
      "eess.SY"
    ],
    "authors": [
      "Sean Bowerfind",
      "Matthew R. Kirchner",
      "Gary Hewer"
    ],
    "title": "A Data-Driven Algorithm for Model-Free Control Synthesis",
    "abstract": "Presented is an algorithm to synthesize the optimal infinite-horizon LQR feedback controller for continuous-time systems. The algorithm does not require knowledge of the system dynamics but instead uses only a finite-length sampling of arbitrary input-output data. The algorithm is based on a constrained optimization problem that enforces a necessary condition on the dynamics of the optimal value function along any trajectory. In addition to calculating the standard LQR gain matrix, a feedforward gain can be found to implement a reference tracking controller. This paper presents a theoretical justification for the method and shows several examples, including a validation test on a real scale aircraft.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13109v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Lise Fonteyne",
      "Willem Veys"
    ],
    "title": "On a Generalized Monodromy Conjecture for Curves using Differential Forms",
    "abstract": "Motivic and topological zeta functions are singularity invariants, mainly associated to a function $f$ and a top differential form $ω$ on a smooth variety. When $ω$ is the standard form $dx_1\\wedge \\dots \\wedge dx_n$ on affine $n$-space, the monodromy conjecture states that poles of these zeta functions should induce monodromy eigenvalues of $f$. We study natural generalized statements of the monodromy conjecture for functions $f$ on complex surface germs; more precisely on singular surfaces for forms $ω$ that generalize the standard form, and on the affine plane for forms $ω$ that are intrinsically associated to $f$.\n  For all cases, we provide counterexamples to the statement. In addition, when the intrinsically associated $ω$ is given by the generic polar of $f$, we discover a relation between the poles of the zeta functions and the intersection behaviour of the polar curve.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13039v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Carles Checa",
      "Ioannis Emiris",
      "Christos Konaxis"
    ],
    "title": "A sparse overview on sparse resultants",
    "abstract": "In this survey, we give an overview of advances in the theory and computation of sparse resultants. First, we examine the construction and proof of the Canny-Emiris formula, which gives a rational determinantal formula. Second, we discuss and compare the latter with the computation of the sparse resultant as the determinant of the Koszul complex given by $n + 1$ nef divisors in a toric variety. Finally, we cover techniques for computing the Newton polytope of sparse resultants.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13025v1",
    "categories": [
      "math.AP"
    ],
    "authors": [
      "Ali Taheri"
    ],
    "title": "Nonlinear Diffusion, and Geometric and Functional Inequalities on Smooth Metric Measure spaces",
    "abstract": "This extended abstract is based on a talk given at the workshop and summer school ``Direct and Inverse Problems with Applications\" in Ghent Analysis and PDE Centre in August 2024. It focuses on nonlinear diffusion equations of slow and fast types and their links with some geometric and functional inequalities in the framework of smooth metric measure spaces. The article presents some introduction in a summer school style as well as several new results.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13001v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Chen Wang",
      "He-Xia Ni"
    ],
    "title": "A supercongruence related to Whipple's ${}_5F_4$ formula and Dwork's dash operation",
    "abstract": "We establish a parametric supercongruence related to Whipple's ${}_5F_4$ formula and Dwork's dash operation. As a typical consequence, we obtain the following result: for any prime $p\\equiv3\\pmod4$ and odd integer $r\\geq1$, $$ \\sum_{k=0}^{p^r-1}(8k+1)\\frac{(\\frac14)_k^3(\\frac12)_k}{(1)_k^3(\\frac34)_k}\\equiv 3p^r+\\frac{27p^{3r}}{4}H_{(p^r-3)/4}^{(2)}\\pmod{p^{r+3}}, $$ where $(x)_n=x(x+1)\\cdots(x+n-1)$ is the Pochhammer symbol and $H_n^{(2)}=\\sum_{k=1}^n\\frac{1}{k^2}$ is the $n$-th harmonic number of order $2$. This confirms a conjecture of Guo and Zhao [Forum Math. 38 (2026), 1099-1109]. Our proof rely on a new parametric WZ pair which allows us to transform the original sum to a computable form in the sense of congruence. Another essential ingredient of our proof involves the properties of Dwork's dash operation.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12926v1",
    "categories": [
      "math.CO",
      "cs.DM"
    ],
    "authors": [
      "Karolina Drabik",
      "Maël Dumas",
      "Nikolas Mählmann",
      "Wojciech Przybyszewski",
      "Szymon Toruńczyk"
    ],
    "title": "Flips and Merge-Width in Sparse Graphs",
    "abstract": "A flip of a graph is obtained by complementing the edge relation within a set of vertices. Flips are typically used to separate vertices in a graph, by increasing the distances between them. We show that in $K_{t,t}$-free graphs, every short sequence of flips can be simulated by a short sequence of vertex deletions that achieves a similar degree of separation: distances in the resulting graph are, up to a factor of three, at least as large as those obtained after the flips.\n  This result provides a simple and uniform explanation of an emerging pattern in structural graph theory and finite model theory: the $K_{t,t}$-free fragment of a tameness notion for dense graphs often coincides with a tameness notion for sparse graphs. As immediate applications, we recover the following known equivalences. In the $K_{t,t}$-free setting, the dense notions (1) bounded shrub-depth, (2) bounded clique-width, (3) bounded flip-width, (4) monadic dependence, respectively, coincide with the sparse notions (1) bounded tree-depth, (2) bounded tree-width, (3) bounded expansion, and (4) no-where dense-ness.\n  Furthermore, we reprove the result by Dreier and Toruńczyk (STOC 2025) stating that $K_{t,t}$-free classes of bounded merge-width have bounded expansion. Our proof provides explicit bounds and is direct, as it shows how to construct strong coloring orders (witnesses of bounded expansion) from merge sequences (witnesses of bounded merge-width).\n  Along the way, we identify a new family of graph parameters, dubbed separation-width, that is sandwiched between the strong and weak coloring numbers, and is closely related to the merge-width parameters. We provide evidence that this family of graph parameters, apparently overlooked in the literature, may play a fundamental role in the study of sparse graphs.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12884v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Geovane C. Brito",
      "Marcus A. M. Marrocos"
    ],
    "title": "On the generic Simplicity of the spectrum for Connection Laplacian and $G$-simplicity on Principal Bundles",
    "abstract": "In this paper, we prove that, for a residual set of $C^{k}$ connections defined on a smooth vector bundle $E \\to M$, all eigenvalues of the connection Laplacian operator $\\mathscr{L}$, acting on the space of sections of $E$, are simple. As an application, we prove that all eigenvalues of the Laplace-Beltrami operator on a compact $G$-principal bundle $P \\to M$ are $G$-simple.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12872v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Shuo Ling",
      "Wenjun Ying",
      "Zhen Zhang"
    ],
    "title": "Neural Evolutionary Kernel Method: A Knowledge-Guided Framework for Solving Evolutionary PDEs",
    "abstract": "Numerical solution of partial differential equations (PDEs) plays a vital role in various fields of science and engineering. In recent years, deep neural networks (DNNs) have emerged as a powerful tool for solving PDEs, leveraging their approximation capabilities to handle complex domains and high-dimensional problems. Among these, operator learning has gained increasing attention by learning mappings between function spaces using DNNs. This paper proposes a novel approach, termed the Neural Evolutionary Kernel Method (NEKM), for solving a class of time-dependent partial differential equations (PDEs) via deep neural network (DNN)-based kernel representations. By integrating boundary integral techniques with operator learning, prior mathematical information of time-dependent partial differential equations (PDEs) is embedded into the design of neural network architectures for predicting their solutions, enhancing both computational efficiency and solution accuracy. Numerical experiments on the heat, wave, and Schrödinger equations demonstrate that the Neural Evolutionary Kernel Method (NEKM) achieves high accuracy and favorable computational efficiency. Furthermore, the operator learning framework inherently supports the simultaneous prediction of solutions to multiple PDEs with different coefficients, rendering its capability for solving random PDEs.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12868v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Tomasz Kobos",
      "Marin Varivoda"
    ],
    "title": "A Complex Analogue of Spencer's Six Standard Deviations Theorem and the Complex Banach-Mazur Distance",
    "abstract": "We investigate a complex analogue of Spencer's Six Standard Deviations Theorem. Specifically, we propose the following conjecture: for any dimension $n \\geq 2$, given vectors $a_1, \\ldots, a_n \\in \\mathbb{C}^n$ satisfying $\\|a_i\\|_{\\infty} \\leq 1$ for each $i=1, \\ldots, n$, there exists a vector $x \\in \\mathbb{C}^n$ with all coordinates of modulus one such that $|\\langle x, a_i \\rangle| \\leq \\sqrt{n}$ for every $i=1, \\ldots, n$. The bound of $\\sqrt{n}$ is sharp, as demonstrated by the row vectors of any complex $n \\times n$ Hadamard matrix. Furthermore, if the conjecture holds in dimension $n$, it implies that the Banach--Mazur distance between the complex $\\ell_1^n$ and $\\ell_{\\infty}^n$ spaces is equal to $\\sqrt{n}$. We prove the conjecture for $n =2, 3$, thereby establishing also that $d_{BM}(\\ell_1^n, \\ell_{\\infty}^n) = \\sqrt{n}$ for these dimensions. Additionally, we propose a conjecture about the Banach--Mazur distances between complex $\\ell_p^n$ spaces and we verify it for $n=2$. This leads to a complete determination of all possible Banach--Mazur distances between complex $\\ell_p^2$ spaces.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12866v1",
    "categories": [
      "cs.IT",
      "cs.LG",
      "eess.IV",
      "eess.SP"
    ],
    "authors": [
      "Andriy Enttsel",
      "Vincent Corlay"
    ],
    "title": "Model-Aware Rate-Distortion Limits for Task-Oriented Source Coding",
    "abstract": "Task-Oriented Source Coding (TOSC) has emerged as a paradigm for efficient visual data communication in machine-centric inference systems, where bitrate, latency, and task performance must be jointly optimized under resource constraints. While recent works have proposed rate-distortion bounds for coding for machines, these results often rely on strong assumptions on task identifiability and neglect the impact of deployed task models. In this work, we revisit the fundamental limits of single-TOSC through the lens of indirect rate-distortion theory. We highlight the conditions under which existing rate-distortion bounds are achievable and show their limitations in realistic settings. We then introduce task model-aware rate-distortion bounds that account for task model suboptimality and architectural constraints. Experiments on standard classification benchmarks confirm that current learned TOSC schemes operate far from these limits, highlighting transmitter-side complexity as a key bottleneck.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12841v1",
    "categories": [
      "cs.IT",
      "eess.SP",
      "eess.SY"
    ],
    "authors": [
      "Zilin Ge",
      "Ozan Alp Topal",
      "Irshad Ahmad Meer",
      "Pei Xiao",
      "Cicek Cavdar"
    ],
    "title": "EARL: Energy-Aware Adaptive Antenna Control with Reinforcement Learning in O-RAN Cell-Free Massive MIMO Networks",
    "abstract": "Cell-free massive multi-input multi-output (MIMO) promises uniform high performance across the network, but also brings a high energy cost due to joint transmission from distributed radio units (RUs) and centralized processing in the cloud. Leveraging the resource-sharing capabilities of Open Radio Access Network (O-RAN), we propose EARL, an energy-aware adaptive antenna control framework based on reinforcement learning. EARL dynamically configures antenna elements in RUs to minimize radio, optical fronthaul, and cloud processing power consumption while meeting user spectral efficiency demands. Numerical results show power savings of up to 81% and 50% over full-on and heuristic baselines, respectively. The RL-based approach operates within 220 ms, satisfying O-RAN's near-real-time limit, and a greedy refinement further halves power consumption at a 2 s runtime.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12812v1",
    "categories": [
      "math.AG",
      "math.AC"
    ],
    "authors": [
      "Felix Goebler"
    ],
    "title": "Topological and scheme-theoretic properties of the $D$-graded Proj construction",
    "abstract": "We generalize the topological description of the $\\mathbb{N}$-graded Proj construction to the multigraded Proj construction for factorially graded rings that are graded by finitely generated abelian groups $D$. However, there is one big structural difference: While the classical description is given by the space of homogeneous prime ideals not containing the irrelevant ideal, we characterize the multigraded Proj setting using $D$-prime ideals, i.e.\\ ideals that have the prime property, but only for homogeneous factorizations. In particular, we establish a multigraded version of the Nullstellensatz. Additionally, we present algebraic conditions for separability in terms of factorially graded rings, and observe that Proj$^D(S)$ is not separated in many cases. Finally, building on Mayeux-Riche's definition of Serre twists, we give a criterion for their invertibility.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12809v1",
    "categories": [
      "math.DG",
      "math.SG"
    ],
    "authors": [
      "Eugenio Bellini"
    ],
    "title": "Classification of K-contact forms and spectral invariants of their sub-Laplacians",
    "abstract": "A contact form is called K-contact if its Reeb vector field is Killing with respect to some Riemannian metric. In this paper we classify K-contact forms whose Reeb vector field admits at least one non-periodic orbit, on three-dimensional manifolds. We prove that if a compact three-manifold carries such a contact form, then it is diffeomorphic to a lens space and admits exactly two periodic Reeb orbits, whose periods have irrational ratio. We further classify, up to (global) diffeomorphism, these contact forms in terms of the periods of their closed Reeb orbits. We conclude by relating these periods to spectral invariants of the sub-Laplacian, confirming a conjecture of Y. Colin de Verdière in the irregular K-contact case.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13178v1",
    "categories": [
      "math.RA",
      "math.AG",
      "math.QA"
    ],
    "authors": [
      "Vishal Bhatoy",
      "Colin Ingalls"
    ],
    "title": "Discrete Invariants of Koszul Artin-Schelter Regular Algebras of Dimension four",
    "abstract": "We compute the superpotentials for known families of Koszul Artin-Schelter regular algebras of dimension four using Magma, and apply Schur-Weyl duality from representation theory to determine the relevant invariants. Through the Borel-Weil theorem, we interpret these invariants as sections of line bundles over partial flag varieties, resulting in geometric invariants that, in some cases, correspond to K3 surfaces. We compute discrete invariants of these geometric invariants and use them to distinguish algebras.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13177v1",
    "categories": [
      "math.OC",
      "cs.DS",
      "cs.LG"
    ],
    "authors": [
      "Swati Gupta",
      "Jai Moondra",
      "Mohit Singh"
    ],
    "title": "Improved Regret Guarantees for Online Mirror Descent using a Portfolio of Mirror Maps",
    "abstract": "OMD and its variants give a flexible framework for OCO where the performance depends crucially on the choice of the mirror map. While the geometries underlying OPGD and OEG, both special cases of OMD, are well understood, it remains a challenging open question on how to construct an optimal mirror map for any given constrained set and a general family of loss functions, e.g., sparse losses. Motivated by parameterizing a near-optimal set of mirror maps, we consider a simpler question: is it even possible to obtain polynomial gains in regret by using mirror maps for geometries that interpolate between $L_1$ and $L_2$, which may not be possible by restricting to only OEG ($L_1$) or OPGD ($L_2$).\n  Our main result answers this question positively. We show that mirror maps based on block norms adapt better to the sparsity of loss functions, compared to previous $L_p$ (for $p \\in [1, 2]$) interpolations. In particular, we construct a family of online convex optimization instances in $\\mathbb{R}^d$, where block norm-based mirror maps achieve a provable polynomial (in $d$) improvement in regret over OEG and OPGD for sparse loss functions. We then turn to the setting in which the sparsity level of the loss functions is unknown. In this case, the choice of geometry itself becomes an online decision problem. We first show that naively switching between OEG and OPGD can incur linear regret, highlighting the intrinsic difficulty of geometry selection. To overcome this issue, we propose a meta-algorithm based on multiplicative weights that dynamically selects among a family of uniform block norms. We show that this approach effectively tunes OMD to the sparsity of the losses, yielding adaptive regret guarantees. Overall, our results demonstrate that online mirror-map selection can significantly enhance the ability of OMD to exploit sparsity in online convex optimization.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13171v1",
    "categories": [
      "math.RA",
      "cs.CC"
    ],
    "authors": [
      "Yoav Moran",
      "Oded Schwartz",
      "Shuncheng Yuan"
    ],
    "title": "Complex to Rational Fast Matrix Multiplication",
    "abstract": "Fast matrix multiplication algorithms are asymptotically faster than the classical cubic-time algorithm, but they are often slower in practice. One important obstacle is the use of complex coefficients, which increases arithmetic overhead and limits practical efficiency. This paper focuses on transforming complex-coefficient matrix multiplication schemes into equivalent real- or rational-coefficient ones. We present a systematic method that, given a complex-coefficient scheme, either constructs a family of equivalent rational algorithms or proves that no equivalent rational scheme exists. Our approach relies only on basic linear-algebraic properties of similarity transformations of complex matrices. This method recovers the previously known ad hoc results of Dumas, Pernet, and Sedoglavic (2025) and extends them to more general settings, including algorithms involving rational coefficients and square roots, with $i=\\sqrt{-1}$ as a special case.\n  Using this framework, we show that no rational scheme is equivalent to Smirnov's $\\langle4,4,9,104\\rangle$ $\\mathbb{Q}[\\sqrt{161}]$ algorithm (2022) and that no real scheme is equivalent to the $\\langle4,4,4,48\\rangle$ complex algorithm of Kaporin (2024). More generally, our approach can also be used to prove the non-existence of integer-coefficient schemes.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13138v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Maximilian Kaipel"
    ],
    "title": "Exceptional versus $τ$-exceptional sequences for the Auslander algebra of $K[x]/(x^t)$",
    "abstract": "For $\\mathcal{A}_t$, the Auslander algebra of $K[x]/(x^t)$, it is shown that every complete exceptional sequence of $\\mathcal{A}_t$-modules is a complete $τ$-exceptional sequence. Moreover, it is established that the mutation of complete $τ$-exceptional sequences generalises the mutation of complete exceptional sequences in the category of $\\mathcal{A}_t$-modules.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13133v1",
    "categories": [
      "math.DG",
      "math.AG"
    ],
    "authors": [
      "Simon Jubert",
      "Chenxi Yin"
    ],
    "title": "Relative uniform Yau--Tian--Donaldson correspondence for projective bundles over a curve",
    "abstract": "This paper is concerned with a relative uniform Yau--Tian--Donaldson correspondence, in terms of test configurations, for the projectivization \\( \\mathbb{P}(E) \\) of a holomorphic vector bundle \\( E \\) over a smooth curve. For any Kähler class \\( [ω] \\) on \\( \\mathbb{P}(E) \\), we construct Kähler test configurations, which we call \\emph{compatible test configurations}. They are obtained by gluing horospherical test configurations from the fibers, arising from convex functions on a suitable moment polytope \\( Δ\\) following the construction of Delcroix, to the principal bundle associated with \\( \\mathbb{P}(E) \\). Using the generalized Calabi ansatz of Apostolov--Calderbank--Gauduchon--Tønnesen-Friedman on these test configurations, we show that the relative uniform stability of \\( (\\mathbb{P}(E),[ω]) \\) for compatible test configurations implies the existence of an extremal metric in this class, thereby establishing the equivalence. Along the way, we prove that these two conditions are equivalent to the weighted uniform stability of \\( Δ\\) for suitable explicit weight functions defined from the topological data of \\( \\mathbb{P}(E) \\).",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13111v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Luis H. Gallardo"
    ],
    "title": "Splitting sums of binary polynomials",
    "abstract": "We study an analogue of a classical arithmetic problem over the ring of polynomials. We prove that $m = 5$ is the minimal number such that the sums of any two distinct polynomials in a set of $m$ polynomials over $\\F_2[x]$ cannot all be of the form $x^k(x+1)^{\\ell}$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13079v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Malachi Phillips"
    ],
    "title": "Multi-physics Preconditioning for Thermally Activated Batteries",
    "abstract": "Thermal batteries, also known as molten-salt batteries, are single-use reserve power systems activated by pyrotechnic heat generation, which transitions the solid electrolyte into a molten state. The simulation of these batteries relies on multiphysics modeling to evaluate performance and behavior under various conditions. This paper presents advancements in scalable preconditioning strategies for the Thermally Activated Battery Simulator (TABS) tool, enabling efficient solutions to the coupled electrochemical systems that dominate computational costs in thermal battery simulations. We propose a hierarchical block Gauss-Seidel preconditioner implemented through the Teko package in Trilinos, which effectively addresses the challenges posed by tightly coupled physics, including charge transport, porous flow, and species diffusion. The preconditioner leverages scalable subblock solvers, including smoothed aggregation algebraic multigrid (SA-AMG) methods and domain-decomposition techniques, to achieve robust convergence and parallel scalability. Strong and weak scaling studies demonstrate the solver's ability to handle problem sizes up to 51.3 million degrees of freedom on 2048 processors, achieving near sub-second setup and solve times for the end-to-end electrochemical solve. These advancements significantly improve the computational efficiency and turnaround time of thermal battery simulations, paving the way for higher-resolution models and enabling the transition from 2D axisymmetric to full 3D simulations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13018v1",
    "categories": [
      "math.RT"
    ],
    "authors": [
      "Adèle Bourgeois",
      "Monica Nevins"
    ],
    "title": "Lifting semisimple characters of $p$-adic types from fixed-point subgroups",
    "abstract": "Given a $p$-adic group $G=\\mathbf{G}(F)$ and a finite group $Γ\\subset\\mathrm{Aut}_F(\\mathbf{G})$ such that the fixed-point subgroup $\\mathbf{G}^Γ$ is reductive, we show that every semisimple character (in the sense of Bushnell and Kutzko) of a type for $G^Γ= \\mathbf{G}^Γ(F)$ arises as the restriction of a semisimple character of a type for $G$. We achieve this by explicitly lifting the truncated Kim--Yu datum (or character-datum) that parametrizes the semisimple character for $G^Γ$ to a character-datum that parametrizes a semisimple character for $G$. Our proof, which is of independent interest, uses state-of-the-art techniques and, as a special case, defines a lift of a Howe factorization of a character of a maximal torus of $G^Γ$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12999v1",
    "categories": [
      "math.DG",
      "math.MG"
    ],
    "authors": [
      "Vincent Borrelli",
      "Jean-Baptiste Follet",
      "Boris Thibert"
    ],
    "title": "Submanifolds of class $C^{1,α}$ and sets with positive $μ$-reach",
    "abstract": "It is well-known since the seminal work of Herbert Federer [Trans. of the AMS, 1959] that submanifolds of class $C^{1,1}$ have positive reach. In this paper, we extend this property to less regular submanifolds by using the notion of $μ$-reach that was introduced in the 2000's. We first show that every compact $C^1$ submanifold of the Euclidean space $\\E^n$ has positive $μ$-reach for all $μ<1$. We then show that intermediate regularities $C^{1,α}$ induce more quantitative results on the norm $\\|\\nabla \\d_M\\|$ of the generalized gradient of the distance function~$\\d_M$ to the submanifold. More precisely, if $M\\subset \\E^n$ is a submanifold of class $C^{1,α}$, with $α<1$, then there exists a constant $C>0$ such that\n  $$\\forall p\\in\\E^n\\setminus M,\\quad 1 - \\| \\nabla \\d_M(p) \\|^2 \\leq C ~ \\d_M(p)^{\\frac{2 α}{1- α}}.$$ We finally show that the exponent $2α/(1-α)$ in this estimate is sharp.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12896v1",
    "categories": [
      "math.SG",
      "math.DG",
      "math.DS"
    ],
    "authors": [
      "Bernhard Albach",
      "Jean-François Barraud",
      "Misha Bialy",
      "Johanna Bimmermann",
      "Ana Chávez Cáliz",
      "Mihai Damian",
      "Lina Deschamps",
      "Umberto Hryniewicz",
      "Vincent Humilière",
      "Boris Khesin",
      "Levin Maier",
      "Agustin Moreno",
      "Alexandru Oancea",
      "Olga Paris-Romaskevich",
      "Alfonso Sorrentino",
      "Serge Tabachnikov"
    ],
    "title": "Open problems in billiards and quantitative symplectic geometry",
    "abstract": "This document collects contributions to the Open Problem List in Billiards and Quantitative Symplectic Geometry, compiled following discussions during the workshop ``Billiards and quantitative symplectic geometry'' that took place at the University of Heidelberg on July 14--18, 2025.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12861v1",
    "categories": [
      "math.GN"
    ],
    "authors": [
      "Huijun Hou",
      "Ao Shen"
    ],
    "title": "Stone duality of Lawson compact algebraic L-domain",
    "abstract": "In this paper, a subclass of bounded distributive lattices, that is, finitely disjunctive distributive lattices (FDD-lattices) have been introduced. Then we apply it to establish a Stone duality for Lawson compact algebraic L-domains. Furthermore, we develop a dual equivalence between the category of FDD-lattices with lattice homomorphisms and that of Lawson compact algebraic L-domains with spectral maps.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12849v1",
    "categories": [
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "Asier Arranz"
    ],
    "title": "Above Isaacs' Head Characters",
    "abstract": "The proof of the inductive McKay condition has been shown to imply that the character theory above the characters of degree not divisible by $p$ of a normal subgroup is locally determined. In this note, we establish a similar result for the Isaacs' head characters of a normal solvable subgroup of an arbitrary group. In particular, we give a new lower bound of the number of conjugacy classes of a finite group in terms of the Carter subgroups of any of its normal solvable subgroups.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12821v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Stephanie Caro",
      "Abderrahim Hantoute"
    ],
    "title": "Explicit data-dependent characterizations of the subdifferential of convex pointwise suprema and optimality conditions",
    "abstract": "We establish explicit data-dependent and symmetric characterizations of the subdifferential of the supremum of convex functions, formulated directly in terms of the underlying data functions. In our approach, both active and non-active functions contribute equally through their subdifferentials, thereby avoiding the need for additional geometric constructions, such as the domain of the supremum, that arise in previous developments. Applications to infinite convex optimization yield sharp Karush-Kuhn-Tucker and Fritz-John optimality conditions, expressed exclusively in terms of the objective and constraint functions and clearly distinguishing the roles of (almost) active and non-active constraints.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12816v1",
    "categories": [
      "math.NA",
      "math.PR"
    ],
    "authors": [
      "Nan Deng",
      "Wanrong Cao"
    ],
    "title": "Finite Difference Method for Stochastic Cahn-Hilliard Equation Driven by A Fractional Brownian Sheet",
    "abstract": "The stochastic Cahn-Hilliard equation driven by a fractional Brownian sheet provides a more accurate model for correlated space-time random perturbations. This study delves into two key aspects: first, it rigorously examines the regularity of the mild solution to the stochastic Cahn-Hilliard equation, shedding light on the intricate behavior of solutions under such complex perturbations. Second, it introduces a fully discrete numerical scheme designed to solve the equation effectively. This scheme integrates the finite difference method for spatial discretization with the tamed exponential Euler method for temporal discretization. The analysis demonstrates that the proposed scheme achieves a strong convergence rate of $O\\big(h^{1-ε}+τ^{H_1-\\frac{1}{8}-\\fracε{2}}\\big)$, where $ε$ is an arbitrarily small positive constant, providing a solid foundation for the numerical treatment of such equations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12940v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Nitin Kumar",
      "Federico Pichi",
      "Gianluigi Rozza"
    ],
    "title": "Bifurcation curve detection with deflation for multiparametric PDEs",
    "abstract": "This work presents a comprehensive framework for capturing bifurcating phenomena and detecting bifurcation curves in nonlinear multiparametric partial differential equations, where the system exhibits multiple coexisting solutions for given values of the parameters. Traditional continuation methods for one-dimensional parameterizations employ the previously computed solution as the initial guess for the next parameter value. These are usually very inefficient, since small step sizes increase computational cost, while larger steps could jeopardize the method convergence jumping to a different solution branch or missing the bifurcation point. To address these challenges, we propose a novel framework that combines: (i) arclength continuation, adaptively selecting new parameter values in higher dimension, and (ii) the deflation technique, discovering multiple branches to construct complete bifurcation diagrams. In particular, the arclength continuation method is designed to handle multiparametric scenarios, where the parameter vector $λ\\in \\mathbb{R}^p$ traces a curve $g(λ)$ within a $p$-dimensional parameter space. In addition, we introduce a zigzag path-following strategy to robustly track the bifurcation curves and surfaces, respectively, for two- and three-dimensional parametric spaces. Finally, we demonstrate its performance on two benchmark problems: the Bratu equation and the Allen-Cahn equation.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12935v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Philippe Blondeel",
      "Filip Van Utterbeeck",
      "Ben Lauwens"
    ],
    "title": "A Stochastic Optimal Control Formulation for Mine Counter Measure Simulations with Multiple Autonomous Survey Vehicles",
    "abstract": "Modelling and simulating mine counter measure search missions performed by autonomous vehicles equipped with a sensor capable of detecting mines at sea is a challenging endeavour. To address this, we formulated and implemented the problem as a stochastic optimal control model. Our implementation computes an optimal path within a user chosen quadrilateral domain such that the mission duration is minimized for a given residual risk of undetected sea mines. First, we compare the stochastic optimal control implementation against the traditionally used boustrophedon implementation. We show that the mission duration in case of the stochastic optimal control implementation is shorter. Then, by building on our previous work, we introduce a novel mathematical approach that enables multiple autonomous survey vehicles to investigate the domain concurrently. We present results for up to six vehicles, including computed trajectories and an analysis of how mission duration varies with the number of vehicles. Our findings show that mission time decreases non-linearly, , i.e., we observe diminishing returns as more vehicles are added.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12928v1",
    "categories": [
      "math.CO",
      "math.PR"
    ],
    "authors": [
      "Markus Kuba"
    ],
    "title": "On Card guessing after a single shelf shuffle",
    "abstract": "We consider a card guessing game with complete feedback. An ordered deck of $n$ cards labeled $1$ up to $n$ is shelf-shuffled exactly one time. One after the other a single card is drawn from the shuffled deck. The guesser makes has guess and the card is shown until no cards remain. We provide a distributional analysis of the number of correct guesses under the optimal strategy. We re-obtain the previously derived expectation and add a complete description of the distribution. We also obtain a central limit theorem for the number $n$ of cards tending to infinity. Furthermore, we discuss an unbalanced, biased shelf shuffle and show how to derive the extend our analysis, also adding the complete position matrix. Finally, a refined analysis of the number of correct guesses is carried out, distinguishing between pure luck guesses and certified correct guesses.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12912v1",
    "categories": [
      "math.GR",
      "math.CO"
    ],
    "authors": [
      "Stuart Margolis",
      "John Rhodes"
    ],
    "title": "Bases of Permutation Groups and Boolean Representable Simplicial Complexes",
    "abstract": "A base of a permutation group (X,G) is a subset B of X such that its pointwise stabilizer is the trivial group. A list (x1,x2, ... ,xk) of elements of X is irredundant if each element is not in the pointwise stabilizer of its predecessors. We define a Boolean representable simplicial complex B(X,G) such that a subset Y of X is independent if and only if some enumeration of its elements is irredundant. In addition Y is a base if and only if its closure is X. We give a number of examples and close with a conjecture whose solution leads to a new proof of the Feit-Thompson Theorem.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12874v1",
    "categories": [
      "math.ST"
    ],
    "authors": [
      "Markus Zobel",
      "Axel Munk"
    ],
    "title": "Quantile characterization of univariate unimodality",
    "abstract": "Unimodal univariate distributions can be characterized as piecewise convex-concave cumulative distribution functions. In this note we transfer this shape constraint characterization to the quantile function. We show that this characterization comes with the upside that the quantile function of a unimodal distribution is always absolutely continuous and consequently unimodality is equivalent to the quasi-convexity of its Radon-Nikodym derivative, i.e., the quantile density. Our analysis is based on the theory of generalized inverses of non-decreasing functions and relies on a version of the inverse function rule for non-decreasing functions.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12824v1",
    "categories": [
      "math.NT",
      "cs.MS"
    ],
    "authors": [
      "Christophe Levrat"
    ],
    "title": "Explicit Euclidean division algorithms for some degree 8 number rings",
    "abstract": "This article focuses on some rings of integers of number fields which are known to be norm-Euclidean domains, but for which no explicit algorithm computing the Euclidean division has yet been studied or implemented. The rings of integers we are interested in were proven to be Euclidean by H.W. Lenstra, Jr in 1978; they include the $n$-th cyclotomic rings for $n=15,20,24$. We present an algorithm performing Euclidean division in these rings based on Lenstra's proof and a closest vector computation by Conway and Sloane, and study its complexity. We give a complete implementation of the algorithm in SageMath. We also estimate the size of the remainders obtained when computing Euclidean divisions with this algorithm.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12815v1",
    "categories": [
      "math.GR"
    ],
    "authors": [
      "Shrinit Singh"
    ],
    "title": "Measures induced by sugroups and tuples in free groups",
    "abstract": "We study probability measure on $\\mathrm{Hom}(H,G)$, where $G$ is a finite group and $H$ a finitely generated subgroup of a finitely generated free group $F$, obtained by pushing forward the uniform random homomorphisms $\\mathrm{Hom}(F,G)$ via restriction map to $\\mathrm{Hom}(H,G)$. This framework generalizes the word measures arising from single elements of a free group. We formalize the notion of profinite rigidity for subgroups via these induced measures. Our main result shows that a finitely generated subgroup is profinitely rigid if and only if any (equivalently, every) ordered generating tuple is profinitely rigid, thereby extending the notion of rigidity from individual word maps to arbitrary tuples. We also obtain a generalization of a result of \\cite{puder2015measure}.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13183v1",
    "categories": [
      "math.PR",
      "math.CO"
    ],
    "authors": [
      "Piotr Śniady"
    ],
    "title": "Determinant and Pfaffian formulas for particle annihilation",
    "abstract": "When particles on a line collide, they may annihilate-both are destroyed. Computing exact annihilation probabilities has been difficult because collisions reduce the particle count, while determinantal methods require a fixed count throughout. The ghost particle method, introduced in a companion paper for coalescence, keeps destroyed particles walking as invisible ghosts that restore the missing dimension. We apply this method to annihilation: when two particles annihilate, both trajectories continue as invisible walkers, yielding an exact determinantal formula that specifies the number of annihilations, where survivors end up, and where ghosts end up. For complete annihilation (no survivors), the formula simplifies to a Pfaffian-an algebraic relative of the determinant built from pairwise quantities-connecting to Pfaffian point process theory. The annihilation formula also yields results about coalescence: pairwise coalescence can be reinterpreted as complete annihilation, producing a Pfaffian coalescence formula. These formulas are exact for any finite initial configuration and apply to discrete lattice paths, birth-death chains, and continuous diffusions including Brownian motion.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13097v1",
    "categories": [
      "math.RT",
      "math.CT"
    ],
    "authors": [
      "Arthur R. Alves Neto",
      "Eliezer Batista",
      "Javier Méndez"
    ],
    "title": "The monoidal structure of the category of partial representations of finite groups",
    "abstract": "In this work, we analyze the structure of the category of partial representations of a finite group $G$ as a multifusion category, providing an alternative way to describe simple objects and their tensor products. We describe the interconnection between the category of partial representations of a finite group and the category of global representations of its subgroups (the Christmas Tree's Theorem). Also, for a finite abelian group $G$, we prove that the category of partial representations of any of its subgroups can be embedded into the category of partial representations of $G$ (the Matryoshka's Theorem).",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13090v1",
    "categories": [
      "math.RT",
      "math.NT"
    ],
    "authors": [
      "Alexander Hazeltine",
      "Aarya Kumar",
      "Andrew Tung"
    ],
    "title": "On Arthur packets containing a fixed tempered representation",
    "abstract": "We determine the number of local Arthur packets containing a certain fixed tempered representation for classical $p$-adic groups. More specifically, given a tempered extended multi-segment supported in the integers, we determine a count for all extended multi-segments which arise from it through applications of the operators arising from the theory of intersections of local Arthur packets.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13089v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Daniela Morale",
      "Giulia Rui",
      "Stefania Ugolini"
    ],
    "title": "Well-posedness of stochastic reacting particle systems with non-local and Lennard-Jones interactions",
    "abstract": "We establish well-posedness results for systems of a finite number of stochastic particles driven by independent Brownian motions and subject to a strongly singular drift induced by a Lennard-Jones interaction. In addition to the pairwise force, the dynamics includes a nonlocal drift mediated by an environmental field, whose evolution is coupled to the particle configuration through a regularized empirical density. We then extend the analysis to a reaction model in which the switching (or killing) rate also depends on the field. An interlacing technique is considered for establishing the well-posedness of the full system. The model is motivated by the challenge to provide a stochastic microscopic description of the sulphation phenomenon in cultural heritage materials.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13077v1",
    "categories": [
      "math.LO"
    ],
    "authors": [
      "Douglas Blue",
      "Paul Larson",
      "Grigor Sargsyan"
    ],
    "title": "The failure of square at all uncountable cardinals is weaker than a Woodin limit of Woodin cardinals",
    "abstract": "We force the Axiom of Choice over the least initial segment of a Nairian model satisfying ZF. In the forcing extension, square_kappa fails at all uncountable cardinals kappa, and every regular cardinal is omega-strongly measurable in HOD, as witnessed by the omega-club filter. Thus the failure of square everywhere is within the current reach of inner model theory, and the HOD Hypothesis is not provable in ZFC.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13063v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Antonin Clerc",
      "Ségolène Martin",
      "Nicolas Papadakis",
      "Gabriele Steidl"
    ],
    "title": "Reinterpreting EMML as Mirror Descent for Constrained Maximum Likelihood Estimation",
    "abstract": "The Expectation--Maximization Maximum Likelihood (EMML) algorithm belongs to the Expectation--Maximization family and is widely used for image reconstruction problems under Poisson noise.In this paper, we reinterpret EMML as a mirror descent method applied to a reparametrized objective function. This perspective allows us to incorporate convex constraints into the algorithm through appropriately chosen Bregman projections, while preserving the multiplicative structure of the EMML updates to ensure computational efficiency. We then establish the convergence of the resulting algorithm toward a solution of the constrained maximum-likelihood problem. Numerical experiments on hyperspectral unmixing problems demonstrate that the constrained EMML converges in fewer iterations than the classical EMML.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13037v1",
    "categories": [
      "math.CO",
      "cs.CC"
    ],
    "authors": [
      "Thomas Delépine"
    ],
    "title": "Between proper and square coloring of planar graphs, hardness and extremal graphs",
    "abstract": "$(1^a, 2^b)$-coloring is the problem of partitioning the vertex set of a graph into $a$ independent sets and $b$ 2-independent sets. This problem was recently introduced by Choi and Liu. We study the computational complexity and extremal properties of $(1^a, 2^b)$-coloring. We prove that this problem is NP-Complete even when restricted to certain classes of planar graphs, and we also investigate the extremal values of $b$ when $a$ is fixed and in some $(a + 1)$-colorable classes of graphs. In particular, we prove that $k$-degenerate graphs are $(1^k, 2^{O(\\sqrt{n})})$-colorable, that triangle-free planar graphs are $(1^2, 2^{O(\\sqrt{n})})$-colorable and that planar graphs are $(1^3, 2^{O(\\sqrt{n})})$-colorable. All upper bounds obtained are tight up to a constant factor.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13027v1",
    "categories": [
      "math.GR",
      "math.RT"
    ],
    "authors": [
      "J. Moritz Petschick",
      "Margherita Piccolo"
    ],
    "title": "Representation zeta functions of split extensions of $SL_2^m(O)$",
    "abstract": "We consider the representation growth of split extensions of $SL_2^m(O)$. We prove that the corresponding representation zeta functions factor as a product of the representation zeta function of $SL_2^m(O)$ and the relative representation zeta function associated to the extension. We make use of our result by computing the zeta functions for two infinite families of split extensions of $SL_2^m(O)$ explicitly. Along the way, we compute the representation zeta functions of a large class of subgroups of $SL_2^m(O)$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13000v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Hanfeng Zeng",
      "Wenqing Ouyang",
      "Andre Milzarek"
    ],
    "title": "A linesearch-type normal map-based semismooth Newton method for nonsmooth nonconvex composite optimization",
    "abstract": "We propose a novel linesearch variant of the trust region normal map-based semismooth Newton method developed in [Ouyang and Milzarek, Math. Program. 212(1-2), 389--435 (2025)] for solving a class of nonsmooth, nonconvex composite-type optimization problems. Our approach uses adaptive parameter estimation techniques, which allow us to avoid explicit and potentially expensive Lipschitz constant computations. We provide extensive convergence results including global convergence, convergence of the iterates under the Kurdyka-Łojasiewicz inequality, and transition to fast local q-superlinear convergence. Compared to the original trust region framework, the linesearch-based algorithm is simpler and the overall convergence analysis can be conducted under weaker assumptions -- in particular, without requiring explicit boundedness conditions on the Hessian approximations and iterates. Numerical experiments on sparse logistic regression, image compression, and nonlinear least squares with group penalty terms demonstrate the efficiency of the proposed approach.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12946v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Enrica Floris"
    ],
    "title": "The group of birational selfmaps of a conic fibration is uncountable",
    "abstract": "We prove that the group of birational selfmaps of a variety birational to a conic bundle is uncountable.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12939v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Mauro Colantonio",
      "Emilio A. Lauret"
    ],
    "title": "The fundamental group of a spherical space form is not audible",
    "abstract": "We revisit the problem of isospectral spherical space forms with non-cyclic fundamental groups after the works by Ikeda, Gilkey and Wolf. We find the first pair of spherical space forms with non-isomorphic fundamental groups and the same Laplace spectrum. This shows that the isomorphism class of the fundamental group is not audible among spherical space forms. We also found several instances where one can hear the fundamental group of a spherical space form (among spherical space forms).",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12934v1",
    "categories": [
      "math.FA"
    ],
    "authors": [
      "Carlo Alberto De Bernardi",
      "Tommaso Russo",
      "Şeyda Sezgek",
      "Jacopo Somaglia"
    ],
    "title": "Packings in classical Banach spaces",
    "abstract": "We obtain several new results on the simultaneous packing and covering constant $γ(\\mathcal{X})$ of a Banach space $\\mathcal{X}$, and its lattice counterpart $γ^*(\\mathcal{X})$. These constants measure how efficient a (lattice) packing by unit balls in $\\mathcal{X}$ can be, the optimal case being that $γ(\\mathcal{X})= 1$ and the worst that $γ(\\mathcal{X})= 2$. Our first main result is that $γ(\\mathcal{X})> 1$ whenever $B_\\mathcal{X}$ admits a LUR point, which leads us to a negative answer to a question of Swanepoel. We also develop general methods to compute these constants for a large class of spaces. As a sample of our findings:\n  (i) $γ^*(\\mathcal{X})= 1$ when $\\mathcal{X}$ is a separable octahedral Banach space, or $\\mathcal{X}= \\mathcal{C}(\\mathcal{K})$, where $\\mathcal{K}$ is zero-dimensional;\n  (ii) $γ(\\ell_p(κ)\\oplus_r \\mathcal{X})= γ^*(\\ell_p(κ)\\oplus_r \\mathcal{X})= \\frac{2}{2^{1/p}}$, whenever $\\rm{dens}(\\mathcal{X})< κ$ and $1\\leq r\\leq p< \\infty$;\n  (iii) $γ(L_p(μ))= γ^*(L_p(μ))= \\frac{2}{2^{1/p}}$ for $1\\leq p\\leq 2$ and every measure $μ$;\n  (iv) there exist reflexive (resp. octahedral) Banach spaces $\\mathcal{X}$ with $γ(\\mathcal{X})= 2$.\n  We leave a large area open for further research and we indicate several possible directions.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12908v1",
    "categories": [
      "math.RA",
      "math.QA"
    ],
    "authors": [
      "Hongliang Li",
      "Qinxiu Sun"
    ],
    "title": "Noncommutative pre-Poisson bialgebras and relative Rota-Baxter operators",
    "abstract": "In this paper, we develop the bialgebra theory for coherent noncommutative pre-Poisson algebras and establish equivalences among matched pairs, Manin triples, the phase space of noncommutative Poisson algebras and noncommutative pre-Poisson bialgebras. The investigation of coboundary noncommutative pre-Poisson bialgebras naturally leads to the noncommutative pre-Poisson Yang-Baxter equation (NPP-YBE). We prove that a symmetric solution of the NPP-YBE gives rise to a (coboundary) noncommutative pre-Poisson bialgebra. Moreover, we demonstrate how solutions without the symmetry condition can also generate such bialgebras. This motivates the introduction of quasi-triangular and factorizable noncommutative pre-Poisson bialgebras.In particular, we show that a solution of the NPP-YBE with an invariant skew-symmetric part yields a quasi-triangular noncommutative pre-Poisson bialgebra.Such solutions are further interpreted as relative Rota-Baxter operators with weights. Finally, we establish a one-to-one correspondence between quadratic Rota-Baxter noncommutative pre-Poisson algebras and factorizable noncommutative pre-Poisson bialgebras.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13141v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Yixin Xie",
      "Jin-Peng Liu",
      "Cong Sun",
      "Ya-Xiang Yuan"
    ],
    "title": "New gradient methods with 3 dimensional quadratic termination",
    "abstract": "A new stepsize for gradient method is proposed. Combining it with the exact line search stepsizes, the gradient method achieves the optimal solution in 5 steps for 3 dimensional quadratic function minimization problem. The new stepsize is plugged in the cyclic stepsize update strategy, and a new gradient method is proposed. By applying the quadratic interpolation for Cauchy approximation, the proposed gradient method is extended to solve general unconstrained problem. With the improved GLL line search, the global convergence of the proposed method is proved. Furthermore, its sublinear convergence rate for convex problems and R-linear convergence rate for problems with quadratic functional growth property are analyzed. Numerical results show that our proposed algorithm enjoys good performances in terms of computational cost, and line search requires very few trial stepsizes.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13105v1",
    "categories": [
      "math.DG"
    ],
    "authors": [
      "Xin Yu Liao"
    ],
    "title": "Heat Flow in Semi-Flat Elliptic Fibrations",
    "abstract": "Motivated by the SYZ picture for the collapsing of elliptic K3 surfaces, we study heat kernels under semi-flat collapse of Ricci-flat Kähler manifolds (X_t, g(t)) fibered by flat 2-tori over a surface B with a finite discriminant set D. On the regular locus B_reg = B \\ D we assume an exponentially accurate semi-flat product approximation together with a uniform vertical spectral gap at the collapse scale. Using normalized lift and fiber-average maps, we show that for each fixed time tau > 0 the fiber-compressed heat operators converge strongly on L^2 to the heat semigroup of the base Laplacian. Equivalently, bilinear pairings of the total-space heat kernel against fiber-constant lifts of test functions converge on any precompact subset of B_reg.\n  The main additional issue occurs at the discriminant: although X_t is smooth, the limiting base geometry becomes conic near D, so test functions meeting D cannot be treated by purely interior arguments. In wedge charts around D we introduce a canonical conic-renormalized bilinear functional obtained by patching the base heat-kernel pairing away from D with the model heat kernel of the corresponding flat cone. A conic parametrix shows that this functional is well-defined and independent of auxiliary cutoffs, and that the total-space bilinear pairings converge to it for arbitrary smooth compactly supported test functions and every fixed tau > 0. When the supports avoid D, the renormalization is trivial and the limit reduces to the usual base heat-kernel pairing. Under exponentially small geometric errors we obtain an explicit exponential convergence rate, uniform for tau in compact subintervals of (0, infinity). The results extend to Neumann and nonnegatively weighted Robin boundary conditions and globalize by exhaustion of the regular locus.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13096v1",
    "categories": [
      "math.DG",
      "gr-qc"
    ],
    "authors": [
      "Stephen McCormick",
      "Markus Wolff"
    ],
    "title": "Extensions of spacetime Bartnik data and estimates for the Bartnik mass outside of time-symmetry",
    "abstract": "Bartnik's quasi-local mass is a functional on Bartnik data $(\\mathbb S^2,γ,H,P,ω^\\perp)$, consisting of a metric $γ$, scalar functions $H$ and $P$, and a 1-form $ω^\\perp$ on the $2$-sphere $\\mathbb S^2$. We construct initial data $(M,g,K)$ for the Einstein equations with boundary $Σ\\cong\\mathbb S^2$, and boundary conditions for $g$ and $K$ determined by Bartnik data with $H,P$ constant and $ω^\\perp\\equiv0$. Furthermore this initial data agrees with spherically symmetric initial data for a Schwarzschild spacetime outside of a compact set with controlled mass. As an application, we obtain estimates for the Bartnik mass for such Bartnik data, outside of the time-symmetric setting.\n  We also construct initial data on the cylinder $\\mathbb S^2\\times[0,1]$ connecting this same class of Bartnik data to time-symmetric data so that estimates for the Bartnik mass outside of time-symmetry can be obtained from prior estimates for time-symmetric data.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13083v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Francesco Bastianelli",
      "Gianluca Pacienza"
    ],
    "title": "Subvarieties of complete intersections of large degree",
    "abstract": "We study subvarieties of very general complete intersections $X\\subset \\mathbb{P}^n$ of multidegree $(d_1,\\dots,d_c)$, when $d:= d_1+\\dots +d_c$ is sufficiently large. In a seminal paper Ein proved that if $d\\geq 2n-c-k+2$, any $k$-dimensional subvariety of $X$ is of general type and has positive geometric genus. We strengthen this result by obtaining the optimal bound $d\\geq 2n-c-k$, provided that $n> 2c+k$. As a consequence, we characterize algebraic hyperbolicity of very general complete intersections $X\\subset \\mathbb{P}^n$ of codimension $c\\leq \\frac{n-3}{2}$. For lower values of $d$, we prove that if $\\frac{3n-c+2}{2}\\leq d\\leq 2n-c-2$ and $(d_1,\\dots,d_c)$ satisfies an additional numerical condition, then the only curves in $X$ that are not of general type are lines. Moreover, we describe the locus where positive dimensional orbits of points under rational equivalence must lie. We obtain our results by proving that, under suitable numerical conditions, subvarieties of $X$ that are not of general type must lie in the locus of $X$ covered by lines. The proof of this result relies on a generalization of the approach and techniques developed for hypersurfaces by Voisin, Clemens-Ran and the second author, combined with a Grassmannian technique introduced by Riedl-Yang.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13057v1",
    "categories": [
      "math.AG",
      "hep-th"
    ],
    "authors": [
      "Marco Ghirlanda"
    ],
    "title": "Calabi-Yau complete intersections in fake weighted projective spaces",
    "abstract": "We present a classification algorithm for Calabi-Yau complete intersections arising from nef-partitions in fake weighted projective spaces, allowing us to determine all such complete intersections up to dimension five. Furthermore, we compute the Hodge pairs of the $3$-dimensional families obtained, and find twenty new Hodge pairs not realized by any toric Calabi-Yau hypersurface. Finally, we provide an explicit characterization for the families of maximal codimension.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13186v1",
    "categories": [
      "math.GT"
    ],
    "authors": [
      "Julia Knihs",
      "Jeanette Patel",
      "Joshua M. Sabloff",
      "Thea Rugg"
    ],
    "title": "On the Non-Orientable $3$- and $4$-Genera of a Knot: Connections and Comparisons",
    "abstract": "We define a new quantity, the Euler-normalized non-orientable genus, to connect a variety of ideas in the theory of non-orientable surfaces bounded by knots. This quantity is used to reframe non-orientable slice-torus bounds on the non-orientable $4$-genus, to bound below the Turaev genus as a measure of distance to an alternating knot, and to understand gaps between the $3$- and $4$-dimensional non-orientable genera of pretzel knots. Further, we make connections to essential surfaces in knot complements and the Slope Conjecture.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13169v1",
    "categories": [
      "math.OC",
      "stat.ML"
    ],
    "authors": [
      "William Hofgard",
      "Asaf Cohen",
      "Mathieu Laurière"
    ],
    "title": "Operator Learning for Families of Finite-State Mean-Field Games",
    "abstract": "Finite-state mean-field games (MFGs) arise as limits of large interacting particle systems and are governed by an MFG system, a coupled forward-backward differential equation consisting of a forward Kolmogorov-Fokker-Planck (KFP) equation describing the population distribution and a backward Hamilton-Jacobi-Bellman (HJB) equation defining the value function. Solving MFG systems efficiently is challenging, with the structure of each system depending on an initial distribution of players and the terminal cost of the game. We propose an operator learning framework that solves parametric families of MFGs, enabling generalization without retraining for new initial distributions and terminal costs. We provide theoretical guarantees on the approximation error, parametric complexity, and generalization performance of our method, based on a novel regularity result for an appropriately defined flow map corresponding to an MFG system. We demonstrate empirically that our framework achieves accurate approximation for two representative instances of MFGs: a cybersecurity example and a high-dimensional quadratic model commonly used as a benchmark for numerical methods for MFGs.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13162v1",
    "categories": [
      "math.AG"
    ],
    "authors": [
      "Aislan Fontes",
      "Maxwell Santos"
    ],
    "title": "New irreducible components of $\\mathcal{B}(0,c_2)$ and Computation of the Dimension of its tangent space",
    "abstract": "We provide a Macaulay2 code for computing the dimension of the tangent space to $\\mathcal{B}(e,c_2)$ in certain cases. Using this code, we identify components of $\\mathcal{B}(e,c_2)$ containing singular points and compute the dimension of the irreducible component $M_4$ of $\\mathcal{B}(-1,6)$, whose existence was proved in \\cite{MF2021}. Furthermore, we prove the existence of infinite families of irreducible components of $\\mathcal{B}(0,c_2)$.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13149v1",
    "categories": [
      "math.CO"
    ],
    "authors": [
      "Aida Abiad",
      "Pax Mallee"
    ],
    "title": "Propagation processes on (hyper)graphs: where zero forcing and burning meet",
    "abstract": "The burning and forcing processes are both instances of propagation processes on graphs that are commonly used to model real-world spreading phenomena. The contribution of this paper is two-fold. We first establish a connection between these two propagation processes via hypergraphs. We do so by showing a sharp upper bound on the zero forcing number of the incidence graph of a hypergraph in terms of the lazy burning number of the hypergraph, which builds up on and improves a result by Bonato, Jones, Marbach, Mishura and Zhang (Theor. Comput. Sci., 2025). Secondly, we deepen the understanding of the role of the burning process in the context of graph spectral characterizations, whose goal is to understand which graph properties are encoded in the spectrum. While for several graph properties, including the zero forcing number, it is known that the spectrum does not encode them, this question remained open for the burning number. We solve this problem by constructing infinitely many pairs of cospectral graphs which have a different burning number.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13107v1",
    "categories": [
      "math.CO",
      "cs.IT"
    ],
    "authors": [
      "Fabrizio Conca",
      "Benjamin Jany",
      "Alberto Ravagnani"
    ],
    "title": "Intersecting Codes and the Connectivity of $q$-Matroids",
    "abstract": "We investigate the structure of intersecting error-correcting codes, with a particular focus on their connection to matroid theory. We establish properties and bounds for intersecting codes with the Hamming metric and illustrate how these distinguish the subfamily of minimal codes within the family of intersecting codes. We prove that the property of a code being intersecting is characterized by the matroid-theoretic notion of vertical connectivity, showing that intersecting codes are precisely those achieving the highest possible value of this parameter. We then introduce the concept of vertical connectivity for $q$-matroids and link it to the theory of intersecting codes endowed with the rank metric.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13058v1",
    "categories": [
      "math.NT"
    ],
    "authors": [
      "Jouni Parkkonen",
      "Frédéric Paulin"
    ],
    "title": "On the multiplicative pair correlations of sums of two squares",
    "abstract": "We study the pair correlations of the logarithms of the integral values of quadratic norm forms at various scalings, proving the existence of pair correlation measures. We describe a surprising set of asymptotic behaviours when the scaling increases, passing from a punctual measure to a Poissonian behaviour through an exotic behaviour at the transition phase.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13056v1",
    "categories": [
      "math.PR"
    ],
    "authors": [
      "Pierre Étoré",
      "Anna Melnykova",
      "Irene Tubikanec"
    ],
    "title": "Splitting methods for stochastic Hodgkin-Huxley type systems and a localized fundamental mean-square convergence theorem",
    "abstract": "Existing fundamental theorems for mean-square convergence of numerical methods for stochastic differential equations (SDEs) require globally or one-sided Lipschitz continuous coefficients, while strong convergence results under merely local Lipschitz conditions are largely restricted to Euler-Maruyama type methods. To address these limitations, we introduce a novel localized version of the fundamental mean-square convergence theorem for SDEs with locally Lipschitz coefficients, which naturally arise in a wide range of applications. Specifically, we show that if a numerical scheme is locally consistent in the mean-square sense of order $q>1$, then it is locally mean-square convergent with rate $q-1$. Building on this result, we further prove that global mean-square convergence follows, provided that both the exact solution and its numerical approximation admit bounded $2p$th moments for some $p>1$.\n  These new convergence results are illustrated on a class of locally Lipschitz SDEs of Hodgkin-Huxley type, characterized by a conditionally linear drift structure. For these systems, we construct different Lie-Trotter and Strang splitting methods exploiting their conditional linearity. The proposed convergence framework is then applied to these schemes, requiring innovative proofs of local consistency and boundedness of moments. In addition, we establish key structure-preserving properties of the splitting methods, in particular state-space preservation and geometric ergodicity. Numerical experiments support the theoretical results and demonstrate that the proposed splitting schemes significantly outperform Euler-Maruyama type methods in preserving the qualitative features of the model.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13048v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Hamid Fathi",
      "Alexander Skorikov",
      "Tristan van Leeuwen"
    ],
    "title": "Data-Driven Filter Design for Flexible and Noise-Robust Tomographic Imaging",
    "abstract": "While filtered back projection (FBP) is still the method of choice for fast tomographic reconstruction, its performance degrades noticeably in the presence of noise, incomplete sampling, or non-standard scan geometries. We propose a data-driven approach for learning FBP filters and projection weights directly from training data, with the goal of improving robustness without sacrificing computational efficiency. The resulting reconstructions adapt naturally to the noise level and acquisition geometry, while retaining the speed and simplicity of classical back-projection. The proposed method can be formulated as a regularized optimization problem for a linear inverse operator, which allows us to establish existence, uniqueness, and stability of the learned solution. From a spectral viewpoint, the learned filters act as data-adaptive gain functions that explicitly balance noise amplification and bias, in close analogy to a regularized pseudo-inverse. Experiments in both 2D and 3D show consistent improvements over conventional FBP and FDK in different case studies. Finally, we show that filters trained on synthetic laminography data generalize well to real-world measurements, delivering image quality comparable to advanced iterative methods without the high computational cost.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13032v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Raghupati Vyas",
      "Kousik Das",
      "Veeraruna Kavitha",
      "Souvik Roy"
    ],
    "title": "Multi-type random game dynamics: limits at discontinuities and cyclic limits",
    "abstract": "We consider (random) strategic interactions in a large population consisting of a variety of players. A rational player chooses actions that maximize certain utility functions, while a behavioral player chooses actions based on preferences such as avoid-the-crowd or follow-the-majority. We specifically study a turn-by-turn dynamic process in which players choose their actions sequentially and once; the utilities are realized either immediately or at the end of the game.\n  In the literature, such dynamical systems are often analyzed using an appropriate approximating ordinary differential equation (ODE). However, the ODEs approximating the dynamics with pure actions are typically discontinuous. We adopt a differential inclusion (DI) based stochastic-approximation framework to derive the limiting analysis. The limits of the dynamics are characterized through the internally chain transitive (ICT) sets. We identify the presence of non-classical zeros as potential limits of the dynamics, a phenomenon not observed in classical settings involving continuous ODEs. These new limits arise precisely at the points of discontinuity of the dynamics. We further provide the conditions under which cyclic outcomes may occur at the limit.\n  Finally, we study a queuing game with differential priority-based services and examine the impact of the proportions of avoid-the-crowd and two types of rational populations on the long-run outcomes of the strategic interactions. We identify potential point limits and establish the possibility of cyclic outcomes for certain parameter configurations.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13011v1",
    "categories": [
      "math.AG",
      "math.AC",
      "math.PR"
    ],
    "authors": [
      "Carlos Améndola",
      "Felix Lotter",
      "Leonard Schmitz"
    ],
    "title": "Signature Varieties of Splines",
    "abstract": "Splines are central objects for the interpolation of discrete data via piecewise smooth paths. Their iterated-integral signature is an infinite collection of tensors which characterizes paths almost uniquely. We study truncations of this collection, which define algebraic maps from parameter space to tensor space. We prove that the images of these maps are given by orbits of a matrix-tensor action. Furthermore, taking the Zariski closure, we define and study varieties of spline signature tensors. We determine dimension and degree of these tensor varieties in a number of examples, relying on symbolic computations. With a view towards learning, constructing paths with a given signature tensor translates to studying the fibers of the signature map. We use computational methods to determine their cardinality, with a focus on its dependence on different classes of splines. We observe in explicit examples that reconstructing splines from a given signature tensor of a path yields close approximations of the original path.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.13005v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Patrick Jung"
    ],
    "title": "Optimizing Initial Feature-Mapping Variables from Given Designs via Tracking",
    "abstract": "A feature-mapping framework for inverse reconstruction of density-based topology optimization results is proposed. Unlike SIMP, whose voxelized outputs are hard to interpret or reuse, the method represents designs with high-level geometric primitives mapped to a fixed analysis grid. Capsule-shaped bars (endpoints plus radius) are used, with closed-form signed distances and smooth transition functions providing derivatives up to second order. Differentiable pseudo-densities are aggregated with smooth operators, enabling gradient-based optimization with exact Hessians. Robustness is improved through asymmetric transition functions that propagate sensitivities into void regions, a reward-only objective for initialization, and geometric safeguards against degenerate configurations. Reconstruction is performed in stages (exploration, bridging, convergence) with optional refinement that can add, remove, or merge features based on residuals and geometric criteria. Experiments on canonical SIMP benchmarks, including five-bar and cantilever layouts, show high-fidelity reconstructions using a moderate number of features. p-norm and softmax aggregation yield sharp results; pruning removes redundant features and additive refinement restores coverage. Exact Hessians accelerate convergence and improve robustness compared to quasi-Newton updates, providing a bridge from voxel-based outputs to explicit parametric models.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12988v1",
    "categories": [
      "math.PR",
      "math.ST"
    ],
    "authors": [
      "Anastasiia S. Kovtun",
      "Nikolai N. Leonenko",
      "Andrey Pepelyshev"
    ],
    "title": "Multidimensional Dickman distribution and operator selfdecomposability",
    "abstract": "The one-dimensional Dickman distribution arises in various stochastic models across number theory, combinatorics, physics, and biology. Recently, a definition of the multidimensional Dickman distribution has appeared in the literature, together with its application to approximating the small jumps of multidimensional Lévy processes. In this paper, we extend this definition to a class of vector-valued random elements, which we characterise as fixed points of a specific affine transformation involving a random matrix obtained from the matrix exponential of a uniformly distributed random variable. We prove that these new distributions possess the key properties of infinite divisibility and operator selfdecomposability. Furthermore, we identify several cases where this new distribution arises as a limiting distribution.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12886v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Hui Huang",
      "Jethro Warnett"
    ],
    "title": "Well-posedness and mean-field limit estimate of a consensus-based algorithm for min-max problems",
    "abstract": "The recent work arXiv:2407.17373 proposes a derivative-free consensus-based particle method that computes global solutions to nonconvex-nonconcave min-max problems and establishes global exponential convergence in the sense of the mean-field law. This paper aims to address the theoretical gaps in arXiv:2407.17373, specifically by providing a quantitative estimate of the mean-field limit with respect to the number of particles, as well as establishing the well-posedness of both the finite particle model and the corresponding mean-field dynamics.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12867v1",
    "categories": [
      "math.OC"
    ],
    "authors": [
      "Kezang Yuden",
      "Levin Nemesch",
      "Stefan Ruzika"
    ],
    "title": "Parametric Biobjective Linear Programming",
    "abstract": "We consider parametric linear programming problems with multiple objective functions depending linearly on some parameter. Both parametric (single-objective) linear programming and (non-parametric) multi-objective linear programming are well-researched topics. However, literature on the combination of both, parametric linear programming with multiple objectives, is scarce. This research gap encourages our work in this field. Our main focus is on biobjective linear programs with a single parameter. We establish a connection of this problem to non-parametric multi-objective problems. Using the so-called weight set decomposition, we are able to explain the behavior of parametric biobjective linear programs when the parameter value is variated. We investigate two special cases of parametric biobjective linear programs: In the first, there is only one parametric objective and, in the second, the parametric dependency is the same for both objectives. We prove that there is a one-to-one correspondence between the solution of the parametric program and the solution of the triobjective program using the weighted sum scalarization. We provide structural insights to the solution of the parametric biobjective linear program with respect to extreme weights of the weight set of the triobjective linear program and develop solution strategies for the parametric program.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12857v1",
    "categories": [
      "math.AT"
    ],
    "authors": [
      "Raju Kumar Gupta",
      "Soumen Sarkar"
    ],
    "title": "On the equivariant triangulation of some small covers",
    "abstract": "In this paper, we study certain properties of $\\mathbb{Z}_2^n$-equivariant triangulations of small covers. We show that any $\\mathbb{Z}_2^n$-equivariant triangulation of a small cover naturally induces a triangulation of the orbit space. Then, we explicitly construct the minimal $\\mathbb{Z}_2^3$-equivariant triangulation of $\\mathbb{RP}^3$, which contains $11$ vertices and prove that this is the unique $\\mathbb{Z}_2^3$-equivariant triangulation of $\\mathbb{RP}^3$ with $11$ vertices. For a finite group $G$, we give a method for constructing some $G$-equivariant triangulations of connected sums of manifolds from their respective $G$-equivariant triangulations. In particular, we construct a $\\mathbb{Z}_2^3$-equivariant triangulation of $\\mathbb{RP}^3 \\# \\mathbb{RP}^3$ with $17$ vertices, which is the best known yet. This triangulation of $\\mathbb{RP}^3 \\# \\mathbb{RP}^3$ provides another minimal $g$-vector improving one of the result of Lutz in \\cite{LS}. Moreover, we prove that a $\\ZZ_2^4$-equivariant triangulation of $\\mathbb{RP}^4$ requires at least $18$ vertices.",
    "date": "02-16"
  },
  {
    "link": "https://arxiv.org/pdf/2602.12850v1",
    "categories": [
      "math.NA"
    ],
    "authors": [
      "Xin Liu",
      "Qinglin Tang",
      "Yong Zhang"
    ],
    "title": "Fast convolution solvers using moment-matching",
    "abstract": "We propose two easy-to-implement fast algorithms based on moment-matching to compute the nonlocal potential $\\varphi(\\textbf{x})=(U\\ast ρ)(\\textbf{x})$ on bounded domain, where the kernel $U$ is singular at the origin and the density $ρ$ is a fast-decaying smooth function. Each method requires merely minor modifications to commonly-used existing methods, i.e., the sine spectral/Fourier quadrature method, and achieves a much better convergence rate. The key lies in the introduction of a smooth auxiliary function $ρ_1$ whose moments match those of the density up to an integer order $m$. Specifically, $ρ_1$ is constructed using Gaussian function in an explicit way and the associated potential can be calculated analytically. The moments of residual density vanish up to order $m$, and the corresponding residual potential $U \\ast (ρ-ρ_1)$ decays much faster than the original potential $\\varphi$ at the far field. As for the residual potential evaluation, for classical kernels (e.g., the Coulomb kernel), we solve a differential/pseudo-differential equation on a rectangular domain with homogeneous Dirichlet boundary conditions via sine pseudospectral method, and achieve an arbitrary high convergence rate. While, for general kernels, the regularity of Fourier integrand increase by $m$ thanks to the moments-vanishing property, therefore, the standard trapezoidal rule/midpoint quadrature also converges much faster. To gain a better numerical performance, we utilize the domain expansion technique to obtain better accuracy, and improve the efficiency by simplifying the quadrature into one discrete convolution and applying Fast Fourier Transform (FFT) to a double-sized vector. Rigorous error estimates and extensive numerical investigations showcase the accuracy and efficiency for different nonlocal potentials.",
    "date": "02-16"
  }
]